Repository: WaseemMirzaa/ispeedpix2pdf7
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, he, hi, it, ja, ko, pt, ru, th, zh

# privacyAndSecurityDetailThree
source: 3. One-Time Lifetime Subscription - iSpeedPix2PDF operates on a one-time lifetime subscription model, meaning you only need to pay once for full access to all features—no recurring charges, no hidden fees. Payment processing is handled securely through a service to verify and manage purchases. Once purchased, the app remains fully functional without requiring additional payments.
ar: ٢. لا نقل بيانات - كتطبيق من جهة العميل، يضمن iSpeedPix2PDF عدم نقل أيٍّ من بياناتك، بما في ذلك معلوماتك الشخصية أو ملفات PDF المُنشأة، إلى خوادم خارجية أو خدمات خارجية. كل خطوة من خطوات العملية - من اختيار الصور إلى الجينات ٣. اشتراك مدى الحياة لمرة واحدة - يعمل iSpeedPix2PDF بنظام اشتراك مدى الحياة لمرة واحدة، مما يعني أنك ستدفع مرة واحدة فقط للوصول الكامل إلى جميع الميزات - بدون رسوم متكررة أو رسوم خفية. تتم معالجة الدفع بأمان من خلال خدمة للتحقق من المشتريات وإدارتها. بمجرد الشراء، يظل التطبيق يعمل بكامل طاقته دون الحاجة إلى دفعات إضافية. تقييم ملفات PDF - يحدث بالكامل على جهازك، مما يضمن أعلى مستوى من الخصوصية والأمان.
de: 3. Einmalige Lifetime-Subscription - iSpeedPix2PDF funktioniert nach einem einmaligen Lifetime-Subscription-Modell, was bedeutet, dass Sie nur einmal für den vollständigen Zugriff auf alle Funktionen bezahlen müssen – keine wiederkehrenden Gebühren, keine versteckten Kosten. Die Zahlungsabwicklung erfolgt sicher über einen Dienst, der den Kauf verifiziert und verwaltet. Nach dem Kauf bleibt die App vollständig funktionsfähig, ohne dass zusätzliche Zahlungen erforderlich sind.
fr: 3. Abonnement à vie en un seul paiement - iSpeedPix2PDF fonctionne selon un modèle d'abonnement à vie avec un paiement unique, ce qui signifie que vous ne payez qu'une seule fois pour un accès complet à toutes les fonctionnalités — sans frais récurrents, ni frais cachés. Le traitement du paiement est effectué de manière sécurisée via un service chargé de vérifier et de gérer les achats. Une fois l'achat effectué, l'application reste entièrement fonctionnelle sans nécessiter de paiements supplémentaires.
he: 3. מנוי חד פעמי - iSpeedPix2PDF פועלת במודל של רכישה חד פעמית לכל החיים, כך שאתה משלם רק פעם אחת עבור גישה מלאה לכל הפונקציות—ללא תשלומים חוזרים, ללא עלויות נסתרות. עיבוד התשלומים מתבצע בצורה מאובטחת דרך שירות המאמת ומנהל רכישות. לאחר הרכישה, האפליקציה נשארת פונקציונלית במלואה ללא צורך בתשלומים נוספים.
hi: 3. एक बार का लाइफटाइम सब्सक्रिप्शन - iSpeedPix2PDF में एक बार भुगतान करें और सभी फीचर्स का आजीवन उपयोग करें। कोई आवर्ती शुल्क या छुपी हुई फीस नहीं।
it: 3. Abbonamento a vita una tantum - iSpeedPix2PDF funziona con un modello di abbonamento a vita una tantum, il che significa che devi pagare una sola volta per avere accesso completo a tutte le funzionalità — nessun costo ricorrente, nessuna tariffa nascosta. Il pagamento viene gestito in modo sicuro tramite un servizio per verificare e gestire gli acquisti. Una volta acquistata, l'app rimane completamente funzionante senza ulteriori pagamenti.
ja: 3. 一回限りの生涯サブスクリプション - iSpeedPix2PDFは一回限りの生涯サブスクリプションモデルで運営されており、すべての機能に一度の支払いでアクセス可能です。追加の料金や隠れた費用はありません。支払い処理は安全に行われ、購入後は追加支払いなしで完全に利用できます。
ko: 3. 일회성 평생 구독 - iSpeedPix2PDF는 일회성 평생 구독 모델을 운영하여, 모든 기능을 완전하게 이용하기 위해 한 번만 결제하면 됩니다. 반복 결제나 숨겨진 비용이 없습니다. 결제 처리는 안전한 서비스를 통해 검증 및 관리됩니다. 구매 후에는 추가 결제 없이 앱을 완전히 사용할 수 있습니다.
pt: 3. Assinatura Vitalícia Única - O iSpeedPix2PDF opera com um modelo de assinatura vitalícia única, ou seja, você paga uma vez para ter acesso completo a todos os recursos — sem cobranças recorrentes ou taxas ocultas. O processamento do pagamento é feito com segurança por um serviço para verificar e gerenciar compras. Após a compra, o app permanece totalmente funcional sem necessidade de pagamentos adicionais.
ru: 3. Одноразовая пожизненная подписка – iSpeedPix2PDF работает по модели одноразовой покупки с пожизненным доступом ко всем функциям без повторных платежей. Оплата обрабатывается через безопасный сервис для проверки и управления покупками.
th: 3. การสมัครสมาชิกแบบซื้อครั้งเดียว - iSpeedPix2PDF ใช้ระบบสมัครสมาชิกแบบซื้อครั้งเดียวเพื่อปลดล็อกฟีเจอร์ทั้งหมด ไม่มีค่าบริการรายเดือนหรือค่าธรรมเนียมซ่อนเร้น การชำระเงินจัดการอย่างปลอดภัยและแอปจะใช้งานได้เต็มที่หลังการซื้อ
zh: 3. 一次性终身订阅 - iSpeedPix2PDF采用一次性终身订阅模式，购买后即可无限制使用所有功能，无需重复付费。支付安全由第三方处理。购买后应用长期有效。

# privacyAndSecurityDetailFour
source: 4. No Advertisements - We do not display ads or sell your data. iSpeedPix2PDF is designed to provide a seamless and efficient user experience without interruptions from advertisements. Our focus is on ensuring a simple and secure method for creating and sharing PDFs, completely under your control.
ar: ٤. ممنوع الإعلانات - لا نعرض إعلانات ولا نبيع بياناتك. صُمم iSpeedPix2PDF لتوفير تجربة مستخدم سلسة وفعالة دون أي انقطاعات إعلانية. نركز على ضمان طريقة بسيطة وآمنة لإنشاء ملفات PDF ومشاركتها، تحت سيطرتك الكاملة.
de: 4. Keine Werbung - Wir zeigen keine Werbung an und verkaufen Ihre Daten nicht. iSpeedPix2PDF wurde entwickelt, um eine nahtlose und effiziente Benutzererfahrung zu bieten, ohne Unterbrechungen durch Werbung. Unser Fokus liegt darauf, eine einfache und sichere Methode zum Erstellen und Teilen von PDFs bereitzustellen, die vollständig unter Ihrer Kontrolle steht.
es: 4. Sin anuncios - No mostramos anuncios ni vendemos tus datos. iSpeedPix2PDF está diseñado para ofrecer una experiencia de usuario fluida y eficiente, sin interrupciones por publicidad. Nuestro enfoque está en garantizar un método simple y seguro para crear y compartir archivos PDF, completamente bajo tu control.
fr: 4. Aucune publicité - Nous n'affichons aucune publicité et ne vendons pas vos données. iSpeedPix2PDF est conçu pour offrir une expérience utilisateur fluide et efficace, sans interruption par des publicités. Notre objectif est de garantir une méthode simple et sécurisée pour créer et partager des PDF, entièrement sous votre contrôle.
he: 4. ללא פרסומות - אנו לא מציגים פרסומות או מוכרים את הנתונים שלך. iSpeedPix2PDF נבנתה לספק חוויית משתמש חלקה ויעילה ללא הפרעות מפרסומות. המיקוד שלנו הוא בהבטחת שיטה פשוטה ובטוחה ליצירת ושיתוף קובצי PDF, בשליטה מלאה שלך.
hi: 4. कोई विज्ञापन नहीं - हम कोई विज्ञापन नहीं दिखाते और आपका डेटा नहीं बेचते। हमारा फोकस एक सहज और सुरक्षित PDF बनाने के अनुभव पर है।
it: 4. Nessuna pubblicità - Non mostriamo annunci né vendiamo i tuoi dati. iSpeedPix2PDF è progettata per offrire un’esperienza utente fluida ed efficiente senza interruzioni pubblicitarie. Il nostro obiettivo è garantire un metodo semplice e sicuro per creare e condividere PDF, completamente sotto il tuo controllo.
ja: 4. 広告なし - 広告表示やデータ販売は行いません。iSpeedPix2PDFは広告に邪魔されずスムーズで効率的なユーザー体験を提供するために設計されています。PDF作成と共有が完全にユーザーのコントロール下で行えます。
ko: 4. 광고 없음 - 저희는 광고를 표시하지 않으며, 사용자 데이터를 판매하지 않습니다. iSpeedPix2PDF는 방해 없는 매끄럽고 효율적인 사용자 경험을 제공하며, PDF 생성 및 공유를 간단하고 안전하게 할 수 있도록 설계되었습니다.
pt: 4. Sem Anúncios - Não exibimos anúncios nem vendemos seus dados. O iSpeedPix2PDF foi criado para proporcionar uma experiência simples e eficiente, sem interrupções publicitárias. Nosso foco é garantir um método fácil e seguro para criar e compartilhar PDFs, totalmente sob seu controle.
ru: 4. Отсутствие рекламы – мы не показываем рекламу и не продаём ваши данные. iSpeedPix2PDF обеспечивает плавный и эффективный опыт без отвлекающих факторов, фокусируясь на простой и безопасной работе с PDF.
th: 4. ไม่มีโฆษณา - เราไม่แสดงโฆษณาหรือขายข้อมูลของคุณ iSpeedPix2PDF ออกแบบมาเพื่อประสบการณ์ใช้งานที่ราบรื่นและมีประสิทธิภาพโดยไม่มีการรบกวนจากโฆษณา เรามุ่งเน้นให้คุณสร้างและแชร์ PDF ได้อย่างง่ายดายและปลอดภัย
zh: 4. 无广告 - 我们不展示广告，也不出售用户数据。iSpeedPix2PDF致力于提供无干扰、简单安全的PDF创建与分享体验，完全由您掌控。

source: View
ar: منظر
de: Sicht
es: Vista
fr: Voir
he: הצג
hi: देखें
it: Visualizza
ja: 表示
ko: 보기
pt: Visualizar
ru: Просмотр
th: ดู
zh: 查看

# aboutTevinEighDescription
source: At Tevin Eigh Designs, we specialize in creating client-side apps that solve daily problems with simplicity, efficiency, and security. Our focus is on delivering the core functionality you need with the fewest steps and clicks possible, ensuring you can concentrate on your main tasks without distractions. Our Philosophy -Simplicity: Our apps are designed to be intuitive and straithforward, making them easy to use for everyone. -Security: By keeping all processing on the client side, we ensure your data remains private and secure. -Efficiency: We continually refine our apps to remove unnecessary steps while preserving their core functionality. We Believe in providing just what you need, nothing more, nothing less. As we evolve, our commitment remains to enhance efficiency without compromising on the primary purpose of our applications. Explore our range of client-side apps and experience the difference simplicity, efficiency, and security can make in your daily tasks. www.tevineigh.com
ar: في Tevin Eigh Designs، نتخصص في تصميم تطبيقات العميل التي تُعالج المشاكل اليومية ببساطة وكفاءة وأمان. ينصب تركيزنا على توفير الوظائف الأساسية التي تحتاجها بأقل عدد ممكن من الخطوات والنقرات، مما يضمن لك التركيز على مهامك الرئيسية دون أي تشتيت. فلسفتنا - البساطة: صُممت تطبيقاتنا لتكون بديهية ومباشرة، مما يجعلها سهلة الاستخدام للجميع. - الأمان: من خلال إبقاء جميع عمليات المعالجة على جانب العميل، نضمن لك خصوصية بياناتك وأمانها. - الكفاءة: نعمل باستمرار على تحسين تطبيقاتنا لإزالة الخطوات غير الضرورية مع الحفاظ على وظائفها الأساسية. نؤمن بتوفير ما تحتاجه فقط، لا أكثر ولا أقل. ومع تطورنا، يبقى التزامنا بتعزيز الكفاءة دون المساس بالغرض الأساسي لتطبيقاتنا. استكشف مجموعتنا من تطبيقات العميل وجرّب الفرق الذي تُحدثه البساطة والكفاءة والأمان في مهامك اليومية. www.tevineigh.com
de: Bei Tevin Eigh Designs spezialisieren wir uns auf die Entwicklung clientseitiger Apps, die alltägliche Probleme mit Einfachheit, Effizienz und Sicherheit lösen. Unser Fokus liegt darauf, Ihnen die Kernfunktionen mit so wenigen Schritten und Klicks wie möglich bereitzustellen, damit Sie sich ohne Ablenkung auf Ihre Hauptaufgaben konzentrieren können. Unsere Philosophie -Einfachheit: Unsere Apps sind intuitiv und unkompliziert gestaltet, sodass sie für jeden leicht zu bedienen sind. -Sicherheit: Durch die vollständige Verarbeitung auf der Client-Seite stellen wir sicher, dass Ihre Daten privat und sicher bleiben. -Effizienz: Wir verfeinern unsere Apps kontinuierlich, um unnötige Schritte zu entfernen und gleichzeitig die Kernfunktionen zu erhalten. Wir glauben daran, genau das bereitzustellen, was Sie brauchen – nicht mehr und nicht weniger. Auch wenn wir uns weiterentwickeln, bleibt unser Engagement bestehen, die Effizienz zu verbessern, ohne den Hauptzweck unserer Anwendungen zu beeinträchtigen. Entdecken Sie unsere Auswahl an clientseitigen Apps und erleben Sie den Unterschied, den Einfachheit, Effizienz und Sicherheit in Ihren täglichen Aufgaben machen können. www.tevineigh.com
es: En Tevin Eigh Designs, nos especializamos en crear aplicaciones del lado del cliente que resuelven problemas cotidianos con simplicidad, eficiencia y seguridad. Nuestro enfoque está en ofrecer la funcionalidad esencial que necesitas con la menor cantidad de pasos y clics posible, asegurando que puedas concentrarte en tus tareas principales sin distracciones. Nuestra filosofía -Simplicidad: Nuestras aplicaciones están diseñadas para ser intuitivas y sencillas, lo que las hace fáciles de usar para todos. -Seguridad: Al mantener todo el procesamiento en el lado del cliente, garantizamos que tus datos permanezcan privados y seguros. -Eficiencia: Refinamos continuamente nuestras aplicaciones para eliminar pasos innecesarios mientras preservamos su funcionalidad esencial. Creemos en ofrecer solo lo que necesitas, ni más ni menos. A medida que evolucionamos, nuestro compromiso sigue siendo mejorar la eficiencia sin comprometer el propósito principal de nuestras aplicaciones. Explora nuestra gama de aplicaciones del lado del cliente y experimenta la diferencia que la simplicidad, la eficiencia y la seguridad pueden hacer en tus tareas diarias. www.tevineigh.com
fr: Chez Tevin Eigh Designs, nous sommes spécialisés dans la création d'applications côté client qui résolvent les problèmes quotidiens avec simplicité, efficacité et sécurité. Notre priorité est de fournir la fonctionnalité essentielle dont vous avez besoin avec le moins d'étapes et de clics possible, afin que vous puissiez vous concentrer sur vos tâches principales sans distractions. Notre philosophie - Simplicité : Nos applications sont conçues pour être intuitives et simples, ce qui les rend faciles à utiliser pour tout le monde. - Sécurité : En gardant tout le traitement côté client, nous garantissons que vos données restent privées et sécurisées. - Efficacité : Nous améliorons continuellement nos applications pour éliminer les étapes inutiles tout en préservant leur fonctionnalité essentielle. Nous croyons en l'idée de fournir exactement ce dont vous avez besoin, rien de plus, rien de moins. À mesure que nous évoluons, notre engagement reste le même : améliorer l'efficacité sans compromettre l'objectif principal de nos applications. Découvrez notre gamme d'applications côté client et découvrez la différence que la simplicité, l'efficacité et la sécurité peuvent apporter à vos tâches quotidiennes. www.tevineigh.com
he: ב-Tevin Eigh Designs, אנו מתמחים בפיתוח אפליקציות מקומיות הפותרות בעיות יומיומיות בפשטות, יעילות ואבטחה. המיקוד שלנו הוא לספק את הפונקציונליות המרכזית שאתה צריך עם הכי מעט שלבים ולחיצות, כדי שתוכל להתרכז במשימות העיקריות שלך ללא הסחות דעת. הפילוסופיה שלנו: -פשטות: האפליקציות שלנו מעוצבות בצורה אינטואיטיבית וברורה, כך שכל אחד יכול להשתמש בהן. -אבטחה: על ידי עיבוד בצד הלקוח, אנו שומרים על פרטיותך ובטיחות המידע שלך. -יעילות: אנו משפרים כל הזמן את האפליקציות שלנו, ומסירים שלבים מיותרים תוך שמירה על הליבה הפונקציונלית. אנו מאמינים בלספק בדיוק את מה שאתה צריך, לא יותר ולא פחות. לאורך ההתפתחות שלנו, נמשיך לשפר את היעילות מבלי לוותר על מטרות היישומים שלנו. גלה את מגוון האפליקציות שלנו ותחווה את ההבדל שפשטות, יעילות ואבטחה יכולים לעשות. www.tevineigh.com
hi: Tevin Eigh Designs में हम सरलता, दक्षता, और सुरक्षा के साथ क्लाइंट-साइड ऐप्स बनाते हैं। हमारा फोकस मुख्य कार्यों को सरल बनाने पर है ताकि आप बिना बाधा के अपने काम पर ध्यान केंद्रित कर सकें। हमारा दर्शन -सरलता: ऐप्स को सहज और सरल बनाना। -सुरक्षा: प्रोसेसिंग क्लाइंट साइड होना। -दक्षता: अनावश्यक कदम हटाना। हम केवल उतना ही देते हैं जितना आवश्यक है। जैसे-जैसे हम बढ़ते हैं, हमारा उद्देश्य दक्षता बढ़ाना है बिना मुख्य उद्देश्य को खोए। हमारे क्लाइंट-साइड ऐप्स का अनुभव करें और दैनिक कार्यों में सरलता, दक्षता, और सुरक्षा का लाभ उठाएं। www.tevineigh.com
it: Presso Tevin Eigh Designs, siamo specializzati nella creazione di app lato client che risolvono i problemi quotidiani con semplicità, efficienza e sicurezza. Il nostro obiettivo è fornire le funzionalità principali di cui hai bisogno con il minor numero possibile di passaggi e clic, assicurandoti di poterti concentrare sulle tue attività principali senza distrazioni. La nostra filosofia - Semplicità: Le nostre app sono progettate per essere intuitive e semplici, rendendole facili da usare per tutti. - Sicurezza: Mantenendo tutta l’elaborazione sul lato client, garantiamo che i tuoi dati rimangano privati e sicuri. - Efficienza: Miglioriamo continuamente le nostre app per eliminare passaggi inutili, preservando al contempo le funzionalità principali. Crediamo nel fornire esattamente ciò di cui hai bisogno, né più né meno. Man mano che evolviamo, il nostro impegno rimane quello di migliorare l’efficienza senza compromettere lo scopo principale delle nostre applicazioni. Esplora la nostra gamma di app lato client e scopri la differenza che semplicità, efficienza e sicurezza possono fare nelle tue attività quotidiane. www.tevineigh.com
ja: Tevin Eigh Designsでは、シンプルで効率的かつ安全なクライアント側アプリの開発に特化しています。最小限のステップと操作で必要な機能を届けることに注力し、ユーザーが本来の作業に集中できる環境を提供します。 私たちの理念 - シンプルさ：誰でも簡単に使えるように直感的でわかりやすい設計。 - セキュリティ：すべての処理をクライアント側で行い、データのプライバシーと安全を確保。 - 効率性：不要なステップを排除しながらも、基本機能は損なわず継続的に改良。 必要なものだけを提供することに信念を持ち、進化し続ける中でもアプリの主要目的を維持しつつ効率性を高めることにコミットしています。 私たちのクライアント側アプリをぜひ体験し、シンプルさ、効率性、セキュリティが日常の作業にどれほどの違いをもたらすか感じてください。 www.tevineigh.com
ko: Tevin Eigh Designs는 단순함, 효율성, 그리고 보안을 중시하는 클라이언트 사이드 앱을 전문적으로 개발합니다. 최소한의 단계와 클릭으로 필요한 핵심 기능을 제공하여, 사용자가 주요 작업에 집중할 수 있도록 돕습니다. 저희 철학 - 단순함: 모든 사람이 쉽게 사용할 수 있도록 직관적이고 간단하게 설계합니다. - 보안: 모든 처리를 클라이언트 측에서 수행하여 데이터 프라이버시를 보장합니다. - 효율성: 불필요한 단계를 제거하면서 핵심 기능을 유지하기 위해 지속적으로 앱을 개선합니다. 필요한 것만 제공하며, 그 이상도 그 이하도 아닙니다. 앞으로도 본질을 해치지 않으면서 효율성을 높이는 데 최선을 다하겠습니다. 저희 클라이언트 사이드 앱을 경험하며, 단순함, 효율성, 보안이 여러분의 일상에 가져다주는 변화를 느껴보세요. www.tevineigh.com
pt: Na Tevin Eigh Designs, especializamo-nos em criar apps cliente que resolvem problemas do dia a dia com simplicidade, eficiência e segurança. Nosso foco é entregar a funcionalidade essencial com o mínimo de passos e cliques, para que você possa focar nas suas tarefas principais sem distrações. Nossa Filosofia -Simplicidade: Nossos apps são intuitivos e fáceis de usar para todos. -Segurança: Mantendo todo o processamento no dispositivo, garantimos a privacidade e segurança dos seus dados. -Eficiência: Refinamos constantemente nossos apps para eliminar etapas desnecessárias mantendo a funcionalidade essencial. Acreditamos em oferecer apenas o que você precisa, nada mais, nada menos. Conforme evoluímos, nosso compromisso é melhorar a eficiência sem comprometer o propósito principal dos nossos aplicativos. Explore nossa linha de apps cliente e experimente a diferença que simplicidade, eficiência e segurança podem fazer nas suas tarefas diárias. www.tevineigh.com
ru: Tevin Eigh Designs специализируется на создании клиентских приложений, решающих повседневные задачи с простотой, эффективностью и безопасностью. Мы концентрируемся на предоставлении основных функций с минимальным количеством шагов, чтобы вы могли сосредоточиться на главном. Наша философия - Простота: наши приложения интуитивны и понятны. - Безопасность: все данные обрабатываются на устройстве, что гарантирует конфиденциальность. - Эффективность: мы оптимизируем приложения, убирая лишние действия без потери функций. Мы предоставляем ровно то, что нужно — ничего лишнего. По мере развития приложений мы сохраняем приверженность эффективности без ущерба основным задачам. Ознакомьтесь с нашим ассортиментом клиентских приложений и почувствуйте разницу, которую приносят простота, эффективность и безопасность в повседневной работе. www.tevineigh.com
th: ที่ Tevin Eigh Designs เราเชี่ยวชาญในการสร้างแอปที่ประมวลผลบนอุปกรณ์ของผู้ใช้เพื่อแก้ปัญหาในชีวิตประจำวันด้วยความเรียบง่าย ประสิทธิภาพ และความปลอดภัย เรามุ่งเน้นให้ฟังก์ชันหลักใช้งานง่ายที่สุดเท่าที่จะเป็นไปได้ เพื่อให้คุณสามารถมุ่งเน้นกับงานหลักของคุณโดยไม่ถูกรบกวน ปรัชญาของเรา - ความเรียบง่าย: แอปของเราออกแบบให้ใช้งานง่ายและเข้าใจง่ายสำหรับทุกคน - ความปลอดภัย: ด้วยการประมวลผลทั้งหมดบนอุปกรณ์ของผู้ใช้ เรารักษาความเป็นส่วนตัวและความปลอดภัยของข้อมูล - ประสิทธิภาพ: เราพัฒนาแอปอย่างต่อเนื่องเพื่อลดขั้นตอนที่ไม่จำเป็นในขณะที่ยังคงฟังก์ชันหลักไว้ เราเชื่อในการให้สิ่งที่คุณต้องการเท่านั้น ไม่มากเกินไปและไม่น้อยเกินไป ในการพัฒนา เรามุ่งเน้นที่การเพิ่มประสิทธิภาพโดยไม่ลดทอนวัตถุประสงค์หลักของแอป ลองใช้แอปของเราและสัมผัสความแตกต่างของความเรียบง่าย ประสิทธิภาพ และความปลอดภัยในงานประจำวันของคุณ www.tevineigh.com
zh: Tevin Eigh Designs专注于开发客户端应用，解决日常问题，追求简洁、高效和安全。我们致力于用最少的步骤和点击，提供您所需的核心功能，让您专注于主要任务，减少干扰。 我们的理念 - 简洁：设计直观易用，适合所有用户。 - 安全：所有处理均在客户端进行，确保数据隐私安全。 - 高效：不断优化应用，去除多余步骤，保持核心功能完整。 我们坚信提供刚好所需，不多不少。随着发展，我们持续提升效率，确保应用核心目标不变。 探索我们的客户端应用系列，体验简洁、高效和安全带来的不同。 www.tevineigh.com

source: Language
de: Sprache
es: Idioma
fr: Langue
he: שפה
hi: भाषा
it: Lingua
ja: 言語
ko: 언어
pt: Idioma
ru: Язык
th: ภาษา
zh: 语言

source: Choose Language
ar: اختر اللغة
de: Sprache auswählen
es: Elige el lenguaje
fr: Choisir la langue
he: בחר שפה
hi: भाषा चुनें
it: Scegli la lingua
ja: 言語を選択
ko: 언어 선택
pt: Escolher idioma
ru: Выберите язык
th: เลือกภาษา
zh: 选择语言

# aboutAppDescription
source: Convert images to PDF quickly and easily
de: Bilder schnell und einfach in PDF konvertieren
es: Convertir imágenes en pdf rápida y fácilmente
fr: Convertir les images en PDF rapidement et facilement
he: המר תמונות ל-PDF במהירות ובקלות
hi: छवियों को PDF में जल्दी और आसानी से कनवर्ट करें
it: Converti immagini in PDF rapidamente e facilmente
ja: 画像を素早く簡単にPDFに変換
ko: 이미지를 빠르고 쉽게 PDF로 변환
pt: Converta imagens para PDF rápida e facilmente
ru: Быстро и легко конвертируйте изображения в PDF
th: แปลงรูปภาพเป็น PDF อย่างรวดเร็วและง่ายดาย
zh: 快速轻松将图片转换为PDF

source: Settings
de: Einstellungen
es: Ajustes
fr: Paramètres
he: הגדרות
hi: सेटिंग्स
it: Impostazioni
ja: 設定
ko: 설정
pt: Configurações
ru: Настройки
th: การตั้งค่า
zh: 设置

source: Select Language
ar: اختر اللغة
de: Sprache auswählen
es: Lenguaje seleccionado
fr: Sélectionner la langue
he: בחר שפה
hi: भाषा चुनें
it: Seleziona lingua
ja: 言語を選択
ko: 언어 선택
pt: Selecionar idioma
ru: Выбор языка
th: เลือกภาษา
zh: 选择语言

source: Save
de: Speichern
es: Guardar
fr: Enregistrer
he: שמור
hi: सहेजें
ko: 저장
pt: Salvar
ru: Сохранить

# privacyAndSecurityDetailFive
source: 5. Privacy Policy - Our apps use Google Firebase for App Store Optimization (ASO) and Search Engine Optimization (SEO) purposes only. We do not collect, sell, or use this information for any other purposes. For more information about Google Firebase’s data practices, please refer to their Privacy Policy:
de: 5. Datenschutzrichtlinie – Unsere Apps verwenden Google Firebase ausschließlich zu Zwecken der App Store-Optimierung (ASO) und der Suchmaschinenoptimierung (SEO). Wir sammeln, verkaufen oder verwenden diese Informationen nicht für andere Zwecke. Weitere Informationen zu den Datenpraktiken von Google Firebase finden Sie in deren Datenschutzrichtlinie:
es: 5. Política de privacidad: nuestras aplicaciones utilizan Google Firebase únicamente con fines de Optimización en la Tienda de Aplicaciones (ASO) y Optimización en Motores de Búsqueda (SEO). No recopilamos, vendemos ni utilizamos esta información para otros fines. Para más información sobre las prácticas de datos de Google Firebase, por favor consulta su Política de Privacidad:
fr: 5. Politique de confidentialité - Nos applications utilisent Google Firebase uniquement à des fins d'optimisation de l'App Store (ASO) et de référencement (SEO). Nous ne collectons, ne vendons ni n'utilisons ces informations à d'autres fins. Pour plus d'informations sur les pratiques de Google Firebase en matière de données, veuillez consulter leur politique de confidentialité :
he: 5. מדיניות פרטיות - האפליקציות שלנו משתמשות ב-Google Firebase לצורכי אופטימיזציה לחנויות אפליקציות (ASO) ואופטימיזציה למנועי חיפוש (SEO) בלבד. אנחנו לא אוספים, מוכרים או משתמשים במידע זה לכל מטרה אחרת. למידע נוסף על מדיניות השמירה על פרטיות של Google Firebase, אנא עיין במדיניות הפרטיות שלהם:
hi: 5. गोपनीयता नीति - हमारे ऐप्स केवल ऐप स्टोर ऑप्टिमाइज़ेशन (ASO) और सर्च इंजन ऑप्टिमाइज़ेशन (SEO) के उद्देश्य से Google Firebase का उपयोग करते हैं। हम इस जानकारी को किसी अन्य उद्देश्य के लिए एकत्रित, बेचते या उपयोग नहीं करते हैं। Google Firebase की डेटा प्रथाओं के बारे में अधिक जानकारी के लिए, कृपया उनकी गोपनीयता नीति देखें:
ko: 5. 개인정보 보호정책 - 당사의 앱은 앱 스토어 최적화(ASO) 및 검색 엔진 최적화(SEO) 목적에 한하여 Google Firebase를 사용합니다. 우리는 이 정보를 다른 목적으로 수집하거나 판매하거나 사용하지 않습니다. Google Firebase의 데이터 처리 방식에 대한 자세한 내용은 해당 개인정보 보호정책을 참고해 주세요:
pt: 5. Política de Privacidade - Nossos aplicativos utilizam o Google Firebase apenas para fins de Otimização da App Store (ASO) e Otimização de Motores de Busca (SEO). Não coletamos, vendemos ou utilizamos essas informações para quaisquer outros fins. Para mais informações sobre as práticas de dados do Google Firebase, consulte a Política de Privacidade deles:
ru: 5. Политика конфиденциальности — Наши приложения используют Google Firebase исключительно для оптимизации в App Store (ASO) и поисковой оптимизации (SEO). Мы не собираем, не продаем и не используем эту информацию для других целей. Для получения дополнительной информации о политике конфиденциальности Google Firebase, пожалуйста, ознакомьтесь с их Политикой конфиденциальности:
