Repository: WaseemMirzaa/ispeedpix2pdf7
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, he, hi, it, ja, ko, pt, ru, th, zh

source: Monthly Usage Limit Reached
de: Monatliches Nutzungslimit erreicht
es: Límite mensual de uso alcanzado
fr: Limite mensuelle d'utilisation atteinte
he: הגעת למגבלת השימוש החודשית
hi: मासिक उपयोग सीमा पूरी हो गई है
ko: 월간 사용 한도에 도달했습니다
pt: Limite de uso mensal atingido
ru: Достигнут месячный лимит использования

# monthlyUsageLimitDescription
source: You've used your 3 minutes of free usage time for this month. Your usage time will reset at the beginning of next month.
de: Sie haben Ihre 3 Minuten kostenlose Nutzungszeit für diesen Monat aufgebraucht. Ihre Nutzungszeit wird zu Beginn des nächsten Monats zurückgesetzt.
es: Has utilizado tus 3 minutos de tiempo de uso gratuito de este mes. Tu tiempo de uso se restablecerá al comienzo del próximo mes.
fr: Vous avez utilisé vos 3 minutes de temps d'utilisation gratuit pour ce mois. Votre temps d'utilisation sera réinitialisé au début du mois prochain.
he: ניצלת את 3 הדקות של זמן השימוש החינמי שלך לחודש זה. זמן השימוש יתאפס בתחילת החודש הבא.
hi: आपने इस महीने के लिए अपनी 3 मिनट की निःशुल्क उपयोग अवधि समाप्त कर ली है। आपकी उपयोग अवधि अगले महीने की शुरुआत में रीसेट हो जाएगी।
ko: 이번 달의 무료 사용 시간 3분을 모두 사용하셨습니다. 사용 시간은 다음 달 초에 초기화됩니다.
pt: Você utilizou seus 3 minutos de tempo gratuito este mês. Seu tempo de uso será reiniciado no início do próximo mês.
ru: Вы использовали свои 3 бесплатные минуты использования в этом месяце. Время использования будет сброшено в начале следующего месяца.

# unlockUnlimitedUsageWithSubscription
source: Unlock unlimited usage time with a one-time purchase of our lifetime subscription.
de: Schalten Sie unbegrenzte Nutzungszeit mit einem einmaligen Kauf unseres lebenslangen Abonnements frei.
es: Desbloquea tiempo de uso ilimitado con una compra única de nuestra suscripción de por vida.
fr: Débloquez un temps d'utilisation illimité avec un achat unique de notre abonnement à vie.
he: פתח זמן שימוש בלתי מוגבל ברכישה חד-פעמית של מנוי לכל החיים.
hi: हमारी आजीवन सदस्यता की एकमुश्त खरीद के साथ असीमित उपयोग समय अनलॉक करें।
ko: 평생 구독을 한 번만 구매하면 무제한 사용 시간이 해제됩니다.
pt: Desbloqueie tempo de uso ilimitado com uma compra única da nossa assinatura vitalícia.
ru: Разблокируйте неограниченное время использования с помощью однократной покупки пожизненной подписки.

# laterButton
source: Later
de: Später
es: Más tarde
fr: Plus tard
he: אחר כך
hi: बाद में
ko: 나중에
pt: Mais tarde
ru: Позже

# remainingUsageTime
source: Remaining usage time: {minutes} min {seconds} sec
de: Verbleibende Nutzungszeit: {minutes} Min. {seconds} Sek.
es: Tiempo de uso restante: {minutes} min {seconds} seg
fr: Temps d'utilisation restant : {minutes} min {seconds} sec
he: זמן שימוש שנותר: {minutes} דקות {seconds} שניות
hi: शेष उपयोग समय: {minutes} मिनट {seconds} सेकंड
ko: 남은 사용 시간: {minutes}분 {seconds}초
pt: Tempo de uso restante: {minutes} min {seconds} seg
ru: Оставшееся время использования: {minutes} мин {seconds} сек

# threeMinutesUsagePerMonth
source: ✔ 3 minutes of usage time per month
de: ✔ 3 Minuten Nutzungszeit pro Monat
es: ✔ 3 minutos de uso por mes
fr: ✔ 3 minutes d'utilisation par mois
he: ✔ 3 דקות שימוש בכל חודש
hi: ✔ प्रति माह 3 मिनट का उपयोग समय
ko: ✔ 매월 3분의 사용 시간
pt: ✔ 3 minutos de uso por mês
ru: ✔ 3 минуты использования в месяц

# usageTimeResetMonthly
source: ✔ Usage time resets monthly
de: ✔ Nutzungszeit wird monatlich zurückgesetzt
es: ✔ El tiempo de uso se restablece mensualmente
fr: ✔ Le temps d'utilisation est réinitialisé chaque mois
he: ✔ זמן השימוש מתאפס אחת לחודש
hi: ✔ उपयोग समय मासिक रूप से रीसेट होता है
ko: ✔ 사용 시간은 매월 초기화됩니다
pt: ✔ O tempo de uso é reiniciado mensalmente
ru: ✔ Время использования сбрасывается ежемесячно

source: Trial Time Left
de: Verbleibende Testzeit
es: Tiempo de Prueba Restante
fr: Temps d'Essai Restant
he: זמן ניסיון נותר
hi: ट्रायल समय बचा है
ko: 체험 시간 남음
pt: Tempo de Teste Restante
ru: Осталось пробного времени

# remainingTime
source: {minutes}:{seconds} remaining
de: {minutes}:{seconds} verbleibend
es: {minutes}:{seconds} restante
fr: {minutes}:{seconds} restant
he: נותר {minutes}:{seconds}
hi: {minutes}:{seconds} बचा है
ko: {minutes}:{seconds} 남음
pt: {minutes}:{seconds} restante
ru: осталось {minutes}:{seconds}

source: Unlock Unlimited Access Today!
de: Schalten Sie heute unbegrenzten Zugang frei!
es: ¡Desbloquea Acceso Ilimitado Hoy!
fr: Débloquez l'Accès Illimité Aujourd'hui !
he: פתח גישה בלתי מוגבלת היום!
hi: आज असीमित पहुंच अनलॉक करें!
ko: 오늘 무제한 액세스 잠금 해제!
pt: Desbloqueie Acesso Ilimitado Hoje!
ru: Разблокируйте неограниченный доступ сегодня!

# enjoyingFreeTrialUpgradeMessage
source: You're enjoying the free trial! Why wait? Upgrade now to our lifetime plan and never worry about time limits again. One payment, unlimited usage forever — no subscriptions, no recurring charges!
de: Sie genießen die kostenlose Testversion! Warum warten? Upgraden Sie jetzt auf unseren Lifetime-Plan und machen Sie sich nie wieder Sorgen über Zeitlimits. Eine Zahlung, unbegrenzte Nutzung für immer — keine Abonnements, keine wiederkehrenden Gebühren!
es: ¡Estás disfrutando la prueba gratuita! ¿Por qué esperar? Actualiza ahora a nuestro plan de por vida y nunca te preocupes por los límites de tiempo. ¡Un pago, uso ilimitado para siempre — sin suscripciones, sin cargos recurrentes!
fr: Vous profitez de l'essai gratuit ! Pourquoi attendre ? Passez maintenant à notre plan à vie et ne vous souciez plus jamais des limites de temps. Un paiement, utilisation illimitée pour toujours — pas d'abonnements, pas de frais récurrents !
he: אתה נהנה מהניסיון החינמי! למה לחכות? שדרג עכשיו לתוכנית לכל החיים שלנו ולעולם לא תדאג יותר ממגבלות זמן. תשלום אחד, שימוש בלתי מוגבל לנצח — ללא מנויים, ללא חיובים חוזרים!
hi: आप मुफ्त ट्रायल का आनंद ले रहे हैं! क्यों इंतजार करें? अब हमारे लाइफटाइम प्लान में अपग्रेड करें और समय सीमा की चिंता कभी न करें। एक भुगतान, हमेशा के लिए असीमित उपयोग — कोई सब्सक्रिप्शन नहीं, कोई आवर्ती शुल्क नहीं!
ko: 무료 체험을 즐기고 계시는군요! 왜 기다리시나요? 지금 평생 플랜으로 업그레이드하여 시간 제한을 더 이상 걱정하지 마세요. 한 번의 결제, 영구 무제한 사용 — 구독 없음, 반복 요금 없음!
pt: Você está aproveitando o teste gratuito! Por que esperar? Atualize agora para nosso plano vitalício e nunca mais se preocupe com limites de tempo. Um pagamento, uso ilimitado para sempre — sem assinaturas, sem taxas recorrentes!
ru: Вы наслаждаетесь бесплатной пробной версией! Зачем ждать? Обновитесь сейчас до нашего пожизненного плана и больше никогда не беспокойтесь о временных ограничениях. Один платеж, неограниченное использование навсегда — без подписок, без повторяющихся платежей!

# usagePausedThirtyDays
source: Usage Paused (30 Days)
de: Nutzung Pausiert (30 Tage)
es: Uso Pausado (30 Días)
fr: Utilisation Suspendue (30 Jours)
he: השימוש הושהה (30 יום)
hi: उपयोग रोका गया (30 दिन)
ko: 사용 일시정지 (30일)
pt: Uso Pausado (30 Dias)
ru: Использование приостановлено (30 дней)

source: Free Time Expired
de: Kostenlose Zeit Abgelaufen
es: Tiempo Gratuito Expirado
fr: Temps Gratuit Expiré
he: הזמן החינמי פג
hi: मुफ्त समय समाप्त
ko: 무료 시간 만료
pt: Tempo Gratuito Expirado
ru: Бесплатное время истекло

source: Almost Out of Free Time
de: Fast Keine Kostenlose Zeit Mehr
es: Casi Sin Tiempo Gratuito
fr: Presque Plus de Temps Gratuit
he: כמעט נגמר הזמן החינמי
hi: मुफ्त समय लगभग समाप्त
ko: 무료 시간 거의 소진
pt: Quase Sem Tempo Gratuito
ru: Почти закончилось бесплатное время

# usagePausedMessage
source: Your free time is paused for {days} more days. Upgrade to our lifetime plan to get unlimited usage immediately — no recurring charges, no subscriptions.
de: Ihre kostenlose Zeit ist für {days} weitere Tage pausiert. Upgraden Sie auf unseren Lifetime-Plan, um sofort unbegrenzte Nutzung zu erhalten — keine wiederkehrenden Gebühren, keine Abonnements.
es: Tu tiempo gratuito está pausado por {days} días más. Actualiza a nuestro plan de por vida para obtener uso ilimitado inmediatamente — sin cargos recurrentes, sin suscripciones.
fr: Votre temps gratuit est suspendu pour {days} jours de plus. Passez à notre plan à vie pour obtenir une utilisation illimitée immédiatement — pas de frais récurrents, pas d'abonnements.
he: הזמן החינמי שלך מושהה עוד {days} ימים. שדרג לתוכנית לכל החיים שלנו כדי לקבל שימוש בלתי מוגבל מיד — ללא חיובים חוזרים, ללא מנויים.
hi: आपका मुफ्त समय {days} और दिनों के लिए रोका गया है। तुरंत असीमित उपयोग पाने के लिए हमारे लाइफटाइम प्लान में अपग्रेड करें — कोई आवर्ती शुल्क नहीं, कोई सब्सक्रिप्शन नहीं।
ko: 무료 시간이 {days}일 더 일시정지되었습니다. 평생 플랜으로 업그레이드하여 즉시 무제한 사용을 얻으세요 — 반복 요금 없음, 구독 없음.
pt: Seu tempo gratuito está pausado por mais {days} dias. Atualize para nosso plano vitalício para obter uso ilimitado imediatamente — sem taxas recorrentes, sem assinaturas.
ru: Ваше бесплатное время приостановлено еще на {days} дней. Обновитесь до нашего пожизненного плана, чтобы получить неограниченное использование немедленно — без повторяющихся платежей, без подписок.

# freeTimeExpiredMessage
source: ⏰ Time's up! But your journey continues...🌟 Upgrade to Premium and scan without limits! Join thousands of users who've unlocked their full potential.
de: ⏰ Zeit ist um! Aber Ihre Reise geht weiter...🌟 Upgraden Sie auf Premium und scannen Sie ohne Grenzen! Schließen Sie sich Tausenden von Nutzern an, die ihr volles Potenzial freigeschaltet haben.
es: ⏰ ¡Se acabó el tiempo! Pero tu viaje continúa...🌟 ¡Actualiza a Premium y escanea sin límites! Únete a miles de usuarios que han desbloqueado su potencial completo.
fr: ⏰ Le temps est écoulé ! Mais votre voyage continue...🌟 Passez à Premium et scannez sans limites ! Rejoignez des milliers d'utilisateurs qui ont débloqué leur plein potentiel.
he: הזמן החינמי שלך פג! שדרג לתוכנית לכל החיים שלנו בתשלום חד-פעמי — ללא חיובים חוזרים, ללא מנויים. קבל שימוש בלתי מוגבל לנצח.
hi: आपका मुफ्त समय समाप्त हो गया है! एक बार के भुगतान के साथ हमारे लाइफटाइम प्लान में अपग्रेड करें — कोई आवर्ती शुल्क नहीं, कोई सब्सक्रिप्शन नहीं। हमेशा के लिए असीमित उपयोग प्राप्त करें।
ko: 무료 시간이 만료되었습니다! 일회성 결제로 평생 플랜으로 업그레이드 — 반복 요금 없음, 구독 없음. 영구 무제한 사용을 얻으세요.
pt: Seu tempo gratuito expirou! Atualize para nosso plano vitalício com um único pagamento — sem taxas recorrentes, sem assinaturas. Obtenha uso ilimitado para sempre.
ru: Ваше бесплатное время истекло! Обновитесь до нашего пожизненного плана с единовременным платежом — без повторяющихся платежей, без подписок. Получите неограниченное использование навсегда.

# almostOutOfFreeTimeMessage
source: You're almost out of free time this month! Upgrade to our lifetime plan with a single one-time payment — no recurring charges, no subscriptions. Get unlimited usage forever.
de: Ihnen geht fast die kostenlose Zeit für diesen Monat aus! Upgraden Sie auf unseren Lifetime-Plan mit einer einmaligen Zahlung — keine wiederkehrenden Gebühren, keine Abonnements. Erhalten Sie unbegrenzte Nutzung für immer.
es: ¡Casi te quedas sin tiempo gratuito este mes! Actualiza a nuestro plan de por vida con un solo pago único — sin cargos recurrentes, sin suscripciones. Obtén uso ilimitado para siempre.
fr: Vous n'avez presque plus de temps gratuit ce mois-ci ! Passez à notre plan à vie avec un seul paiement unique — pas de frais récurrents, pas d'abonnements. Obtenez une utilisation illimitée pour toujours.
he: כמעט נגמר לך הזמן החינמי החודש! שדרג לתוכנית לכל החיים שלנו בתשלום חד-פעמי — ללא חיובים חוזרים, ללא מנויים. קבל שימוש בלתי מוגבל לנצח.
hi: इस महीने आपका मुफ्त समय लगभग समाप्त हो रहा है! एक बार के भुगतान के साथ हमारे लाइफटाइम प्लान में अपग्रेड करें — कोई आवर्ती शुल्क नहीं, कोई सब्सक्रिप्शन नहीं। हमेशा के लिए असीमित उपयोग प्राप्त करें।
ko: 이번 달 무료 시간이 거의 소진되었습니다! 일회성 결제로 평생 플랜으로 업그레이드 — 반복 요금 없음, 구독 없음. 영구 무제한 사용을 얻으세요.
pt: Você está quase sem tempo gratuito este mês! Atualize para nosso plano vitalício com um único pagamento — sem taxas recorrentes, sem assinaturas. Obtenha uso ilimitado para sempre.
ru: У вас почти закончилось бесплатное время в этом месяце! Обновитесь до нашего пожизненного плана с единовременным платежом — без повторяющихся платежей, без подписок. Получите неограниченное использование навсегда.

source: Subscribe Now
de: Jetzt Abonnieren
es: Suscribirse Ahora
fr: S'abonner Maintenant
he: הירשם עכשיו
hi: अभी सब्सक्राइब करें
ko: 지금 구독
pt: Assinar Agora
ru: Подписаться сейчас

source: Liking the App?
de: Gefällt Ihnen die App?
es: ¿Te Gusta la App?
fr: Vous Aimez l'App ?
he: אוהב את האפליקציה?
hi: ऐप पसंद है?
ko: 앱이 마음에 드시나요?
pt: Gostando do App?
ru: Нравится приложение?

# likingTheAppMessage
source: Liking the app? Get lifetime access today with a single one-time payment — no recurring charges, no subscriptions. Unlock unlimited usage forever!
de: Gefällt Ihnen die App? Erhalten Sie heute lebenslangen Zugang mit einer einmaligen Zahlung — keine wiederkehrenden Gebühren, keine Abonnements. Schalten Sie unbegrenzte Nutzung für immer frei!
es: ¿Te gusta la app? Obtén acceso de por vida hoy con un solo pago único — sin cargos recurrentes, sin suscripciones. ¡Desbloquea uso ilimitado para siempre!
fr: Vous aimez l'app ? Obtenez un accès à vie aujourd'hui avec un seul paiement unique — pas de frais récurrents, pas d'abonnements. Débloquez une utilisation illimitée pour toujours !
he: אוהב את האפליקציה? קבל גישה לכל החיים היום בתשלום חד-פעמי — ללא חיובים חוזרים, ללא מנויים. פתח שימוש בלתי מוגבל לנצח!
hi: ऐप पसंद है? एक बार के भुगतान के साथ आज लाइफटाइम एक्सेस प्राप्त करें — कोई आवर्ती शुल्क नहीं, कोई सब्सक्रिप्शन नहीं। हमेशा के लिए असीमित उपयोग अनलॉक करें!
ko: 앱이 마음에 드시나요? 일회성 결제로 오늘 평생 액세스를 얻으세요 — 반복 요금 없음, 구독 없음. 영구 무제한 사용을 잠금 해제하세요!
pt: Gostando do app? Obtenha acesso vitalício hoje com um único pagamento — sem taxas recorrentes, sem assinaturas. Desbloqueie uso ilimitado para sempre!
ru: Нравится приложение? Получите пожизненный доступ сегодня с единовременным платежом — без повторяющихся платежей, без подписок. Разблокируйте неограниченное использование навсегда!

# maybeLatr
source: Maybe Later
de: Vielleicht Später
es: Tal Vez Después
fr: Peut-être Plus Tard
he: אולי מאוחר יותר
hi: शायद बाद में
ko: 나중에
pt: Talvez Depois
ru: Может быть позже

source: Get Lifetime Access
de: Lebenslangen Zugang Erhalten
es: Obtener Acceso de Por Vida
fr: Obtenir l'Accès à Vie
he: קבל גישה לכל החיים
hi: लाइफटाइम एक्सेस प्राप्त करें
ko: 평생 액세스 얻기
pt: Obter Acesso Vitalício
ru: Получить пожизненный доступ

source: Still Enjoying It?
de: Gefällt Es Ihnen Noch?
es: ¿Aún la Disfrutas?
fr: Vous l'Appréciez Toujours ?
he: עדיין נהנה?
hi: अभी भी पसंद है?
ko: 아직도 즐기고 계시나요?
pt: Ainda Gostando?
ru: Все еще нравится?

# stillEnjoyingItMessage
source: Still enjoying it? Upgrade now and keep access forever with our lifetime plan — one payment, no subscriptions, unlimited usage for life!
de: Gefällt es Ihnen noch? Upgraden Sie jetzt und behalten Sie den Zugang für immer mit unserem Lifetime-Plan — eine Zahlung, keine Abonnements, unbegrenzte Nutzung fürs Leben!
es: ¿Aún la disfrutas? Actualiza ahora y mantén el acceso para siempre con nuestro plan de por vida — ¡un pago, sin suscripciones, uso ilimitado de por vida!
fr: Vous l'appréciez toujours ? Passez maintenant et gardez l'accès pour toujours avec notre plan à vie — un paiement, pas d'abonnements, utilisation illimitée à vie !
he: עדיין נהנה? שדרג עכשיו ושמור על הגישה לנצח עם תוכנית לכל החיים שלנו — תשלום אחד, ללא מנויים, שימוש בלתי מוגבל לכל החיים!
hi: अभी भी पसंद है? अब अपग्रेड करें और हमारे लाइफटाइम प्लान के साथ हमेशा के लिए एक्सेस बनाए रखें — एक भुगतान, कोई सब्सक्रिप्शन नहीं, जीवन भर असीमित उपयोग!
ko: 아직도 즐기고 계시나요? 지금 업그레이드하여 평생 플랜으로 영구 액세스를 유지하세요 — 한 번의 결제, 구독 없음, 평생 무제한 사용!
pt: Ainda gostando? Atualize agora e mantenha o acesso para sempre com nosso plano vitalício — um pagamento, sem assinaturas, uso ilimitado para a vida!
ru: Все еще нравится? Обновитесь сейчас и сохраните доступ навсегда с нашим пожизненным планом — один платеж, без подписок, неограниченное использование на всю жизнь!

source: Not Now
de: Nicht Jetzt
es: Ahora No
fr: Pas Maintenant
he: לא עכשיו
hi: अभी नहीं
ko: 지금은 안함
pt: Agora Não
ru: Не сейчас

source: Upgrade Forever
de: Für Immer Upgraden
es: Actualizar Para Siempre
fr: Passer à Vie
he: שדרג לנצח
hi: हमेशा के लिए अपग्रेड करें
ko: 영구 업그레이드
pt: Atualizar Para Sempre
ru: Обновить навсегда

# almostOutOfFreeTimeTitle
source: Almost Out of Free Time
de: Fast Keine Kostenlose Zeit Mehr
es: Casi Sin Tiempo Gratuito
fr: Presque Plus de Temps Gratuit
he: כמעט נגמר הזמן החינמי
hi: मुफ्त समय लगभग समाप्त
ko: 무료 시간 거의 소진
pt: Quase Sem Tempo Gratuito
ru: Почти закончилось бесплатное время

# almostOutOfFreeTimeWarningMessage
source: You're almost out of free time this month! Upgrade to our lifetime plan with a single one-time payment — no recurring charges, no subscriptions. Get unlimited usage forever.
de: Ihnen geht fast die kostenlose Zeit für diesen Monat aus! Upgraden Sie auf unseren Lifetime-Plan mit einer einmaligen Zahlung — keine wiederkehrenden Gebühren, keine Abonnements. Erhalten Sie unbegrenzte Nutzung für immer.
es: ¡Casi te quedas sin tiempo gratuito este mes! Actualiza a nuestro plan de por vida con un solo pago único — sin cargos recurrentes, sin suscripciones. Obtén uso ilimitado para siempre.
fr: Vous n'avez presque plus de temps gratuit ce mois-ci ! Passez à notre plan à vie avec un seul paiement unique — pas de frais récurrents, pas d'abonnements. Obtenez une utilisation illimitée pour toujours.
he: כמעט נגמר לך הזמן החינמי החודש! שדרג לתוכנית לכל החיים שלנו בתשלום חד-פעמי — ללא חיובים חוזרים, ללא מנויים. קבל שימוש בלתי מוגבל לנצח.
hi: इस महीने आपका मुफ्त समय लगभग समाप्त हो रहा है! एक बार के भुगतान के साथ हमारे लाइफटाइम प्लान में अपग्रेड करें — कोई आवर्ती शुल्क नहीं, कोई सब्सक्रिप्शन नहीं। हमेशा के लिए असीमित उपयोग प्राप्त करें।
ko: 이번 달 무료 시간이 거의 소진되었습니다! 일회성 결제로 평생 플랜으로 업그레이드 — 반복 요금 없음, 구독 없음. 영구 무제한 사용을 얻으세요.
pt: Você está quase sem tempo gratuito este mês! Atualize para nosso plano vitalício com um único pagamento — sem taxas recorrentes, sem assinaturas. Obtenha uso ilimitado para sempre.
ru: У вас почти закончилось бесплатное время в этом месяце! Обновитесь до нашего пожизненного плана с единовременным платежом — без повторяющихся платежей, без подписок. Получите неограниченное использование навсегда.

source: Later
de: Später
es: Después
fr: Plus Tard
he: מאוחר יותר
hi: बाद में
ko: 나중에
pt: Depois
ru: Позже

source: Upgrade Now
de: Jetzt Upgraden
es: Actualizar Ahora
fr: Passer Maintenant
he: שדרג עכשיו
hi: अभी अपग्रेड करें
ko: 지금 업그레이드
pt: Atualizar Agora
ru: Обновить сейчас

# creatingPdfMessage
source: Creating PDF...
de: PDF wird erstellt...
es: Creando PDF...
fr: Création du PDF...
he: יוצר PDF...
hi: PDF बनाया जा रहा है...
ko: PDF 생성 중...
pt: Criando PDF...
ru: Создание PDF...

source: day
de: Tag
es: día
fr: jour
he: יום
hi: दिन
ko: 일
pt: dia
ru: день

source: days
de: Tage
es: días
fr: jours
he: ימים
hi: दिन
ko: 일
pt: dias
ru: дней

source: left
de: übrig
es: restante
fr: restant
he: נותר
hi: बचे
ko: 남음
pt: restante
ru: осталось

source: session time
de: Sitzungszeit
es: tiempo de sesión
fr: temps de session
he: זמן הפעלה
hi: सत्र समय
ko: 세션 시간
pt: tempo de sessão
ru: время сеанса
