// ignore: unused_import
import 'package:intl/intl.dart' as intl;
import 'app_localizations.dart';

// ignore_for_file: type=lint

/// The translations for Russian (`ru`).
class AppLocalizationsRu extends AppLocalizations {
  AppLocalizationsRu([String locale = 'ru']) : super(locale);

  @override
  String get rest => 'Reset';

  @override
  String get appTitle => 'iSpeedPix2PDF';

  @override
  String get defaultMixedOrientation => 'ПО УМОЛЧАНИЮ – СМЕШАННАЯ ОРИЕНТАЦИЯ';

  @override
  String get pagesFixedPortrait => 'Страницы зафиксированы – портрет';

  @override
  String get landscapePhotosTopAlignedForEasyViewing =>
      'Фото в ландшафтной ориентации – выровнены сверху для удобного просмотра';

  @override
  String get reset => 'Сбросить';

  @override
  String get chooseFiles => 'Выбрать файлы';

  @override
  String get noFilesSelected => 'Файлы не выбраны';

  @override
  String get youCanSelectUpTo3ImagesInFreeVersion =>
      '*В бесплатной версии можно выбрать до 3 изображений';

  @override
  String get youCanSelectUpTo60Images => '*Можно выбрать до 60 изображений';

  @override
  String get filename => 'Имя файла';

  @override
  String get filenameOptional => 'Имя файла (необязательно)';

  @override
  String get enterCustomFileNameOptional => 'Введите имя файла (необязательно)';

  @override
  String get filenameCannotContainCharacters =>
      'Имя файла не может содержать следующие символы: \\ / : * ? \" < > |';

  @override
  String get downloadPDF => 'Скачать PDF';

  @override
  String get viewPdf => 'Просмотреть PDF';

  @override
  String get about => 'О приложении';

  @override
  String get getFullLifetimeAccess =>
      'Получить полный пожизненный доступ за 1.99';

  @override
  String get viewPurchaseDetails => 'Просмотреть детали покупки';

  @override
  String get dataCollection => 'Сбор данных:';

  @override
  String get invalidFilename => 'Неверное имя файла';

  @override
  String get freeFeatureRenewal =>
      'БЕСПЛАТНЫЕ ФУНКЦИИ ОБНОВЛЯЮТСЯ КАЖДЫЕ 3 ДНЯ';

  @override
  String get upgradePrompt =>
      'ОБНОВИТЕ ПРИЛОЖЕНИЕ ОДНОРАЗОВОЙ ПОКУПКОЙ И РАСКРОЙТЕ ПОЛНЫЙ ПОТЕНЦИАЛ iSpeedPix2PDF 🚀.';

  @override
  String get ok => 'ОК';

  @override
  String get rateAppTitle => 'Оцените приложение';

  @override
  String get rateAppMessage =>
      'Если вам нравится наше приложение, пожалуйста, уделите минуту, чтобы оставить отзыв! Ваше мнение помогает нам стать лучше и займет не больше минуты.';

  @override
  String get rateButton => 'ОЦЕНИТЬ';

  @override
  String get noThanksButton => 'НЕТ, СПАСИБО';

  @override
  String get maybeLaterButton => 'МОЖЕТ БЫТЬ ПОЗЖЕ';

  @override
  String get processing => 'Обработка';

  @override
  String get pleaseWait => 'Пожалуйста, подождите';

  @override
  String get trialLimitReached => 'Лимит пробной версии достигнут';

  @override
  String get privacyPolicy => 'Политика конфиденциальности';

  @override
  String get creatingPdf => 'Создание PDF';

  @override
  String get loadingImagesInProgress => 'Загрузка изображений';

  @override
  String get subscriptionRequired => 'Требуется подписка';

  @override
  String get subscriptionMessageRequired =>
      'Пожалуйста, оформите подписку для продолжения использования всех функций';

  @override
  String get subscribeNowButton => 'Оформить подписку';

  @override
  String get restorePurchaseButton => 'Восстановить покупку';

  @override
  String get purchaseRestoredSuccessfully => 'Покупка успешно восстановлена';

  @override
  String get purchaseRestoreFailedError => 'Не удалось восстановить покупку';

  @override
  String get storagePermissionRequired => 'Требуется разрешение на хранилище';

  @override
  String get storagePermissionMessageRequired =>
      'Для сохранения PDF приложению нужно разрешение на доступ к хранилищу';

  @override
  String get grantPermissionButton => 'Разрешить доступ';

  @override
  String get openSettingsButton => 'Открыть настройки';

  @override
  String get permissionDeniedError => 'Доступ запрещен';

  @override
  String get errorWhileCreatingPdf => 'Ошибка при создании PDF';

  @override
  String get errorWhileSavingPdf => 'Ошибка при сохранении PDF';

  @override
  String get errorWhileLoadingImages => 'Ошибка при загрузке изображений';

  @override
  String get pdfCreatedSuccessfully => 'PDF успешно создан';

  @override
  String get pdfSavedSuccessfully => 'PDF успешно сохранён';

  @override
  String get tryAgainButton => 'Попробовать снова';

  @override
  String get continueButton => 'Продолжить';

  @override
  String get cancelButton => 'Отмена';

  @override
  String get closeButton => 'Закрыть';

  @override
  String get savingInProgress => 'Сохранение...';

  @override
  String get downloadingInProgress => 'Загрузка...';

  @override
  String get invalidFileTypeError => 'Неверный тип файла';

  @override
  String get maxFileSizeExceeded => 'Превышен максимальный размер файла';

  @override
  String get maxImagesLimitReached =>
      'Достигнуто максимальное количество изображений';

  @override
  String get trialLimitMessageReached =>
      'Вы достигли лимита пробной версии. Пожалуйста, оформите подписку для продолжения использования всех функций.';

  @override
  String freeVersionLimitReached(Object Count, Object count) {
    return 'В бесплатной версии ограничение — $count PDF';
  }

  @override
  String get imageQualityHighOption => 'Высокое качество (90%)';

  @override
  String get imageQualityMediumOption => 'Среднее качество (70%)';

  @override
  String get imageQualityLowOption => 'Низкое качество (50%)';

  @override
  String get orientationDefaultOption => 'Ориентация по умолчанию';

  @override
  String get orientationPortraitOption => 'Принудительно портретная';

  @override
  String get orientationLandscapeOption => 'Принудительно ландшафтная';

  @override
  String get orientationMixedOption => 'Смешанная ориентация';

  @override
  String get unsupportedFileFormatError => 'Неподдерживаемый формат файла';

  @override
  String get supportedFormatsMessage =>
      'Поддерживаемые форматы: JPG, PNG, HEIC';

  @override
  String get shareViaButton => 'Поделиться через';

  @override
  String get sharePdfButton => 'Поделиться PDF';

  @override
  String get enjoyingAppMessage => 'Вам нравится iSpeedPix2PDF?';

  @override
  String get rateAppStoreButton => 'Оценить в App Store';

  @override
  String get ratePlayStoreButton => 'Оценить в Play Store';

  @override
  String get sendFeedbackButton => 'Отправить отзыв';

  @override
  String get preparingImagesInProgress => 'Подготовка изображений...';

  @override
  String get optimizingImagesInProgress => 'Оптимизация изображений...';

  @override
  String get generatingPdfInProgress => 'Генерация PDF...';

  @override
  String get almostDoneMessage => 'Почти готово...';

  @override
  String get unlockFeatureButton => 'Открыть эту функцию';

  @override
  String get premiumFeatureMessage => 'Премиум-функция';

  @override
  String get upgradeToUnlockMessage =>
      'Обновите приложение, чтобы открыть все функции';

  @override
  String get weDoNotCollectAnyPersonalData =>
      ' Мы не собираем, не храним и не обрабатываем персональные данные пользователей. Все данные обрабатываются локально на вашем устройстве. Это означает, что';

  @override
  String get noImagesAreShared =>
      'Изображения не загружаются на сервер.\n- Личные данные не собираются, не хранятся и не передаются нашим мобильным приложением.';

  @override
  String get filesSelected => 'Выбрано файлов';

  @override
  String get rateThisApp => 'Оцените это приложение';

  @override
  String get rateThisAppMessage =>
      'Если вам нравится приложение, пожалуйста, уделите минуту, чтобы оставить отзыв! Ваш отзыв помогает нам улучшаться и займет не больше минуты.';

  @override
  String get rate => 'ОЦЕНИТЬ';

  @override
  String get noThanks => 'НЕТ, СПАСИБО';

  @override
  String get maybeLater => 'МОЖЕТ ПОЗЖЕ';

  @override
  String get permissionRequired => 'Требуется разрешение';

  @override
  String get freeTrialExpiredMessage =>
      'БЕСПЛАТНЫЙ ПРОБНЫЙ ПЕРИОД ЗАВЕРШЕН или БЕСПЛАТНЫЕ ФУНКЦИИ ИССЕЧЕНЫ';

  @override
  String get upgradeNowButton => 'Обновить сейчас';

  @override
  String get howToUse => 'Как использовать';

  @override
  String get simplicityAndEfficiency => 'Простота и эффективность';

  @override
  String get privacyAndSecurity => 'Конфиденциальность и безопасность';

  @override
  String get moreAppsByTevinEighDesigns =>
      'Другие приложения от Tevin Eigh Designs';

  @override
  String get aboutTevinEighDesigns => 'О Tevin Eigh Designs';

  @override
  String get returnToConverter => 'Вернуться к конвертеру';

  @override
  String get currentPlanFullAccess => 'Текущий план: полный доступ';

  @override
  String get currentPlanFreeTrial => 'Текущий план: бесплатный пробный период';

  @override
  String get freeTrialOneWeekUnlimitedUse =>
      'БЕСПЛАТНЫЙ ПРОБНЫЙ ПЕРИОД – 3 дня – неограниченное использование';

  @override
  String get freeVersionTrialAfterTrialExpires =>
      'БЕСПЛАТНАЯ ВЕРСИЯ – после окончания пробного периода';

  @override
  String get createUpToFivePDFsEverySevenDays =>
      '✔ Создавайте до 5 PDF каждые 3 дня\n';

  @override
  String get eachPDFCanHaveUpToThreePages =>
      '✔ Каждый PDF может содержать до 3 страниц\n';

  @override
  String get autoResetEverySevenDays =>
      '✔ Автоматический сброс каждые 3 дня\n\n';

  @override
  String get oneTimePurchaseUnlockFullAccess =>
      'Одноразовая покупка (открыть полный доступ)\n\n';

  @override
  String get adFreeAfterPurchase => '✔ Без рекламы после покупки\n';

  @override
  String get unlimitedPDFCreation => '✔ Неограниченное создание PDF\n';

  @override
  String get singlePurchaseLifetimeAccess =>
      '✔ Единовременная покупка с пожизненным доступом\n\n';

  @override
  String get upgradeTodayToUnlockCompletePotential =>
      'Обновитесь сегодня, чтобы раскрыть полный потенциал iSpeedPix2PDF с пожизненной подпиской 🚀';

  @override
  String get enjoyFullAccess => 'Наслаждайтесь полным доступом';

  @override
  String get checkingActivePurchase => 'Проверка активной покупки';

  @override
  String get alreadyPurchasedRestoreHere => 'Уже покупали? Восстановите здесь';

  @override
  String get buyNowInFourNineNine => 'Купить сейчас за 1.99';

  @override
  String get success => 'Успех';

  @override
  String get yourPurchaseHasBeenSuccessfullyRestored =>
      'Ваша покупка успешно восстановлена!';

  @override
  String get purchaseHistory => 'История покупок';

  @override
  String get noPurchasesFound => 'Покупок не найдено';

  @override
  String get weCouldNotFindAnyPreviousPurchasesToRestore =>
      'Не удалось найти предыдущие покупки для восстановления.';

  @override
  String get purchaseDate => 'Дата покупки';

  @override
  String get purchaseAmount => 'Сумма покупки';

  @override
  String get purchaseStatus => 'Статус покупки';

  @override
  String get purchaseId => 'ID покупки';

  @override
  String get purchaseDetails => 'Детали покупки';

  @override
  String get error => 'Ошибка';

  @override
  String get failedToRestorePurchasesPleaseTryAgainLater =>
      'Не удалось восстановить покупки. Попробуйте позже.';

  @override
  String get howToUseISpeedPix2PDFStepByStep =>
      'Как использовать iSpeedPix2PDF: пошагово';

  @override
  String get howToUsePointOne =>
      '1. Выберите фотографии\nНажмите кнопку «Выбрать файлы», чтобы открыть галерею.\n- Выберите фотографии для включения в PDF. Можно выбрать несколько одновременно.\n\n2. Добавьте имя файла (необязательно)\n- Можно указать имя PDF, нажав на поле «Имя файла».\n- Если имя не указано, будет автоматически назначено в формате iSpeedPix2PDF_ДАТА_ВРЕМЯ.\n\n3. Просмотрите или скачайте PDF\n- Скачайте файл для сохранения (файл оптимизирован для удобства обмена).\n- Просмотрите PDF прямо в приложении.\n\n4. Поделитесь PDF\n- После сохранения вы можете отправить PDF по электронной почте, через мессенджеры, загрузить в облако или любым удобным способом.\n- Сохраняя PDF, вы легко управляете, редактируете и делитесь документами, используя привычные инструменты, упрощая и ускоряя работу.\n\nВот и всё! Вы создали, просмотрели и поделились компактным и удобным PDF с iSpeedPix2PDF.';

  @override
  String get mainMenu => 'Главное меню';

  @override
  String get simplicityAndPrivacyDetail =>
      'Наша философия\n- Простота: наши приложения интуитивны и понятны для всех.\n\n- Безопасность: все данные обрабатываются на устройстве, что гарантирует конфиденциальность.\n- Эффективность: мы постоянно оптимизируем приложения, убирая лишние шаги без потери функционала.';

  @override
  String get simplicityAndPrivacyDetailTwo =>
      'Мы предоставляем ровно то, что нужно — ничего лишнего. По мере развития приложений мы сохраняем приверженность эффективности без ущерба основным задачам.';

  @override
  String get simplicityAndPrivacyDetailThree =>
      'Ознакомьтесь с нашими клиентскими приложениями и почувствуйте разницу, которую приносит простота, эффективность и безопасность в повседневных задачах.';

  @override
  String get privacyAndSecurityDetailTitle =>
      'Добро пожаловать в iSpeedPix2PDF. Мы заботимся о вашей конфиденциальности и безопасности персональных данных. В этой политике конфиденциальности описано, как мы собираем, используем и защищаем ваши данные при использовании приложения iSpeedPix2PDF на мобильных устройствах.';

  @override
  String get privacyAndSecurityDetailOne =>
      '1. Сбор и использование информации – iSpeedPix2PDF — это клиентское приложение, все данные обрабатываются локально и не передаются на внешние серверы.\n- Доступ к галерее: приложение запрашивает доступ к вашей галерее для выбора изображений для конвертации в PDF.\n- После создания PDF приложение не хранит файлы. Пользователь полностью контролирует созданные документы и может их сохранять, делиться или удалять.';

  @override
  String get privacyAndSecurityDetailTwo =>
      '2. Отсутствие передачи данных – iSpeedPix2PDF гарантирует, что никакие данные, включая персональную информацию или созданные PDF, не отправляются на внешние серверы или третьи сервисы. Все процессы выполняются на устройстве, обеспечивая максимальную конфиденциальность и безопасность.';

  @override
  String get privacyAndSecurityDetailThree =>
      '3. Одноразовая пожизненная подписка – iSpeedPix2PDF работает по модели одноразовой покупки с пожизненным доступом ко всем функциям без повторных платежей. Оплата обрабатывается через безопасный сервис для проверки и управления покупками.';

  @override
  String get privacyAndSecurityDetailFour =>
      '4. Отсутствие рекламы – мы не показываем рекламу и не продаём ваши данные. iSpeedPix2PDF обеспечивает плавный и эффективный опыт без отвлекающих факторов, фокусируясь на простой и безопасной работе с PDF.';

  @override
  String get view => 'Просмотр';

  @override
  String get aboutTevinEighDescription =>
      'Tevin Eigh Designs специализируется на создании клиентских приложений, решающих повседневные задачи с простотой, эффективностью и безопасностью. Мы концентрируемся на предоставлении основных функций с минимальным количеством шагов, чтобы вы могли сосредоточиться на главном.\n\nНаша философия\n- Простота: наши приложения интуитивны и понятны.\n- Безопасность: все данные обрабатываются на устройстве, что гарантирует конфиденциальность.\n- Эффективность: мы оптимизируем приложения, убирая лишние действия без потери функций.\n\nМы предоставляем ровно то, что нужно — ничего лишнего. По мере развития приложений мы сохраняем приверженность эффективности без ущерба основным задачам.\n\nОзнакомьтесь с нашим ассортиментом клиентских приложений и почувствуйте разницу, которую приносят простота, эффективность и безопасность в повседневной работе.\n\nwww.tevineigh.com\n';

  @override
  String get language => 'Язык';

  @override
  String get chooseLanguage => 'Выберите язык';

  @override
  String get aboutAppDescription =>
      'Быстро и легко конвертируйте изображения в PDF';

  @override
  String get settings => 'Настройки';

  @override
  String get selectLanguage => 'Выбор языка';

  @override
  String get save => 'Сохранить';

  @override
  String get privacyAndSecurityDetailFive =>
      '5. Политика конфиденциальности — Наши приложения используют Google Firebase исключительно для оптимизации в App Store (ASO) и поисковой оптимизации (SEO). Мы не собираем, не продаем и не используем эту информацию для других целей.\n\nДля получения дополнительной информации о политике конфиденциальности Google Firebase, пожалуйста, ознакомьтесь с их Политикой конфиденциальности:';

  @override
  String get monthlyUsageLimitReached =>
      'Достигнут месячный лимит использования';

  @override
  String get monthlyUsageLimitDescription =>
      'Вы использовали свои 3 бесплатные минуты использования в этом месяце. Время использования будет сброшено в начале следующего месяца.';

  @override
  String get unlockUnlimitedUsageWithSubscription =>
      'Разблокируйте неограниченное время использования с помощью однократной покупки пожизненной подписки.';

  @override
  String get laterButton => 'Позже';

  @override
  String remainingUsageTime(int minutes, int seconds) {
    return 'Оставшееся время использования: $minutes мин $seconds сек';
  }

  @override
  String get threeMinutesUsagePerMonth => '✔ 3 минуты использования в месяц\n';

  @override
  String get usageTimeResetMonthly =>
      '✔ Время использования сбрасывается ежемесячно\n\n';

  @override
  String get trialTimeLeft => 'Осталось пробного времени';

  @override
  String remainingTime(int minutes, String seconds) {
    return 'осталось $minutes:$seconds';
  }

  @override
  String get unlockUnlimitedAccessToday =>
      'Разблокируйте неограниченный доступ сегодня!';

  @override
  String get enjoyingFreeTrialUpgradeMessage =>
      'Вы наслаждаетесь бесплатной пробной версией! Зачем ждать? Обновитесь сейчас до нашего пожизненного плана и больше никогда не беспокойтесь о временных ограничениях. Один платеж, неограниченное использование навсегда — без подписок, без повторяющихся платежей!';

  @override
  String get usagePausedThirtyDays => 'Использование приостановлено (30 дней)';

  @override
  String get freeTimeExpired => 'Бесплатное время истекло';

  @override
  String get almostOutOfFreeTime => 'Почти закончилось бесплатное время';

  @override
  String usagePausedMessage(int days) {
    return 'Ваше бесплатное время приостановлено еще на $days дней. Обновитесь до нашего пожизненного плана, чтобы получить неограниченное использование немедленно — без повторяющихся платежей, без подписок.';
  }

  @override
  String get freeTimeExpiredMessage =>
      'Ваше бесплатное время истекло! Обновитесь до нашего пожизненного плана с единовременным платежом — без повторяющихся платежей, без подписок. Получите неограниченное использование навсегда.';

  @override
  String get almostOutOfFreeTimeMessage =>
      'У вас почти закончилось бесплатное время в этом месяце! Обновитесь до нашего пожизненного плана с единовременным платежом — без повторяющихся платежей, без подписок. Получите неограниченное использование навсегда.';

  @override
  String get subscribeNow => 'Подписаться сейчас';

  @override
  String get likingTheApp => 'Нравится приложение?';

  @override
  String get likingTheAppMessage =>
      'Нравится приложение? Получите пожизненный доступ сегодня с единовременным платежом — без повторяющихся платежей, без подписок. Разблокируйте неограниченное использование навсегда!';

  @override
  String get maybeLatr => 'Может быть позже';

  @override
  String get getLifetimeAccess => 'Получить пожизненный доступ';

  @override
  String get stillEnjoyingIt => 'Все еще нравится?';

  @override
  String get stillEnjoyingItMessage =>
      'Все еще нравится? Обновитесь сейчас и сохраните доступ навсегда с нашим пожизненным планом — один платеж, без подписок, неограниченное использование на всю жизнь!';

  @override
  String get notNow => 'Не сейчас';

  @override
  String get upgradeForever => 'Обновить навсегда';

  @override
  String get almostOutOfFreeTimeTitle => 'Почти закончилось бесплатное время';

  @override
  String get almostOutOfFreeTimeWarningMessage =>
      'У вас почти закончилось бесплатное время в этом месяце! Обновитесь до нашего пожизненного плана с единовременным платежом — без повторяющихся платежей, без подписок. Получите неограниченное использование навсегда.';

  @override
  String get later => 'Позже';

  @override
  String get upgradeNow => 'Обновить сейчас';

  @override
  String get creatingPdfMessage => 'Создание PDF...';

  @override
  String get day => 'день';

  @override
  String get days => 'дней';

  @override
  String get left => 'осталось';

  @override
  String get sessionTime => 'время сеанса';

  @override
  String get usePromoCode => 'Использовать промо-код';

  @override
  String get enterPromoCode => 'Введите промо-код';

  @override
  String get apply => 'Применить';

  @override
  String get invalidPromoCode => 'Недействительный промо-код';

  @override
  String get promoCodeAppliedSuccessfully => 'Промо-код успешно применен!';

  @override
  String get promoCode => 'Промо-код';
}
