// ignore: unused_import
import 'package:intl/intl.dart' as intl;
import 'app_localizations.dart';

// ignore_for_file: type=lint

/// The translations for Thai (`th`).
class AppLocalizationsTh extends AppLocalizations {
  AppLocalizationsTh([String locale = 'th']) : super(locale);

  @override
  String get rest => 'Reset';

  @override
  String get appTitle => 'iSpeedPix2PDF';

  @override
  String get defaultMixedOrientation => 'ค่าเริ่มต้น - การวางแนวผสม';

  @override
  String get pagesFixedPortrait => 'หน้าคงที่ - แนวตั้ง';

  @override
  String get landscapePhotosTopAlignedForEasyViewing =>
      'รูปภาพแนวนอน - จัดชิดด้านบนเพื่อความสะดวกในการดู';

  @override
  String get reset => 'รีเซ็ต';

  @override
  String get chooseFiles => 'เลือกไฟล์';

  @override
  String get noFilesSelected => 'ยังไม่ได้เลือกไฟล์';

  @override
  String get youCanSelectUpTo3ImagesInFreeVersion =>
      '*คุณสามารถเลือกได้สูงสุด 3 รูปในเวอร์ชันฟรี';

  @override
  String get youCanSelectUpTo60Images => '*คุณสามารถเลือกได้สูงสุด 60 รูป';

  @override
  String get filename => 'ชื่อไฟล์';

  @override
  String get filenameOptional => 'ชื่อไฟล์ (ไม่บังคับ)';

  @override
  String get enterCustomFileNameOptional => 'ใส่ชื่อไฟล์เอง (ไม่บังคับ)';

  @override
  String get filenameCannotContainCharacters =>
      'ชื่อไฟล์ไม่สามารถมีอักขระต่อไปนี้ได้: \\ /: * ? \" < > |';

  @override
  String get downloadPDF => 'ดาวน์โหลด PDF';

  @override
  String get viewPdf => 'ดู PDF';

  @override
  String get about => 'เกี่ยวกับ';

  @override
  String get getFullLifetimeAccess => 'รับสิทธิ์ใช้งานตลอดชีพในราคา 1.99';

  @override
  String get viewPurchaseDetails => 'ดูรายละเอียดการซื้อ';

  @override
  String get dataCollection => 'การเก็บข้อมูล:';

  @override
  String get invalidFilename => 'ชื่อไฟล์ไม่ถูกต้อง';

  @override
  String get freeFeatureRenewal => 'ฟีเจอร์ฟรีจะรีเซ็ตทุก 3 วัน';

  @override
  String get upgradePrompt =>
      'อัปเกรดตอนนี้ด้วยการซื้อครั้งเดียวและปลดล็อกพลังเต็มของ iSpeedPix2PDF 🚀';

  @override
  String get ok => 'ตกลง';

  @override
  String get rateAppTitle => 'ให้คะแนนแอปนี้';

  @override
  String get rateAppMessage =>
      'ถ้าคุณชอบใช้แอปนี้ เราขอความกรุณาให้คุณสละเวลาสักครู่เพื่อเขียนรีวิว! ความคิดเห็นของคุณช่วยให้เราปรับปรุงและจะใช้เวลาไม่เกินหนึ่งนาที';

  @override
  String get rateButton => 'ให้คะแนน';

  @override
  String get noThanksButton => 'ไม่ขอ';

  @override
  String get maybeLaterButton => 'อาจจะทีหลัง';

  @override
  String get processing => 'กำลังดำเนินการ';

  @override
  String get pleaseWait => 'กรุณารอสักครู่';

  @override
  String get trialLimitReached => 'ถึงขีดจำกัดทดลองใช้แล้ว';

  @override
  String get privacyPolicy => 'นโยบายความเป็นส่วนตัว';

  @override
  String get creatingPdf => 'กำลังสร้าง PDF';

  @override
  String get loadingImagesInProgress => 'กำลังโหลดรูปภาพ';

  @override
  String get subscriptionRequired => 'ต้องสมัครสมาชิก';

  @override
  String get subscriptionMessageRequired =>
      'กรุณาสมัครสมาชิกเพื่อใช้ฟีเจอร์ทั้งหมดต่อไป';

  @override
  String get subscribeNowButton => 'สมัครสมาชิกตอนนี้';

  @override
  String get restorePurchaseButton => 'คืนค่าการซื้อ';

  @override
  String get purchaseRestoredSuccessfully => 'คืนค่าการซื้อสำเร็จแล้ว';

  @override
  String get purchaseRestoreFailedError => 'คืนค่าการซื้อไม่สำเร็จ';

  @override
  String get storagePermissionRequired => 'ต้องได้รับอนุญาตจัดเก็บข้อมูล';

  @override
  String get storagePermissionMessageRequired =>
      'แอปนี้ต้องการอนุญาตจัดเก็บข้อมูลเพื่อบันทึกไฟล์ PDF';

  @override
  String get grantPermissionButton => 'อนุญาต';

  @override
  String get openSettingsButton => 'เปิดการตั้งค่า';

  @override
  String get permissionDeniedError => 'ปฏิเสธการอนุญาต';

  @override
  String get errorWhileCreatingPdf => 'เกิดข้อผิดพลาดขณะสร้าง PDF';

  @override
  String get errorWhileSavingPdf => 'เกิดข้อผิดพลาดขณะบันทึก PDF';

  @override
  String get errorWhileLoadingImages => 'เกิดข้อผิดพลาดขณะโหลดรูปภาพ';

  @override
  String get pdfCreatedSuccessfully => 'สร้าง PDF สำเร็จ';

  @override
  String get pdfSavedSuccessfully => 'บันทึก PDF สำเร็จ';

  @override
  String get tryAgainButton => 'ลองใหม่';

  @override
  String get continueButton => 'ดำเนินการต่อ';

  @override
  String get cancelButton => 'ยกเลิก';

  @override
  String get closeButton => 'ปิด';

  @override
  String get savingInProgress => 'กำลังบันทึก...';

  @override
  String get downloadingInProgress => 'กำลังดาวน์โหลด...';

  @override
  String get invalidFileTypeError => 'ชนิดไฟล์ไม่ถูกต้อง';

  @override
  String get maxFileSizeExceeded => 'ขนาดไฟล์เกินขีดจำกัด';

  @override
  String get maxImagesLimitReached => 'ถึงขีดจำกัดจำนวนรูปภาพสูงสุดแล้ว';

  @override
  String get trialLimitMessageReached =>
      'คุณถึงขีดจำกัดทดลองใช้แล้ว กรุณาสมัครสมาชิกเพื่อใช้ฟีเจอร์ทั้งหมดต่อไป';

  @override
  String freeVersionLimitReached(Object Count, Object count) {
    return 'เวอร์ชันฟรีจำกัดไว้ที่ $count ไฟล์ PDF';
  }

  @override
  String get imageQualityHighOption => 'คุณภาพสูง (90%)';

  @override
  String get imageQualityMediumOption => 'คุณภาพปานกลาง (70%)';

  @override
  String get imageQualityLowOption => 'คุณภาพต่ำ (50%)';

  @override
  String get orientationDefaultOption => 'การวางแนวเริ่มต้น';

  @override
  String get orientationPortraitOption => 'บังคับแนวตั้ง';

  @override
  String get orientationLandscapeOption => 'บังคับแนวนอน';

  @override
  String get orientationMixedOption => 'การวางแนวผสม';

  @override
  String get unsupportedFileFormatError => 'ฟอร์แมตไฟล์ไม่รองรับ';

  @override
  String get supportedFormatsMessage => 'ฟอร์แมตรองรับ: JPG, PNG, HEIC';

  @override
  String get shareViaButton => 'แชร์ผ่าน';

  @override
  String get sharePdfButton => 'แชร์ PDF';

  @override
  String get enjoyingAppMessage => 'คุณชอบ iSpeedPix2PDF ไหม?';

  @override
  String get rateAppStoreButton => 'ให้คะแนนใน App Store';

  @override
  String get ratePlayStoreButton => 'ให้คะแนนใน Play Store';

  @override
  String get sendFeedbackButton => 'ส่งคำติชม';

  @override
  String get preparingImagesInProgress => 'กำลังเตรียมรูปภาพ...';

  @override
  String get optimizingImagesInProgress => 'กำลังปรับแต่งรูปภาพ...';

  @override
  String get generatingPdfInProgress => 'กำลังสร้าง PDF...';

  @override
  String get almostDoneMessage => 'เกือบเสร็จแล้ว...';

  @override
  String get unlockFeatureButton => 'ปลดล็อกฟีเจอร์นี้';

  @override
  String get premiumFeatureMessage => 'ฟีเจอร์พรีเมียม';

  @override
  String get upgradeToUnlockMessage => 'อัปเกรดเพื่อปลดล็อกฟีเจอร์ทั้งหมด';

  @override
  String get weDoNotCollectAnyPersonalData =>
      'เราไม่เก็บรวบรวม จัดเก็บ หรือประมวลผลข้อมูลส่วนตัวใด ๆ ของผู้ใช้ ข้อมูลทั้งหมดถูกจัดการบนอุปกรณ์ของคุณเท่านั้น หมายความว่า';

  @override
  String get noImagesAreShared =>
      'ไม่มีการอัปโหลดรูปภาพไปยังเซิร์ฟเวอร์\n- ไม่มีการเก็บรวบรวม จัดเก็บ หรือแบ่งปันข้อมูลส่วนตัวโดยแอปของเรา';

  @override
  String get filesSelected => 'ไฟล์ที่เลือก';

  @override
  String get rateThisApp => 'ให้คะแนนแอปนี้';

  @override
  String get rateThisAppMessage =>
      'ถ้าคุณชอบใช้แอปนี้ กรุณาสละเวลาสักครู่เพื่อเขียนรีวิว! ความคิดเห็นของคุณช่วยให้เราปรับปรุงและจะใช้เวลาไม่เกินหนึ่งนาที';

  @override
  String get rate => 'ให้คะแนน';

  @override
  String get noThanks => 'ไม่ขอ';

  @override
  String get maybeLater => 'อาจจะทีหลัง';

  @override
  String get permissionRequired => 'ต้องได้รับอนุญาต';

  @override
  String get freeTrialExpiredMessage =>
      'หมดช่วงทดลองใช้ฟรี หรือใช้ฟีเจอร์ฟรีหมดแล้ว';

  @override
  String get upgradeNowButton => 'อัปเกรดตอนนี้';

  @override
  String get howToUse => 'วิธีใช้งาน';

  @override
  String get simplicityAndEfficiency => 'ความเรียบง่ายและประสิทธิภาพ';

  @override
  String get privacyAndSecurity => 'ความเป็นส่วนตัวและความปลอดภัย';

  @override
  String get moreAppsByTevinEighDesigns => 'แอปเพิ่มเติมโดย Tevin Eigh Designs';

  @override
  String get aboutTevinEighDesigns => 'เกี่ยวกับ Tevin Eigh Designs';

  @override
  String get returnToConverter => 'กลับไปที่ตัวแปลง';

  @override
  String get currentPlanFullAccess => 'แผนปัจจุบัน: เข้าถึงเต็มรูปแบบ';

  @override
  String get currentPlanFreeTrial => 'แผนปัจจุบัน: ทดลองใช้ฟรี';

  @override
  String get freeTrialOneWeekUnlimitedUse =>
      'ทดลองใช้ฟรี – 3 วัน – ใช้ไม่จำกัด';

  @override
  String get freeVersionTrialAfterTrialExpires =>
      'เวอร์ชันฟรี – หลังหมดช่วงทดลองใช้';

  @override
  String get createUpToFivePDFsEverySevenDays =>
      '✔ สร้าง PDF ได้สูงสุด 5 ไฟล์ทุก 3 วัน\n';

  @override
  String get eachPDFCanHaveUpToThreePages =>
      '✔ PDF แต่ละไฟล์มีได้สูงสุด 3 หน้า\n';

  @override
  String get autoResetEverySevenDays => '✔ รีเซ็ตอัตโนมัติทุก 3 วัน\n\n';

  @override
  String get oneTimePurchaseUnlockFullAccess =>
      'ซื้อครั้งเดียวเพื่อปลดล็อกการใช้งานเต็มรูปแบบ\n\n';

  @override
  String get adFreeAfterPurchase => '✔ ไม่มีโฆษณาหลังจากซื้อ\n';

  @override
  String get unlimitedPDFCreation => '✔ สร้าง PDF ได้ไม่จำกัด\n';

  @override
  String get singlePurchaseLifetimeAccess =>
      '✔ ซื้อครั้งเดียว ใช้งานได้ตลอดชีพ\n\n';

  @override
  String get upgradeTodayToUnlockCompletePotential =>
      'อัปเกรดวันนี้เพื่อปลดล็อกศักยภาพเต็มของ iSpeedPix2PDF ด้วยการสมัครสมาชิกตลอดชีพ 🚀';

  @override
  String get enjoyFullAccess => 'เพลิดเพลินกับการเข้าถึงเต็มรูปแบบ';

  @override
  String get checkingActivePurchase => 'กำลังตรวจสอบการซื้อที่ใช้งานอยู่';

  @override
  String get alreadyPurchasedRestoreHere => 'ซื้อแล้ว? คืนค่าที่นี่';

  @override
  String get buyNowInFourNineNine => 'ซื้อเลยในราคา 1.99';

  @override
  String get success => 'สำเร็จ';

  @override
  String get yourPurchaseHasBeenSuccessfullyRestored =>
      'การซื้อของคุณถูกคืนค่าเรียบร้อยแล้ว!';

  @override
  String get purchaseHistory => 'ประวัติการซื้อ';

  @override
  String get noPurchasesFound => 'ไม่พบการซื้อ';

  @override
  String get weCouldNotFindAnyPreviousPurchasesToRestore =>
      'เราไม่พบการซื้อก่อนหน้านี้ที่สามารถคืนค่าได้';

  @override
  String get purchaseDate => 'วันที่ซื้อ';

  @override
  String get purchaseAmount => 'จำนวนเงินที่ซื้อ';

  @override
  String get purchaseStatus => 'สถานะการซื้อ';

  @override
  String get purchaseId => 'รหัสการซื้อ';

  @override
  String get purchaseDetails => 'รายละเอียดการซื้อ';

  @override
  String get error => 'ข้อผิดพลาด';

  @override
  String get failedToRestorePurchasesPleaseTryAgainLater =>
      'คืนค่าการซื้อไม่สำเร็จ กรุณาลองใหม่อีกครั้งในภายหลัง';

  @override
  String get howToUseISpeedPix2PDFStepByStep =>
      'วิธีใช้ iSpeedPix2PDF ทีละขั้นตอน';

  @override
  String get howToUsePointOne =>
      '1. เลือกรูปภาพ\nแตะปุ่ม \'เลือกไฟล์\' เพื่อเปิดแกลเลอรีรูปภาพ\n- เลือกรูปภาพที่ต้องการรวมใน PDF\n- สามารถเลือกหลายรูปได้พร้อมกัน\n\n2. เพิ่มชื่อไฟล์ (ไม่บังคับ)\n- คุณสามารถตั้งชื่อไฟล์ PDF เองได้โดยแตะช่อง \'ชื่อไฟล์\'\n- หากไม่ระบุชื่อ ระบบจะตั้งชื่อไฟล์อัตโนมัติในรูปแบบ iSpeedPix2PDF_DATE_TIME\n\n3. ดูหรือดาวน์โหลด PDF\n- ดาวน์โหลดเพื่อบันทึกไฟล์ (ไฟล์ถูกออกแบบให้ขนาดเล็กเพื่อการแชร์และจัดการที่ง่าย)\n- ดูไฟล์ในแอปได้เลยเพื่อความรวดเร็ว\n\n4. แชร์ PDF\n- หลังบันทึก สามารถแชร์ PDF ผ่านอีเมล แอปส่งข้อความ หรืออัปโหลดไปยังคลาวด์ได้\n- ด้วยไฟล์ PDF ที่บันทึกไว้ คุณสามารถจัดการ แก้ไข และแชร์ไฟล์ได้อย่างง่ายดาย ด้วยเครื่องมือที่คุณคุ้นเคย ช่วยให้งานของคุณรวดเร็วและมีประสิทธิภาพมากขึ้น\n\nแค่นี้เอง! คุณได้สร้าง ดู และแชร์ PDF ขนาดกะทัดรัดที่จัดการง่ายด้วย iSpeedPix2PDF';

  @override
  String get mainMenu => 'เมนูหลัก';

  @override
  String get simplicityAndPrivacyDetail =>
      'ปรัชญาของเรา\n- ความเรียบง่าย: แอปของเราออกแบบให้ใช้งานง่ายและเข้าใจง่ายสำหรับทุกคน\n\n- ความปลอดภัย: ด้วยการประมวลผลทั้งหมดบนอุปกรณ์ของผู้ใช้ เรารักษาความเป็นส่วนตัวและความปลอดภัยของข้อมูล\n- ประสิทธิภาพ: เราพัฒนาแอปอย่างต่อเนื่องเพื่อลดขั้นตอนที่ไม่จำเป็นในขณะที่ยังคงฟังก์ชันหลักไว้';

  @override
  String get simplicityAndPrivacyDetailTwo =>
      'เราเชื่อในการให้สิ่งที่คุณต้องการเท่านั้น ไม่มากเกินไปและไม่น้อยเกินไป ในการพัฒนา เรามุ่งเน้นที่การเพิ่มประสิทธิภาพโดยไม่ลดทอนวัตถุประสงค์หลักของแอป';

  @override
  String get simplicityAndPrivacyDetailThree =>
      'ลองใช้แอปบนอุปกรณ์ของเราหลากหลายและสัมผัสความแตกต่างของความเรียบง่าย ประสิทธิภาพ และความปลอดภัยในงานประจำวันของคุณ';

  @override
  String get privacyAndSecurityDetailTitle =>
      'ยินดีต้อนรับสู่ iSpeedPix2PDF เรามุ่งมั่นในการปกป้องความเป็นส่วนตัวและความปลอดภัยของข้อมูลส่วนบุคคลของคุณ นโยบายความเป็นส่วนตัวนี้อธิบายถึงวิธีที่เรารวบรวม ใช้ และปกป้องข้อมูลของคุณเมื่อใช้แอป iSpeedPix2PDF บนอุปกรณ์เคลื่อนที่';

  @override
  String get privacyAndSecurityDetailOne =>
      '1. การเก็บรวบรวมและการใช้ข้อมูล - iSpeedPix2PDF เป็นแอปที่ประมวลผลข้อมูลบนอุปกรณ์ของผู้ใช้เท่านั้น ไม่มีข้อมูลถูกส่งไปยังเซิร์ฟเวอร์ภายนอก\n- การเข้าถึงแกลเลอรีรูปภาพ: แอปต้องการเข้าถึงแกลเลอรีเพื่อให้คุณเลือกภาพสำหรับแปลงเป็น PDF\n- หลังจากสร้าง PDF แล้ว แอปจะไม่เก็บไฟล์ไว้ ผู้ใช้สามารถจัดการ แชร์ หรือบันทึกไฟล์ตามต้องการ';

  @override
  String get privacyAndSecurityDetailTwo =>
      '2. ไม่มีการส่งข้อมูล - เนื่องจากเป็นแอปที่ประมวลผลข้อมูลทั้งหมดบนอุปกรณ์ ไม่มีข้อมูลส่วนบุคคลหรือ PDF ที่สร้างขึ้นถูกส่งไปยังเซิร์ฟเวอร์หรือบริการของบุคคลที่สาม ทุกขั้นตอนเกิดขึ้นบนอุปกรณ์ของคุณ เพื่อความเป็นส่วนตัวและความปลอดภัยสูงสุด';

  @override
  String get privacyAndSecurityDetailThree =>
      '3. การสมัครสมาชิกแบบซื้อครั้งเดียว - iSpeedPix2PDF ใช้ระบบสมัครสมาชิกแบบซื้อครั้งเดียวเพื่อปลดล็อกฟีเจอร์ทั้งหมด ไม่มีค่าบริการรายเดือนหรือค่าธรรมเนียมซ่อนเร้น การชำระเงินจัดการอย่างปลอดภัยและแอปจะใช้งานได้เต็มที่หลังการซื้อ';

  @override
  String get privacyAndSecurityDetailFour =>
      '4. ไม่มีโฆษณา - เราไม่แสดงโฆษณาหรือขายข้อมูลของคุณ iSpeedPix2PDF ออกแบบมาเพื่อประสบการณ์ใช้งานที่ราบรื่นและมีประสิทธิภาพโดยไม่มีการรบกวนจากโฆษณา เรามุ่งเน้นให้คุณสร้างและแชร์ PDF ได้อย่างง่ายดายและปลอดภัย';

  @override
  String get view => 'ดู';

  @override
  String get aboutTevinEighDescription =>
      'ที่ Tevin Eigh Designs เราเชี่ยวชาญในการสร้างแอปที่ประมวลผลบนอุปกรณ์ของผู้ใช้เพื่อแก้ปัญหาในชีวิตประจำวันด้วยความเรียบง่าย ประสิทธิภาพ และความปลอดภัย เรามุ่งเน้นให้ฟังก์ชันหลักใช้งานง่ายที่สุดเท่าที่จะเป็นไปได้ เพื่อให้คุณสามารถมุ่งเน้นกับงานหลักของคุณโดยไม่ถูกรบกวน\n\nปรัชญาของเรา\n- ความเรียบง่าย: แอปของเราออกแบบให้ใช้งานง่ายและเข้าใจง่ายสำหรับทุกคน\n- ความปลอดภัย: ด้วยการประมวลผลทั้งหมดบนอุปกรณ์ของผู้ใช้ เรารักษาความเป็นส่วนตัวและความปลอดภัยของข้อมูล\n- ประสิทธิภาพ: เราพัฒนาแอปอย่างต่อเนื่องเพื่อลดขั้นตอนที่ไม่จำเป็นในขณะที่ยังคงฟังก์ชันหลักไว้\n\nเราเชื่อในการให้สิ่งที่คุณต้องการเท่านั้น ไม่มากเกินไปและไม่น้อยเกินไป ในการพัฒนา เรามุ่งเน้นที่การเพิ่มประสิทธิภาพโดยไม่ลดทอนวัตถุประสงค์หลักของแอป\n\nลองใช้แอปของเราและสัมผัสความแตกต่างของความเรียบง่าย ประสิทธิภาพ และความปลอดภัยในงานประจำวันของคุณ\n\nwww.tevineigh.com\n';

  @override
  String get language => 'ภาษา';

  @override
  String get chooseLanguage => 'เลือกภาษา';

  @override
  String get aboutAppDescription => 'แปลงรูปภาพเป็น PDF อย่างรวดเร็วและง่ายดาย';

  @override
  String get settings => 'การตั้งค่า';

  @override
  String get selectLanguage => 'เลือกภาษา';

  @override
  String get save => 'บันทึก';

  @override
  String get privacyAndSecurityDetailFive =>
      '5. นโยบายความเป็นส่วนตัว - แอปของเราใช้ Google Firebase สำหรับการเพิ่มประสิทธิภาพบน App Store (ASO) และการเพิ่มประสิทธิภาพบนเครื่องมือค้นหา (SEO) เท่านั้น เราจะไม่รวบรวม ขาย หรือใช้ข้อมูลนี้เพื่อวัตถุประสงค์อื่นใด\n\nหากต้องการข้อมูลเพิ่มเติมเกี่ยวกับแนวทางการจัดการข้อมูลของ Google Firebase กรุณาอ้างอิงนโยบายความเป็นส่วนตัวของพวกเขา:';

  @override
  String get monthlyUsageLimitReached => 'ถึงขีดจำกัดการใช้งานรายเดือนแล้ว';

  @override
  String get monthlyUsageLimitDescription =>
      'คุณใช้เวลาใช้งานฟรี 3 นาทีสำหรับเดือนนี้หมดแล้ว เวลาใช้งานจะรีเซ็ตใหม่เมื่อเริ่มต้นเดือนถัดไป';

  @override
  String get unlockUnlimitedUsageWithSubscription =>
      'ปลดล็อกเวลาใช้งานไม่จำกัดด้วยการซื้อแบบชำระครั้งเดียวสำหรับการสมัครสมาชิกตลอดชีพ';

  @override
  String get laterButton => 'ภายหลัง';

  @override
  String remainingUsageTime(int minutes, int seconds) {
    return 'เวลาใช้งานที่เหลือ: $minutes นาที $seconds วินาที';
  }

  @override
  String get threeMinutesUsagePerMonth => '✔ เวลาใช้งาน 3 นาทีต่อเดือน\n';

  @override
  String get usageTimeResetMonthly => '✔ เวลาใช้งานจะถูกรีเซ็ตทุกเดือน\n\n';

  @override
  String get trialTimeLeft => 'เวลาทดลองที่เหลือ';

  @override
  String remainingTime(int minutes, String seconds) {
    return 'เหลือ $minutes:$seconds';
  }

  @override
  String get unlockUnlimitedAccessToday => 'ปลดล็อกการเข้าถึงไม่จำกัดวันนี้!';

  @override
  String get enjoyingFreeTrialUpgradeMessage =>
      'คุณกำลังเพลิดเพลินกับการทดลองใช้ฟรี! ทำไมต้องรอ? อัปเกรดเป็นแผนตลอดชีวิตของเราตอนนี้และไม่ต้องกังวลเรื่องข้อจำกัดเวลาอีกต่อไป การชำระเงินครั้งเดียว ใช้งานไม่จำกัดตลอดไป — ไม่มีการสมัครสมาชิก ไม่มีค่าธรรมเนียมซ้ำ!';

  @override
  String get usagePausedThirtyDays => 'การใช้งานหยุดชั่วคราว (30 วัน)';

  @override
  String get freeTimeExpired => 'เวลาฟรีหมดแล้ว';

  @override
  String get almostOutOfFreeTime => 'เวลาฟรีเกือบหมดแล้ว';

  @override
  String usagePausedMessage(int days) {
    return 'เวลาฟรีของคุณหยุดชั่วคราวอีก $days วัน อัปเกรดเป็นแผนตลอดชีวิตของเราเพื่อรับการใช้งานไม่จำกัดทันที — ไม่มีค่าธรรมเนียมซ้ำ ไม่มีการสมัครสมาชิก';
  }

  @override
  String get freeTimeExpiredMessage =>
      'เวลาฟรีของคุณหมดแล้ว! อัปเกรดเป็นแผนตลอดชีวิตของเราด้วยการชำระเงินครั้งเดียว — ไม่มีค่าธรรมเนียมซ้ำ ไม่มีการสมัครสมาชิก รับการใช้งานไม่จำกัดตลอดไป';

  @override
  String get almostOutOfFreeTimeMessage =>
      'คุณเกือบหมดเวลาฟรีสำหรับเดือนนี้แล้ว! อัปเกรดเป็นแผนตลอดชีวิตของเราด้วยการชำระเงินครั้งเดียว — ไม่มีค่าธรรมเนียมซ้ำ ไม่มีการสมัครสมาชิก รับการใช้งานไม่จำกัดตลอดไป';

  @override
  String get subscribeNow => 'สมัครสมาชิกตอนนี้';

  @override
  String get likingTheApp => 'ชอบแอปนี้ไหม?';

  @override
  String get likingTheAppMessage =>
      'ชอบแอปนี้ไหม? รับการเข้าถึงตลอดชีวิตวันนี้ด้วยการชำระเงินครั้งเดียว — ไม่มีค่าธรรมเนียมซ้ำ ไม่มีการสมัครสมาชิก ปลดล็อกการใช้งานไม่จำกัดตลอดไป!';

  @override
  String get maybeLatr => 'อาจจะทีหลัง';

  @override
  String get getLifetimeAccess => 'รับการเข้าถึงตลอดชีวิต';

  @override
  String get stillEnjoyingIt => 'ยังชอบอยู่ไหม?';

  @override
  String get stillEnjoyingItMessage =>
      'ยังชอบอยู่ไหม? อัปเกรดตอนนี้และรักษาการเข้าถึงตลอดไปด้วยแผนตลอดชีวิตของเรา — การชำระเงินครั้งเดียว ไม่มีการสมัครสมาชิก ใช้งานไม่จำกัดตลอดชีวิต!';

  @override
  String get notNow => 'ไม่ใช่ตอนนี้';

  @override
  String get upgradeForever => 'อัปเกรดตลอดไป';

  @override
  String get almostOutOfFreeTimeTitle => 'เวลาฟรีเกือบหมดแล้ว';

  @override
  String get almostOutOfFreeTimeWarningMessage =>
      'คุณเกือบหมดเวลาฟรีสำหรับเดือนนี้แล้ว! อัปเกรดเป็นแผนตลอดชีวิตของเราด้วยการชำระเงินครั้งเดียว — ไม่มีค่าธรรมเนียมซ้ำ ไม่มีการสมัครสมาชิก รับการใช้งานไม่จำกัดตลอดไป';

  @override
  String get later => 'ทีหลัง';

  @override
  String get upgradeNow => 'อัปเกรดตอนนี้';

  @override
  String get creatingPdfMessage => 'กำลังสร้าง PDF...';

  @override
  String get day => 'วัน';

  @override
  String get days => 'วัน';

  @override
  String get left => 'เหลือ';

  @override
  String get sessionTime => 'เวลาเซสชัน';

  @override
  String get usePromoCode => 'ใช้รหัสโปรโมชั่น';

  @override
  String get enterPromoCode => 'ป้อนรหัสโปรโมชั่น';

  @override
  String get apply => 'ใช้';

  @override
  String get invalidPromoCode => 'รหัสโปรโมชั่นไม่ถูกต้อง';

  @override
  String get promoCodeAppliedSuccessfully => 'ใช้รหัสโปรโมชั่นสำเร็จ!';

  @override
  String get promoCode => 'รหัสโปรโมชั่น';
}
