Repository: WaseemMirzaa/ispeedpix2pdf7
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, he, hi, it, ja, ko, pt, ru, th, zh

# trialLimitMessageReached
source: You have reached the trial limit. Please subscribe to continue using all features.
ar: لقد وصلت إلى حد التجربة.
de: Sie haben die Versuchsgrenze erreicht.
es: Has alcanzado el límite de prueba.
fr: Vous avez atteint la limite d'essai.
he: הגעת למגבלת הניסיון. אנא הירשם כדי להמשיך להשתמש בכל הפונקציות.
hi: आपने ट्रायल सीमा पार कर ली है। कृपया सभी सुविधाओं का उपयोग जारी रखने के लिए सदस्यता लें।
it: Hai raggiunto il limite di prova.
ja: 試用制限に達しました。すべての機能を使うには購読してください。
ko: 체험 한도에 도달했습니다. 모든 기능을 계속 사용하려면 구독해 주세요.
pt: Você atingiu o limite do teste. Por favor, assine para continuar usando todos os recursos.
ru: Вы достигли лимита пробной версии. Пожалуйста, оформите подписку для продолжения использования всех функций.
th: คุณถึงขีดจำกัดทดลองใช้แล้ว กรุณาสมัครสมาชิกเพื่อใช้ฟีเจอร์ทั้งหมดต่อไป
zh: 您已达到试用限制。请订阅以继续使用全部功能。

# freeVersionLimitReached
source: Free version is limited to {count} PDFs
ar: يقتصر الإصدار المجاني على {count} pdfs
de: Die kostenlose Version ist auf {count} pdfs beschränkt
es: La versión gratuita se limita a {Count} PDFS
fr: La version gratuite est limitée à {count} pdfs
he: הגרסה החינמית מוגבלת ל-{count} קובצי PDF
hi: फ्री संस्करण में {count} PDFs तक सीमित है
it: La versione gratuita è limitata a {Count} PDFS
ja: 無料版は{count}件のPDFまで利用可能です
ko: 무료 버전은 {count}개의 PDF로 제한됩니다
pt: A versão gratuita é limitada a {count} PDFs
ru: В бесплатной версии ограничение — {count} PDF
th: เวอร์ชันฟรีจำกัดไว้ที่ {count} ไฟล์ PDF
zh: 免费版限制为{count}个PDF

# imageQualityHighOption
source: High Quality (90%)
ar: جودة عالية (90 ٪)
de: Hohe Qualität (90%)
es: Alta calidad (90%)
fr: Haute qualité (90%)
he: איכות גבוהה (90%)
hi: उच्च गुणवत्ता (90%)
it: Alta qualità (90%)
ja: 高画質（90％）
ko: 고화질 (90%)
pt: Alta Qualidade (90%)
ru: Высокое качество (90%)
th: คุณภาพสูง (90%)
zh: 高质量 (90%)

# imageQualityMediumOption
source: Medium Quality (70%)
ar: الجودة المتوسطة (70 ٪)
de: Mittlere Qualität (70%)
es: Calidad media (70%)
fr: Qualité moyenne (70%)
he: איכות בינונית (70%)
hi: मध्यम गुणवत्ता (70%)
it: Qualità media (70%)
ja: 中画質（70％）
ko: 중간 화질 (70%)
pt: Qualidade Média (70%)
ru: Среднее качество (70%)
th: คุณภาพปานกลาง (70%)
zh: 中等质量 (70%)

# imageQualityLowOption
source: Low Quality (50%)
ar: جودة منخفضة (50 ٪)
de: Niedrige Qualität (50%)
es: Baja calidad (50%)
fr: De faible qualité (50%)
he: איכות נמוכה (50%)
hi: निम्न गुणवत्ता (50%)
it: Bassa qualità (50%)
ja: 低画質（50％）
ko: 저화질 (50%)
pt: Baixa Qualidade (50%)
ru: Низкое качество (50%)
th: คุณภาพต่ำ (50%)
zh: 低质量 (50%)

# orientationDefaultOption
source: Default Orientation
ar: التوجه الافتراضي
de: Standardausrichtung
es: Orientación predeterminada
fr: Orientation par défaut
he: תצוגת ברירת מחדל
hi: डिफ़ॉल्ट अभिविन्यास
it: Orientamento predefinito
ja: デフォルトの向き
ko: 기본 방향
pt: Orientação Padrão
ru: Ориентация по умолчанию
th: การวางแนวเริ่มต้น
zh: 默认方向

# orientationPortraitOption
source: Force Portrait
ar: قوة صورة
de: Porträt
es: Retrato de fuerza
fr: Forcer le portrait
he: כפה תצוגה לאורך
hi: पोर्ट्रेट मजबूर करें
it: Forzare il ritratto
ja: 縦向きに固定
ko: 세로 고정
pt: Forçar Retrato
ru: Принудительно портретная
th: บังคับแนวตั้ง
zh: 强制竖屏

# orientationLandscapeOption
source: Force Landscape
ar: قوة المناظر الطبيعية
de: Landschaft zwingen
es: Hacer un paisaje
fr: Paysage de force
he: כפה תצוגה לרוחב
hi: लैंडस्केप मजबूर करें
it: Forzare paesaggio
ja: 横向きに固定
ko: 가로 고정
pt: Forçar Paisagem
ru: Принудительно ландшафтная
th: บังคับแนวนอน
zh: 强制横屏

# orientationMixedOption
source: Mixed Orientation
ar: اتجاه مختلط
de: Gemischte Orientierung
es: Orientación mixta
fr: Orientation mixte
he: תצוגה מעורבת
hi: मिश्रित अभिविन्यास
it: Orientamento misto
ja: 混合向き
ko: 혼합 방향
pt: Orientação Mista
ru: Смешанная ориентация
th: การวางแนวผสม
zh: 混合方向

# unsupportedFileFormatError
source: Unsupported file format
ar: تنسيق ملف غير مدعوم
de: Nicht unterstützter Dateiformat
es: Formato de archivo no compatible
fr: Format de fichier non pris en charge
he: פורמט קובץ לא נתמך
hi: असमर्थित फ़ाइल प्रारूप
it: Formato di file non supportato
ja: サポートされていないファイル形式です
ko: 지원하지 않는 파일 형식
pt: Formato de arquivo não suportado
ru: Неподдерживаемый формат файла
th: ฟอร์แมตไฟล์ไม่รองรับ
zh: 不支持的文件格式

# supportedFormatsMessage
source: Supported formats: JPG, PNG, HEIC
ar: التنسيقات المدعومة: JPG ، PNG ، Heic
de: Unterstützte Formate: JPG, PNG, HIC
es: Formatos compatibles: JPG, PNG, HEIC
fr: Formats pris en charge: JPG, PNG, HEIC
he: פורמטים נתמכים: JPG, PNG, HEIC
hi: समर्थित प्रारूप: JPG, PNG, HEIC
it: Formati supportati: JPG, PNG, Heic
ja: 対応形式: JPG, PNG, HEIC
ko: 지원 형식: JPG, PNG, HEIC
pt: Formatos suportados: JPG, PNG, HEIC
ru: Поддерживаемые форматы: JPG, PNG, HEIC
th: ฟอร์แมตรองรับ: JPG, PNG, HEIC
zh: 支持格式：JPG, PNG, HEIC

# shareViaButton
source: Share via
ar: مشاركة عبر
de: Teile über
es: Compartir por
fr: Partager via
he: שתף באמצעות
hi: के माध्यम से साझा करें
it: Condividi via
ja: 共有方法
ko: 공유하기
pt: Compartilhar via
ru: Поделиться через
th: แชร์ผ่าน
zh: 通过...分享

# sharePdfButton
source: Share PDF
ar: مشاركة PDF
de: Teilen Sie PDF
es: Compartir PDF
fr: Partager PDF
he: שתף PDF
hi: PDF साझा करें
it: Condividi PDF
ja: PDFを共有
ko: PDF 공유
pt: Compartilhar PDF
ru: Поделиться PDF
th: แชร์ PDF
zh: 分享PDF

# enjoyingAppMessage
source: Enjoying iSpeedPix2PDF?
ar: الاستمتاع iSpeedPix2pdf؟
de: Genießen Sie Isspeedpix2pdf?
es: ¿Disfrutas de iSpeedPix2PDF?
fr: Vous appréciez iSpeedPix2PDF?
he: נהנה מ-iSpeedPix2PDF?
hi: iSpeedPix2PDF का आनंद ले रहे हैं?
it: Ti godi iSpeedpix2pdf?
ja: iSpeedPix2PDFを楽しんでいますか？
ko: iSpeedPix2PDF를 즐기고 계신가요?
pt: Está gostando do iSpeedPix2PDF?
ru: Вам нравится iSpeedPix2PDF?
th: คุณชอบ iSpeedPix2PDF ไหม?
zh: 喜欢iSpeedPix2PDF吗？

# rateAppStoreButton
source: Rate on App Store
ar: معدل في متجر التطبيقات
de: Preis im App Store
es: Califique en App Store
fr: Tarif sur l'App Store
he: דרג בחנות האפליקציות
hi: ऐप स्टोर पर रेट करें
it: Valuta sull'app store
ja: App Storeで評価
ko: 앱스토어에서 평가하기
pt: Avaliar na App Store
ru: Оценить в App Store
th: ให้คะแนนใน App Store
zh: 在App Store评分

# ratePlayStoreButton
source: Rate on Play Store
ar: معدل في متجر اللعب
de: Tarif im Spielgeschäft
es: Califique en Play Store
fr: Tarif sur Play Store
he: דרג ב-Google Play
hi: प्ले स्टोर पर रेट करें
it: Valuta su Play Store
ja: Play ストアで評価
ko: 플레이스토어에서 평가하기
pt: Avaliar na Play Store
ru: Оценить в Play Store
th: ให้คะแนนใน Play Store
zh: 在Play商店评分

# sendFeedbackButton
source: Send Feedback
ar: إرسال الملاحظات
de: Feedback senden
es: Enviar comentarios
fr: Envoyer des commentaires
he: שלח משוב
hi: प्रतिपुष्टि भेजें
it: Invia feedback
ja: フィードバックを送信
ko: 피드백 보내기
pt: Enviar Feedback
ru: Отправить отзыв
th: ส่งคำติชม
zh: 发送反馈

# preparingImagesInProgress
source: Preparing Images...
ar: إعداد الصور ...
de: Bilder vorbereiten ...
es: Preparando imágenes ...
fr: Préparer des images ...
he: מכין תמונות...
hi: छवियाँ तैयार की जा रही हैं...
it: Preparazione delle immagini ...
ja: 画像を準備中...
ko: 이미지 준비 중...
pt: Preparando imagens...
ru: Подготовка изображений...
th: กำลังเตรียมรูปภาพ...
zh: 正在准备图片...

# optimizingImagesInProgress
source: Optimizing Images...
ar: تحسين الصور ...
de: Bilder optimieren ...
es: Optimización de imágenes ...
fr: Optimisation d'images ...
he: ממטב תמונות...
hi: छवियाँ अनुकूलित की जा रही हैं...
it: Ottimizzare le immagini ...
ja: 画像を最適化中...
ko: 이미지 최적화 중...
pt: Otimizando imagens...
ru: Оптимизация изображений...
th: กำลังปรับแต่งรูปภาพ...
zh: 正在优化图片...

# generatingPdfInProgress
source: Generating PDF...
ar: توليد PDF ...
de: PDF erzeugen ...
es: Generando PDF ...
fr: Génération de PDF ...
he: יוצר PDF...
hi: PDF जेनरेट किया जा रहा है...
it: Generare pdf ...
ja: PDFを生成中...
ko: PDF 생성 중...
pt: Gerando PDF...
ru: Генерация PDF...
th: กำลังสร้าง PDF...
zh: 正在生成PDF...

# almostDoneMessage
source: Almost Done...
ar: تقريبا ...
de: Fast fertig ...
es: Casi hecho ...
fr: Presque fait ...
he: כמעט סיימנו...
hi: लगभग पूरा हो गया...
it: Quasi fatto ...
ja: もう少しで完了...
ko: 거의 완료되었습니다...
pt: Quase pronto...
ru: Почти готово...
th: เกือบเสร็จแล้ว...
zh: 快完成了...

# unlockFeatureButton
source: Unlock This Feature
ar: فتح هذه الميزة
de: Schalte diese Funktion frei
es: Desbloquear esta característica
fr: Déverrouiller cette fonctionnalité
he: פתח תכונה זו
hi: यह सुविधा अनलॉक करें
it: Sblocca questa funzione
ja: この機能をアンロック
ko: 이 기능 잠금 해제
pt: Desbloquear este recurso
ru: Открыть эту функцию
th: ปลดล็อกฟีเจอร์นี้
zh: 解锁此功能

# premiumFeatureMessage
source: Premium Feature
ar: ميزة قسط
de: Premium -Funktion
es: Característica premium
fr: Fonctionnalité premium
he: תכונה בתשלום
hi: प्रीमियम सुविधा
it: Funzione premium
ja: プレミアム機能
ko: 프리미엄 기능
pt: Recurso Premium
ru: Премиум-функция
th: ฟีเจอร์พรีเมียม
zh: 高级功能

# upgradeToUnlockMessage
source: Upgrade to unlock all features
ar: الترقية لفتح جميع الميزات
de: Upgrade, um alle Funktionen freizuschalten
es: Actualizar para desbloquear todas las funciones
fr: Mettre à niveau pour déverrouiller toutes les fonctionnalités
he: שדרג כדי לפתוח את כל הפונקציות
hi: सभी सुविधाओं को अनलॉक करने के लिए अपग्रेड करें
it: Aggiorna per sbloccare tutte le funzionalità
ja: すべての機能をアンロックするにはアップグレードしてください
ko: 모든 기능 잠금 해제를 위해 업그레이드하세요
pt: Atualize para desbloquear todos os recursos
ru: Обновите приложение, чтобы открыть все функции
th: อัปเกรดเพื่อปลดล็อกฟีเจอร์ทั้งหมด
zh: 升级以解锁全部功能

# weDoNotCollectAnyPersonalData
source: We do not collect, store, or process any personal data from users. All data is handled locally on your device. This means
ar: نحن لا نجمع أو تخزين أو معالجة أي بيانات شخصية من المستخدمين.
de: Wir sammeln, speichern oder verarbeiten keine personenbezogenen Daten von Benutzern.
es: No recopilamos, almacenamos ni procesamos datos personales de los usuarios.
fr: Nous ne collectons, ne stockons pas ou ne traitons pas de données personnelles des utilisateurs.
he: אנו לא אוספים, שומרים או מעבדים כל מידע אישי מהמשתמשים. כל הנתונים מנוהלים מקומית במכשיר שלך. כלומר
hi: हम उपयोगकर्ताओं से कोई व्यक्तिगत डेटा एकत्र, संग्रहीत या संसाधित नहीं करते हैं। सभी डेटा आपके डिवाइस पर स्थानीय रूप से संभाले जाते हैं। इसका मतलब है
it: Non raccogliamo, archiviamo o elaboriamo dati personali dagli utenti.
ja: 私たちはユーザーの個人データを収集、保存、処理しません。すべてのデータはデバイス内で処理されます。つまり
ko: 개인 데이터를 수집, 저장 또는 처리하지 않습니다. 모든 데이터는 기기 내에서만 처리됩니다.
pt: Não coletamos, armazenamos ou processamos nenhum dado pessoal dos usuários. Todos os dados são processados localmente no seu dispositivo. Isso significa
ru: Мы не собираем, не храним и не обрабатываем персональные данные пользователей. Все данные обрабатываются локально на вашем устройстве. Это означает, что
th: เราไม่เก็บรวบรวม จัดเก็บ หรือประมวลผลข้อมูลส่วนตัวใด ๆ ของผู้ใช้ ข้อมูลทั้งหมดถูกจัดการบนอุปกรณ์ของคุณเท่านั้น หมายความว่า
zh: 我们不收集、存储或处理任何用户个人数据。所有数据均在您的设备本地处理。也就是说

# noImagesAreShared
source: No images are uploaded to a server. - No personal data is collected, stored, or shared by our mobile app.
ar: لا يتم رفع الصور إلى الخادم. - لا يتم جمع أو تخزين أو مشاركة البيانات الشخصية من قبل تطبيقنا المحمول.
de: Keine Bilder werden auf einen Server hochgeladen. - Keine persönlichen Daten werden von unserer mobilen App gesammelt, gespeichert oder geteilt.
es: No se suben imágenes a un servidor. - No se recopilan, almacenan ni comparten datos personales por nuestra aplicación móvil.
fr: Aucune image n'est téléchargée sur un serveur. - Aucune donnée personnelle n'est collectée, stockée ou partagée par notre application mobile.
he: שום תמונה לא מועברת לשרת. - שום מידע אישי לא נאסף, נשמר או משותף על ידי האפליקציה שלנו.
hi: कोई छवि सर्वर पर अपलोड नहीं की जाती। - कोई व्यक्तिगत डेटा हमारे मोबाइल ऐप द्वारा एकत्र, संग्रहीत या साझा नहीं किया जाता।
it: Nessuna immagine viene caricata su un server.
ja: 画像はサーバーにアップロードされません。 - 私たちのモバイルアプリは個人情報を収集、保存、共有しません。
ko: 이미지가 서버에 업로드되지 않습니다. - 모바일 앱은 개인 데이터를 수집, 저장 또는 공유하지 않습니다.
pt: Nenhuma imagem é enviada para um servidor. - Nenhum dado pessoal é coletado, armazenado ou compartilhado pelo nosso app móvel.
ru: Изображения не загружаются на сервер. - Личные данные не собираются, не хранятся и не передаются нашим мобильным приложением.
th: ไม่มีการอัปโหลดรูปภาพไปยังเซิร์ฟเวอร์ - ไม่มีการเก็บรวบรวม จัดเก็บ หรือแบ่งปันข้อมูลส่วนตัวโดยแอปของเรา
zh: 没有图片被上传到服务器。 - 本应用不会收集、存储或分享任何个人数据。

source: Files Selected
ar: الملفات المحددة
de: Dateien ausgewählt
es: Archivos seleccionados
fr: Fichiers sélectionnés
he: קבצים נבחרו
hi: फाइलें चयनित
it: File selezionati
ja: ファイルが選択されました
ko: 선택된 파일
pt: Arquivos Selecionados
ru: Выбрано файлов
th: ไฟล์ที่เลือก
zh: 已选择文件

source: Rate this app
ar: قيم هذا التطبيق
de: Bewerten diese App
es: Califica esta aplicación
fr: Évaluez cette application
he: דרג אפליקציה זו
hi: इस ऐप को रेट करें
it: Valuta questa app
ja: このアプリを評価
ko: 이 앱 평가하기
pt: Avalie este app
ru: Оцените это приложение
th: ให้คะแนนแอปนี้
zh: 评价此应用

# rateThisAppMessage
source: If you enjoy using this app, would really appreciate it if you could take a minute to leave a review! Your feedback helps us improve and won’t take more than a minute of your time.
ar: إذا كنت تستمتع باستخدام هذا التطبيق ، فستقدر ذلك حقًا إذا كان بإمكانك أن تستغرق دقيقة لمغادرة المراجعة!
de: Wenn Sie diese App genießen, würden Sie sie sehr schätzen, wenn Sie sich eine Minute Zeit nehmen könnten, um eine Bewertung zu hinterlassen!
es: Si disfruta usar esta aplicación, ¡realmente lo agradecería si pudiera tomarse un minuto para dejar una reseña!
fr: Si vous aimez utiliser cette application, je l'apprécierais vraiment si vous pouviez prendre une minute pour laisser un avis!
he: אם אתה נהנה מהשימוש באפליקציה, נשמח אם תיקח דקה לכתוב ביקורת! המשוב שלך עוזר לנו להשתפר ולא ייקח יותר מדקה מזמנך.
hi: यदि आपको यह ऐप पसंद आ रहा है, तो कृपया एक मिनट निकालकर समीक्षा दें! आपकी प्रतिक्रिया हमें बेहतर बनाने में मदद करती है और आपका समय ज्यादा नहीं लेगी।
it: Se ti piace usare questa app, lo apprezzerei davvero se potessi prendere un minuto per lasciare una recensione!
ja: このアプリを気に入っていただけたら、レビューを残していただけると嬉しいです！フィードバックは改善の助けになり、1分もかかりません。
ko: 이 앱이 마음에 드셨다면, 리뷰를 남겨주시면 정말 감사하겠습니다! 여러분의 피드백은 저희가 앱을 개선하는 데 큰 도움이 됩니다.
pt: Se você gosta de usar este app, agradecemos muito se puder dedicar um minuto para deixar uma avaliação! Seu feedback nos ajuda a melhorar e não vai tomar mais do que um minuto do seu tempo.
ru: Если вам нравится приложение, пожалуйста, уделите минуту, чтобы оставить отзыв! Ваш отзыв помогает нам улучшаться и займет не больше минуты.
th: ถ้าคุณชอบใช้แอปนี้ กรุณาสละเวลาสักครู่เพื่อเขียนรีวิว! ความคิดเห็นของคุณช่วยให้เราปรับปรุงและจะใช้เวลาไม่เกินหนึ่งนาที
zh: 如果您喜欢此应用，请花一分钟时间评价！您的反馈帮助我们改进，不会占用您太多时间。

source: RATE
ar: معدل
es: TASA
fr: TAUX
he: דרג
hi: रेट करें
it: VALUTARE
ja: 評価する
ko: 평가
pt: AVALIAR
ru: ОЦЕНИТЬ
th: ให้คะแนน
zh: 评价

source: NO THANKS
ar: ًلا شكرا
de: NEIN DANKE
es: NO, GRACIAS
fr: NON MERCI
he: לא תודה
hi: नहीं धन्यवाद
it: NO GRAZIE
ja: いいえ、結構です
ko: 괜찮아요
pt: NÃO, OBRIGADO
ru: НЕТ, СПАСИБО
th: ไม่ขอ
zh: 不，谢谢

source: MAYBE LATER
ar: ربما في وقت لاحق
de: Vielleicht später
es: Tal vez más tarde
fr: Peut-être plus tard
he: אולי מאוחר יותר
hi: शायद बाद में
it: Forse più tardi
ja: あとで
ko: 나중에 할게요
pt: TALVEZ MAIS TARDE
ru: МОЖЕТ ПОЗЖЕ
th: อาจจะทีหลัง
zh: 稍后再说

source: Permission Required
ar: إذن مطلوب
de: Erlaubnis erforderlich
es: Se requiere permiso
fr: Permission requise
he: נדרשת הרשאה
hi: अनुमति आवश्यक
it: Autorizzazione richiesta
ja: 権限が必要です
ko: 권한 필요
pt: Permissão Necessária
ru: Требуется разрешение
th: ต้องได้รับอนุญาต
zh: 需要权限

# freeTrialExpiredMessage
source: FREE TRIAL EXPIRED or FREE FEATURES EXHAUSTED
ar: انتهت صلاحية التجريبية المجانية أو الميزات المجانية المنهكة
de: Kostenlose Testversion abgelaufen oder kostenlose Funktionen erschöpft
es: Prueba gratuita Caducciones expiradas o gratuitas agotadas
fr: Essai gratuit expiré ou fonctionnalités gratuites épuisées
he: תקופת הניסיון הסתיימה או הפיצ’רים החינמיים נוצלו
hi: मुफ़्त ट्रायल समाप्त हो गया या मुफ़्त सुविधाएँ समाप्त हो गईं
it: Prove gratuite scadute o funzionalità gratuite esauste
ja: 無料トライアル終了または無料機能の利用制限に達しました
ko: 무료 체험 종료 또는 무료 기능 소진
pt: PERÍODO DE TESTE GRATUITO EXPIRADO ou RECURSOS GRATUITOS ESGOTADOS
ru: БЕСПЛАТНЫЙ ПРОБНЫЙ ПЕРИОД ЗАВЕРШЕН или БЕСПЛАТНЫЕ ФУНКЦИИ ИССЕЧЕНЫ
th: หมดช่วงทดลองใช้ฟรี หรือใช้ฟีเจอร์ฟรีหมดแล้ว
zh: 免费试用已过期或免费功能已用尽

# upgradeNowButton
source: Upgrade Now
ar: الترقية الآن
de: Jetzt Upgraden
es: Actualizar Ahora
fr: Passer Maintenant
he: שדרג עכשיו
hi: अभी अपग्रेड करें
it: Aggiornamento ora
ja: 今すぐアップグレード
ko: 지금 업그레이드
pt: Atualizar Agora
ru: Обновить сейчас
th: อัปเกรดตอนนี้
zh: 立即升级

source: How to Use
ar: كيفية استخدام
de: Wie man benutzt
es: Cómo usar
fr: Comment utiliser
he: כיצד להשתמש
hi: कैसे उपयोग करें
it: Come usare
ja: 使い方
ko: 사용 방법
pt: Como Usar
ru: Как использовать
th: วิธีใช้งาน
zh: 使用说明

source: Simplicity and Efficiency
ar: البساطة والكفاءة
de: Einfachheit und Effizienz
es: Simplicidad y eficiencia
fr: Simplicité et efficacité
he: פשטות ויעילות
hi: सरलता और दक्षता
it: Semplicità ed efficienza
ja: シンプルさと効率性
ko: 간편함과 효율성
pt: Simplicidade e Eficiência
ru: Простота и эффективность
th: ความเรียบง่ายและประสิทธิภาพ
zh: 简洁与高效

source: Privacy and Security
ar: الخصوصية والأمن
de: Privatsphäre und Sicherheit
es: Privacidad y seguridad
fr: Confidentialité et sécurité
he: פרטיות ואבטחה
hi: गोपनीयता और सुरक्षा
it: Privacy e sicurezza
ja: プライバシーとセキュリティ
ko: 개인정보 보호 및 보안
pt: Privacidade e Segurança
ru: Конфиденциальность и безопасность
th: ความเป็นส่วนตัวและความปลอดภัย
zh: 隐私与安全

source: More Apps By Tevin Eigh Designs
ar: Tevin Eights المزيد من التطبيقات من تصميم
de: Weitere Apps von Tevin Eigh Designs
es: Más aplicaciones de Tevin Eigh Designs
fr: Plus d'applications par Tevin High Designs
he: עוד אפליקציות מבית Tevin Eigh Designs
hi: Tevin Eigh Designs के और ऐप्स
it: Altre app di Tevin Eigh Designs
ja: Tevin Eigh Designs のその他のアプリ
ko: Tevin Eigh Designs의 더 많은 앱
pt: Mais Apps de Tevin Eigh Designs
ru: Другие приложения от Tevin Eigh Designs
th: แอปเพิ่มเติมโดย Tevin Eigh Designs
zh: Tevin Eigh Designs的更多应用

source: About Tevin Eigh Designs
ar: حول تصاميم Tevin Eigh
de: Über Tevin Eigh Designs
es: Sobre los diseños de Tevin Eigh
fr: À propos de Tevin High Designs
he: אודות Tevin Eigh Designs
hi: Tevin Eigh Designs के बारे में
it: Informazioni su Tevin Eigh Designs
ja: Tevin Eigh Designsについて
ko: Tevin Eigh Designs 소개
pt: Sobre Tevin Eigh Designs
ru: О Tevin Eigh Designs
th: เกี่ยวกับ Tevin Eigh Designs
zh: 关于Tevin Eigh Designs

source: Return to Converter
ar: العودة إلى المحول
de: Kehren Sie zum Konverter zurück
es: Volver al convertidor
fr: Retour au convertisseur
he: חזור לממיר
hi: कन्वर्टर पर वापस जाएं
it: Tornare al convertitore
ja: コンバーターに戻る
ko: 변환기로 돌아가기
pt: Voltar ao Conversor
ru: Вернуться к конвертеру
th: กลับไปที่ตัวแปลง
zh: 返回转换器

source: Current Plan: Full Access
ar: الخطة الحالية: الوصول الكامل
de: Aktueller Plan: Voller Zugriff
es: Plan actual: acceso completo
fr: Plan actuel: accès complet
he: תוכנית נוכחית: גישה מלאה
hi: वर्तमान योजना: पूर्ण एक्सेस
it: Piano attuale: pieno accesso
ja: 現在のプラン: フルアクセス
ko: 현재 플랜: 전체 접근
pt: Plano Atual: Acesso Completo
ru: Текущий план: полный доступ
th: แผนปัจจุบัน: เข้าถึงเต็มรูปแบบ
zh: 当前计划：完全访问

source: Current Plan: Free Trial
ar: الخطة الحالية: تجربة مجانية
de: Aktueller Plan: Freie Testversion
es: Plan actual: prueba gratuita
fr: Plan actuel: essai gratuit
he: תוכנית נוכחית: ניסיון חינמי
hi: वर्तमान योजना: मुफ्त ट्रायल
it: Piano attuale: prova gratuita
ja: 現在のプラン: 無料トライアル
ko: 현재 플랜: 무료 체험
pt: Plano Atual: Teste Gratuito
ru: Текущий план: бесплатный пробный период
th: แผนปัจจุบัน: ทดลองใช้ฟรี
zh: 当前计划：免费试用

# freeTrialOneWeekUnlimitedUse
source: FREE TRIAL – 3 Days – Unlimited Use
ar: تجربة مجانية - أسبوع واحد - استخدام غير محدود
de: Kostenlose Testversion - 3 Tage - Unbegrenzte Verwendung
es: Prueba gratuita - 1 semana - Uso ilimitado
fr: Essai gratuit - 3 jours - utilisation illimitée
he: ניסיון חינמי – 3 ימים – שימוש ללא הגבלה
hi: मुफ़्त ट्रायल – 1 सप्ताह – असीमित उपयोग
it: Prova gratuita - 1 settimana - Uso illimitato
ja: 無料トライアル – 1週間 – 無制限使用
ko: 무료 체험 – 1주일 – 무제한 사용
pt: TESTE GRATUITO – 3 Dias – Uso Ilimitado
ru: БЕСПЛАТНЫЙ ПРОБНЫЙ ПЕРИОД – 1 неделя – неограниченное использование
th: ทดลองใช้ฟรี – 1 สัปดาห์ – ใช้ไม่จำกัด
zh: 免费试用 – 1周 – 无限使用

# freeVersionTrialAfterTrialExpires
source: FREE VERSION – After Trial Expires
ar: نسخة مجانية - بعد انتهاء التجربة
de: Kostenlose Version - Nach Ablauf der Testversion
es: Versión gratuita: después de la prueba expira
fr: Version gratuite - Une fois l'essai expire
he: גרסה חינמית – לאחר סיום תקופת הניסיון
hi: मुफ़्त संस्करण – ट्रायल समाप्त होने के बाद
it: Versione gratuita - Dopo la scadenza della prova
ja: 無料版 – トライアル終了後
ko: 무료 버전 – 체험 종료 후
pt: VERSÃO GRATUITA – Após expirar o teste
ru: БЕСПЛАТНАЯ ВЕРСИЯ – после окончания пробного периода
th: เวอร์ชันฟรี – หลังหมดช่วงทดลองใช้
zh: 免费版本 – 试用期后

# createUpToFivePDFsEverySevenDays
source: ✔ Create up to 5 PDFs every 3 days
ar: ✔ قم بإنشاء ما يصل إلى 5 ملفات PDF كل 7 أيام
de: ✔ Erstellen Sie alle 3 Tage bis zu 5 PDFs
es: ✔ Cree hasta 5 PDF cada 7 días
fr: ✔ Créez jusqu'à 5 PDF tous les 3 jours
he: ✔ צור עד 5 קובצי PDF כל 3 ימים
hi: ✔ हर 7 दिन में 5 PDFs तक बनाएं
it: ✔ Crea fino a 5 PDF ogni 7 giorni
ja: ✔ 7日ごとに最大5件のPDFを作成
ko: ✔ 7일마다 최대 5개의 PDF 생성
pt: ✔ Crie até 5 PDFs a cada 3 dias
ru: ✔ Создавайте до 5 PDF каждые 7 дней
th: ✔ สร้าง PDF ได้สูงสุด 5 ไฟล์ทุก 7 วัน
zh: ✔ 每7天可创建最多5个PDF

# eachPDFCanHaveUpToThreePages
source: ✔ Each PDF can have up to 3 pages
ar: ✔ يمكن أن يكون لكل PDF ما يصل إلى 3 صفحات
de: ✔ Jeder PDF kann bis zu 3 Seiten haben
es: ✔ Cada PDF puede tener hasta 3 páginas
fr: ✔ Chaque PDF peut avoir jusqu'à 3 pages
he: ✔ כל PDF יכול להכיל עד 3 עמודים
hi: ✔ प्रत्येक PDF में 3 पृष्ठ तक हो सकते हैं
it: ✔ Ogni PDF può avere fino a 3 pagine
ja: ✔ 各PDFは最大3ページまで
ko: ✔ 각 PDF는 최대 3페이지
pt: ✔ Cada PDF pode ter até 3 páginas
ru: ✔ Каждый PDF может содержать до 3 страниц
th: ✔ PDF แต่ละไฟล์มีได้สูงสุด 3 หน้า
zh: ✔ 每个PDF最多3页

# autoResetEverySevenDays
source: ✔ Auto-reset every 3 days
ar: ✔ إعادة التقييد التلقائي كل 7 أيام
de: ✔ Autoaufnahme alle 3 Tage
es: ✔ RESETA AUTOPAJE CADA 7 DÍAS
fr: ✔ Réinitialisation automatique tous les 3 jours
he: ✔ איפוס אוטומטי כל 3 ימים
hi: ✔ हर 7 दिन में ऑटो-रीसेट
it: ✔ Auto-reset ogni 7 giorni
ja: ✔ 7日ごとに自動リセット
ko: ✔ 7일마다 자동 초기화
pt: ✔ Reinício automático a cada 3 dias
ru: ✔ Автоматический сброс каждые 7 дней
th: ✔ รีเซ็ตอัตโนมัติทุก 7 วัน
zh: ✔ 每7天自动重置

source: One Time Purchase (Unlock Full Access)
ar: لمرة واحدة الشراء (فتح الوصول الكامل)
de: Einmal Kauf (vollen Zugang freischalten)
es: Compra única (desbloquear el acceso completo)
fr: Achat unique (déverrouiller l'accès complet)
he: רכישה חד פעמית (גישה מלאה לכל החיים)
hi: एक बार की खरीदारी (पूर्ण एक्सेस अनलॉक)
it: One Time Acquista (sblocca il pieno accesso)
ja: 一度の購入でフルアクセスをアンロック
ko: 일회성 구매로 전체 기능 잠금 해제
pt: Compra única (Desbloqueia Acesso Completo)
ru: Одноразовая покупка (открыть полный доступ)
th: ซื้อครั้งเดียวเพื่อปลดล็อกการใช้งานเต็มรูปแบบ
zh: 一次购买，解锁完全访问权限

source: ✔ Ad-free after purchase
fr: ✔ Sans publicité après achat
he: ✔ ללא פרסומות לאחר הרכישה
pt: ✔ Sem anúncios após a compra

source: ✔ Unlimited PDF creation
ar: ✔ خلق PDF غير محدود
de: ✔ Unbegrenzte PDF -Erstellung
es: ✔ Creación de PDF ilimitada
fr: ✔ Création illimitée PDF
he: ✔ יצירת PDF ללא הגבלה
hi: ✔ असीमित PDF निर्माण
it: ✔ Creazione PDF illimitata
ja: ✔ 無制限のPDF作成
ko: ✔ 무제한 PDF 생성
pt: ✔ Criação ilimitada de PDFs
ru: ✔ Неограниченное создание PDF
th: ✔ สร้าง PDF ได้ไม่จำกัด
zh: ✔ 无限制创建PDF
