Repository: WaseemMirzaa/ispeedpix2pdf7
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, he, hi, it, ja, ko, pt, ru, th, zh

# singlePurchaseLifetimeAccess
source: ✔ A single purchase for lifetime access
ar: ✔ عملية شراء واحدة للوصول إلى مدى الحياة
de: ✔ Ein einzelner Kauf für den Lebensdauerzugriff
es: ✔ Una sola compra para el acceso de por vida
fr: ✔ Un seul achat pour un accès à vie
he: ✔ רכישה אחת לגישה מלאה לכל החיים
hi: ✔ जीवनकाल के लिए एक बार खरीदारी
it: ✔ Un singolo acquisto per l'accesso a vita
ja: ✔ 一度の購入で生涯アクセス
ko: ✔ 평생 이용 가능한 단일 구매
pt: ✔ Uma única compra para acesso vitalício
ru: ✔ Единовременная покупка с пожизненным доступом
th: ✔ ซื้อครั้งเดียว ใช้งานได้ตลอดชีพ
zh: ✔ 一次购买，终身访问

# upgradeTodayToUnlockCompletePotential
source: Upgrade today to unlock the complete potential of iSpeedPix2Pdf with a lifetime subscription 🚀
ar: الترقية اليوم لإلغاء قفل الإمكانات الكاملة لـ ISPEDEPIX2PDF مع اشتراك مدى الحياة 🚀
de: Aktualisieren Sie noch heute, um das vollständige Potenzial von iSpeedPix2pdf mit einem lebenslangen Abonnement zu entsperren. 🚀
es: Actualice hoy para desbloquear el potencial completo de iSpeedPix2PDF con una suscripción de por vida 🚀
fr: Mettre à niveau aujourd'hui pour déverrouiller le potentiel complet d'iSpeedPix2PDF avec un abonnement à vie 🚀
he: שדרג עוד היום כדי לפתוח את כל הפוטנציאל של iSpeedPix2PDF עם מנוי לכל החיים 🚀
hi: आज ही अपग्रेड करें और iSpeedPix2Pdf की पूरी क्षमता अनलॉक करें 🚀
it: Aggiorna oggi per sbloccare il potenziale completo di ispeedpix2pdf con un abbonamento a vita 🚀
ja: 今すぐアップグレードして、生涯サブスクリプションでiSpeedPix2PDFの全機能をアンロック🚀
ko: 오늘 업그레이드하여 iSpeedPix2PDF의 모든 기능을 평생 구독으로 잠금 해제하세요 🚀
pt: Atualize hoje para desbloquear todo o potencial do iSpeedPix2Pdf com uma assinatura vitalícia 🚀
ru: Обновитесь сегодня, чтобы раскрыть полный потенциал iSpeedPix2PDF с пожизненной подпиской 🚀
th: อัปเกรดวันนี้เพื่อปลดล็อกศักยภาพเต็มของ iSpeedPix2PDF ด้วยการสมัครสมาชิกตลอดชีพ 🚀
zh: 今天升级，解锁iSpeedPix2Pdf的全部潜力，享受终身订阅 🚀

# enjoyFullAccess
source: Enjoy Your Full Access
ar: استمتع وصولك الكامل
de: Genießen Sie Ihren vollen Zugang
es: Disfruta tu acceso completo
fr: Profitez de votre accès complet
he: תהנה מגישה מלאה
hi: अपने पूर्ण एक्सेस का आनंद लें
it: Goditi il ​​tuo pieno accesso
ja: フルアクセスをお楽しみください
ko: 전체 기능을 즐기세요
pt: Aproveite seu acesso completo
ru: Наслаждайтесь полным доступом
th: เพลิดเพลินกับการเข้าถึงเต็มรูปแบบ
zh: 享受您的完全访问权限

source: Checking Active Purchase
ar: التحقق من الشراء النشط
de: Überprüfen Sie den aktiven Kauf
es: Comprobación de compra activa
fr: Vérification de l'achat actif
he: בודק רכישות פעילות
hi: सक्रिय खरीदारी जांच रहे हैं
it: Controllo dell'acquisto attivo
ja: 購入状況を確認中
ko: 활성 구매 확인 중
pt: Verificando compra ativa
ru: Проверка активной покупки
th: กำลังตรวจสอบการซื้อที่ใช้งานอยู่
zh: 正在检查有效购买

source: Already Purchased? Restore Here
ar: تم شراؤها بالفعل؟
de: Bereits gekauft?
es: Ya comprado?
fr: Déjà acheté?
he: כבר רכשת? שחזר כאן
hi: पहले से खरीदा है? यहां पुनः प्राप्त करें
it: Verifica dell'acquisto attivo
ja: すでに購入済みですか？ここで復元
ko: 이미 구매하셨나요? 여기서 복원하세요
pt: Já comprou? Restaure aqui
ru: Уже покупали? Восстановите здесь
th: ซื้อแล้ว? คืนค่าที่นี่
zh: 已购买？点击这里恢复

# buyNowInFourNineNine
source: Buy Now in 1.99
ar: شراء الآن في 4.99
de: Jetzt in 1,99 kaufen
es: Compre ahora en 4.99
fr: Achetez maintenant en 1.99
he: קנה עכשיו ב-1.99
hi: अब खरीदें 4.99 में
it: Acquista ora in 4.99
ja: 今すぐ4.99で購入
ko: 4.99에 구매하기
pt: Compre agora por 1,99
ru: Купить сейчас за 4.99
th: ซื้อเลยในราคา 4.99
zh: 立即购买，仅售4.99

source: Success
ar: نجاح
de: Erfolg
es: Éxito
fr: Succès
he: הצלחה
hi: सफलता
it: Successo
ja: 成功
ko: 성공
pt: Sucesso
ru: Успех
th: สำเร็จ
zh: 成功

source: Your purchase has been successfully restored!
ar: تم استعادة عملية الشراء بنجاح!
de: Ihr Kauf wurde erfolgreich restauriert!
es: ¡Su compra ha sido restaurada con éxito!
fr: Votre achat a été restauré avec succès!
he: הרכישה שלך שוחזרה בהצלחה!
hi: आपकी खरीदारी सफलतापूर्वक पुनः प्राप्त की गई!
it: Il tuo acquisto è stato ripristinato con successo!
ja: 購入が正常に復元されました！
ko: 구매가 성공적으로 복원되었습니다!
pt: Sua compra foi restaurada com sucesso!
ru: Ваша покупка успешно восстановлена!
th: การซื้อของคุณถูกคืนค่าเรียบร้อยแล้ว!
zh: 您的购买已成功恢复！

source: Purchase History
ar: سجل الشراء
de: Kaufgeschichte
es: Historial de compra
fr: Historique des achats
he: היסטוריית רכישות
hi: खरीदारी इतिहास
it: Cronologia degli acquisti
ja: 購入履歴
ko: 구매 내역
pt: Histórico de compras
ru: История покупок
th: ประวัติการซื้อ
zh: 购买记录

source: No purchases found
ar: لم يتم العثور على عمليات شراء
de: Keine Einkäufe gefunden
es: No se encontraron compras
fr: Aucun achat trouvé
he: לא נמצאו רכישות
hi: कोई खरीदारी नहीं मिली
it: Nessun acquisto trovato
ja: 購入が見つかりません
ko: 구매 내역이 없습니다
pt: Nenhuma compra encontrada
ru: Покупок не найдено
th: ไม่พบการซื้อ
zh: 未找到购买记录

# weCouldNotFindAnyPreviousPurchasesToRestore
source: We couldn't find any previous purchases to restore.
ar: لم نتمكن من العثور على أي عمليات شراء سابقة لاستعادتها.
de: Wir konnten frühere Einkäufe nicht wiederherstellen.
es: No pudimos encontrar ninguna compra previa para restaurar.
fr: Nous n'avons trouvé aucun achat précédent à restaurer.
he: לא הצלחנו למצוא רכישות קודמות לשחזור.
hi: हम किसी पिछली खरीदारी को पुनः प्राप्त करने में असमर्थ थे।
it: Non siamo riusciti a trovare acquisti precedenti da ripristinare.
ja: 復元可能な以前の購入が見つかりませんでした。
ko: 복원할 이전 구매 내역을 찾을 수 없습니다.
pt: Não encontramos nenhuma compra anterior para restaurar.
ru: Не удалось найти предыдущие покупки для восстановления.
th: เราไม่พบการซื้อก่อนหน้านี้ที่สามารถคืนค่าได้
zh: 未找到任何可恢复的购买记录。

source: Purchase Date
ar: تاريخ الشراء
de: Kaufdatum
es: Fecha de compra
fr: Date d'achat
he: תאריך רכישה
hi: खरीदारी तिथि
it: Data di acquisto
ja: 購入日
ko: 구매 날짜
pt: Data da compra
ru: Дата покупки
th: วันที่ซื้อ
zh: 购买日期

source: Purchase Amount
ar: مبلغ الشراء
de: Kaufbetrag
es: Monto de compra
fr: Montant d'achat
he: סכום רכישה
hi: खरीदारी राशि
it: Importo dell'acquisto
ja: 購入金額
ko: 구매 금액
pt: Valor da compra
ru: Сумма покупки
th: จำนวนเงินที่ซื้อ
zh: 购买金额

source: Purchase Status
ar: حالة الشراء
de: Kaufstatus
es: Estado de compra
fr: Statut d'achat
he: סטטוס רכישה
hi: खरीदारी स्थिति
it: Stato di acquisto
ja: 購入ステータス
ko: 구매 상태
pt: Status da compra
ru: Статус покупки
th: สถานะการซื้อ
zh: 购买状态

source: Purchase ID
ar: معرف الشراء
de: Kauf -ID
es: Compra de identificación
fr: ID d'achat
he: מזהה רכישה
hi: खरीदारी आईडी
it: ID acquisto
ja: 購入ID
ko: 구매 ID
pt: ID da compra
ru: ID покупки
th: รหัสการซื้อ
zh: 购买编号

source: Purchase Details
ar: تفاصيل الشراء
de: Details kaufen
es: Detalles de compra
fr: Détails de l'achat
he: פרטי רכישה
hi: खरीदारी विवरण
it: Dettagli di acquisto
ja: 購入詳細
ko: 구매 상세 정보
pt: Detalhes da compra
ru: Детали покупки
th: รายละเอียดการซื้อ
zh: 购买详情

source: Error
ar: خطأ
de: Fehler
fr: Erreur
he: שגיאה
hi: त्रुटि
it: Errore
ja: エラー
ko: 오류
pt: Erro
ru: Ошибка
th: ข้อผิดพลาด
zh: 错误

source: Failed to restore purchases. Please try again later.
ar: فشل في استعادة عمليات الشراء.
de: Einkäufe nicht wiederhergestellt.
es: No se pudo restaurar las compras.
fr: N'a pas réussi à restaurer les achats.
he: שחזור הרכישות נכשל. אנא נסה שוב מאוחר יותר.
hi: खरीदारी पुनः प्राप्त करने में विफल। कृपया बाद में पुनः प्रयास करें।
it: Ripristino degli acquisti non riuscito. Per favore, riprova più tardi.
ja: 購入の復元に失敗しました。後でもう一度試してください。
ko: 구매 복원에 실패했습니다. 나중에 다시 시도해 주세요.
pt: Falha ao restaurar compras. Por favor, tente novamente mais tarde.
ru: Не удалось восстановить покупки. Попробуйте позже.
th: คืนค่าการซื้อไม่สำเร็จ กรุณาลองใหม่อีกครั้งในภายหลัง
zh: 恢复购买失败，请稍后重试。

source: How to Use iSpeedPix2PDF: Step-by-Step
ar: كيفية استخدام iSpeedPix2PDF: خطوة بخطوة
de: So verwenden Sie ISspeedpix2pdf: Schritt für Schritt
es: Cómo usar iSpeedPix2PDF: paso a paso
fr: Comment utiliser iSpeedPix2PDF: étape par étape
he: כיצד להשתמש ב-iSpeedPix2PDF: שלב אחר שלב
hi: iSpeedPix2PDF का उपयोग कैसे करें: चरण-दर-चरण
it: Come usare ISPEEDPIX2PDF: passo per passo
ja: iSpeedPix2PDFの使い方：ステップバイステップ
ko: iSpeedPix2PDF 사용법: 단계별 안내
pt: Como Usar o iSpeedPix2PDF: Passo a Passo
ru: Как использовать iSpeedPix2PDF: пошагово
th: วิธีใช้ iSpeedPix2PDF ทีละขั้นตอน
zh: iSpeedPix2PDF使用步骤：

# howToUsePointOne
source: 1. Select Picture''s Tap the ''Choose Files'' button to open your photo gallery -Select the photos you want to include in your PDF. You can choose multiple images at once 2. Add a File Name (Optional) - You can give your PDF a custom file name by tapping the ''File Name'' field - If you don''t provide a name, the app will automatically assign one in the format iSpeedPix2PDF_DATE_TIME 3. View or Download the PDF - Download it to save the file (The file is designed to be small enough for easy sharing and management) - View it directly within the app for a quick look 4. Share the PDF - Once saved, you can share the PDF via email, messaging apps, upload it to cloud services, or any other sharing option on your device - With the PDF saved, you can easily manage, edit, and share your scans using the tools you''re already familiar with—streamlining the process for faster, more efficient document handling That''s it! You''ve created, viewed, and shared a compact, easily manageable PDF with iSpeedPix2PDF.
ar: 1. اختر الصور''s اضغط على زر ''اختيار الملفات'' لفتح gاليري الصور الخاصة بك - اختر الصور التي تريد تضمينها في PDF. يمكنك اختيار عدة صور دفعة واحدة 2. إضافة اسم ملف (اختياري) - يمكنك إعطاء PDF الخاص بك اسم ملف مخصص عن طريق الضغط على حقل ''اسم الملف'' - إذا لم تقدم اسمًا، سيقوم التطبيق بتعيين اسم تلقائيًا بالشكل iSpeedPix2PDF_DATE_TIME 3. عرض أو تنزيل PDF - قم بتنزيله لحفظ الملف (الملف مصمم ليكون صغيرًا بما يكفي للمشاركة والإدارة بسهولة) - عاينه مباشرة داخل التطبيق للحصول على لمحة سريعة 4. مشاركة PDF - بعد حفظه، يمكنك مشاركة PDF عبر البريد الإلكتروني، تطبيقات الرسائل، رفعه إلى خدمات السحابة، أو أي خيار آخر للمشاركة على جهازك - مع حفظ PDF، يمكنك بسهولة إدارة، تعديل، ومشاركة المسح الضوئي باستخدام الأدوات التي تعرفها بالفعل—مما يسهل العملية لتسريع وإدارة الوثائق بشكل أكثر كفاءة هذا كل شيء! لقد أنشأت، عاينت، وشاركت PDF مضغوط وسهل الإدارة باستخدام iSpeedPix2PDF.
de: 1, Bild auswählen Tippen Sie auf die Schaltfläche „Dateien auswählen“, um Ihre Fotogalerie zu öffnen - Wählen Sie die Fotos aus, die Sie in Ihr PDF einfügen möchten. Sie können mehrere Bilder auf einmal auswählen 2. Einen Dateinamen hinzufügen (optional) - Sie können Ihrem PDF einen eigenen Dateinamen geben, indem Sie auf das Feld „Dateiname“ tippen - Wenn Sie keinen Namen angeben, weist die App automatisch einen Namen im Format iSpeedPix2PDF_DATUM_UHRZEIT zu 3. PDF anzeigen oder herunterladen - Laden Sie es herunter, um die Datei zu speichern (Die Datei ist so optimiert, dass sie klein genug für einfaches Teilen und Verwalten ist) - Sehen Sie es direkt in der App an, um einen schnellen Überblick zu bekommen 4. PDF teilen - Sobald die Datei gespeichert ist, können Sie das PDF per E-Mail, Messenger, in Cloud-Dienste hochladen oder über jede andere Freigabeoption auf Ihrem Gerät teilen - Mit dem gespeicherten PDF können Sie Ihre Scans ganz einfach verwalten, bearbeiten und teilen – mit den Tools, die Sie bereits kennen, um den Prozess zu vereinfachen und die Dokumentenverarbeitung effizienter zu gestalten Das war’s! Sie haben erfolgreich ein kompaktes, leicht verwaltbares PDF mit iSpeedPix2PDF erstellt, angezeigt und geteilt.
es: 1. Selecciona Imágenes''s Toca el botón ''Elegir Archivos'' para abrir tu galería de fotos -Selecciona las fotos que deseas incluir en tu PDF. Puedes elegir múltiples imágenes a la vez 2. Añadir un Nombre de Archivo (Opcional) - Puedes darle un nombre personalizado a tu PDF tocando el campo ''Nombre del Archivo'' - Si no proporcionas un nombre, la app asignará uno automáticamente en el formato iSpeedPix2PDF_FECHA_HORA 3. Ver o Descargar el PDF - Descárgalo para guardar el archivo (El archivo está diseñado para ser lo suficientemente pequeño como para compartirlo y gestionarlo fácilmente) - Velo directamente dentro de la app para una vista rápida 4. Compartir el PDF - Una vez guardado, puedes compartir el PDF por correo electrónico, apps de mensajería, subirlo a servicios en la nube, o cualquier otra opción de compartir en tu dispositivo - Con el PDF guardado, puedes gestionar, editar y compartir fácilmente tus escaneos usando las herramientas con las que ya estás familiarizado—simplificando el proceso para un manejo de documentos más rápido y eficiente ¡Eso es todo! Has creado, visualizado y compartido un PDF compacto y fácil de gestionar con iSpeedPix2Pdf.
fr: 1. Sélectionner des images''s Appuyez sur le bouton ''Choisir des fichiers'' pour ouvrir votre galerie de photos - Sélectionnez les photos que vous souhaitez inclure dans votre PDF. Vous pouvez choisir plusieurs images à la fois 2. Ajouter un nom de fichier (Optionnel) - Vous pouvez donner un nom personnalisé à votre PDF en appuyant sur le champ ''Nom du fichier'' - Si vous ne fournissez pas de nom, l'application en attribuera automatiquement un au format iSpeedPix2PDF_DATE_TIME 3. Voir ou télécharger le PDF - Téléchargez-le pour enregistrer le fichier (Le fichier est conçu pour être suffisamment petit pour un partage et une gestion faciles) - Visualisez-le directement dans l'application pour un aperçu rapide 4. Partager le PDF - Une fois enregistré, vous pouvez partager le PDF par e-mail, applications de messagerie, le télécharger sur des services cloud, ou toute autre option de partage disponible sur votre appareil - Une fois le PDF sauvegardé, vous pouvez facilement gérer, modifier et partager vos scans en utilisant les outils que vous connaissez déjà—simplifiant le processus pour une gestion de documents plus rapide et plus efficace C'est tout ! Vous avez créé, visualisé et partagé un PDF compact et facile à gérer avec iSpeedPix2PDF.
he: 1. בחר תמונות הקש על כפתור 'בחר קבצים' לפתיחת גלריית התמונות שלך -בחר את התמונות שברצונך להוסיף ל-PDF שלך. ניתן לבחור מספר תמונות בו זמנית 2. הוסף שם לקובץ (אופציונלי) - תוכל להזין שם מותאם אישית ל-PDF שלך על ידי הקשה על שדה 'שם הקובץ' - אם לא תזין שם, האפליקציה תיצור שם אוטומטי בפורמט iSpeedPix2PDF_DATE_TIME 3. הצג או הורד את ה-PDF - הורד כדי לשמור את הקובץ (הקובץ בנוי להיות קטן לצורך שיתוף וניהול נוחים) - הצג אותו ישירות באפליקציה להצגה מהירה 4. שתף את ה-PDF - לאחר השמירה, תוכל לשתף את ה-PDF בדוא״ל, אפליקציות מסרים, שירותי ענן, או כל אפשרות שיתוף אחרת במכשירך - עם PDF שמור, תוכל לנהל, לערוך ולשתף את הסריקות שלך בקלות, באמצעות הכלים שאתה כבר מכיר—לייעול התהליך וניהול מסמכים יעיל יותר וזהו! יצרת, צפית ושיתפת PDF קל לניהול עם iSpeedPix2PDF.
hi: 1. तस्वीरें चुनें ''चुनें फ़ाइलें'' बटन पर टैप करें और अपनी फोटो गैलरी खोलें। - उन तस्वीरों को चुनें जिन्हें आप PDF में शामिल करना चाहते हैं। आप एक बार में कई छवियाँ चुन सकते हैं। 2. फ़ाइल नाम जोड़ें (वैकल्पिक) - आप PDF के लिए कस्टम फ़ाइल नाम दे सकते हैं। - यदि आप नाम नहीं देते हैं, तो ऐप स्वचालित रूप से नाम प्रदान करेगा जैसे iSpeedPix2PDF_DATE_TIME 3. PDF देखें या डाउनलोड करें - डाउनलोड करें और फ़ाइल सहेजें। (फ़ाइल का आकार छोटा होता है जिससे साझा करना आसान हो) - ऐप में ही PDF का पूर्वावलोकन देखें 4. PDF साझा करें - सहेजने के बाद आप इसे ईमेल, मैसेजिंग ऐप्स, क्लाउड सर्विसेज आदि से साझा कर सकते हैं। - PDF को आसानी से प्रबंधित, संपादित और साझा करें जो आपकी दक्षता बढ़ाए। बस! आपने iSpeedPix2PDF के साथ एक कॉम्पैक्ट और प्रबंधनीय PDF बना लिया है।
it: 1. Seleziona le immagini''s Tocca il pulsante ''Scegli file'' per aprire la tua galleria fotografica - Seleziona le foto che desideri includere nel tuo PDF. Puoi scegliere più immagini contemporaneamente 2. Aggiungi un nome file (opzionale) - Puoi assegnare un nome personalizzato al tuo PDF toccando il campo ''Nome file'' - Se non fornisci un nome, l'app assegnerà automaticamente uno nel formato iSpeedPix2PDF_DATE_TIME 3. Visualizza o scarica il PDF - Scaricalo per salvare il file (il file è progettato per essere abbastanza piccolo da poter essere facilmente condiviso e gestito) - Visualizzalo direttamente nell'app per un'anteprima rapida 4. Condividi il PDF - Una volta salvato, puoi condividere il PDF tramite e-mail, app di messaggistica, caricarlo su servizi cloud o qualsiasi altra opzione di condivisione disponibile sul tuo dispositivo - Con il PDF salvato, puoi facilmente gestire, modificare e condividere le tue scansioni utilizzando gli strumenti che già conosci—semplificando il processo per una gestione dei documenti più rapida ed efficiente È tutto! Hai creato, visualizzato e condiviso un PDF compatto e facilmente gestibile con iSpeedPix2PDF.
ja: 1. 画像を選択 「ファイルを選択」ボタンをタップして写真ギャラリーを開きます。 PDFに含めたい写真を選択できます。複数の画像を同時に選択可能です。 2. ファイル名を追加（任意） 「ファイル名」欄をタップしてPDFにカスタムファイル名を付けることができます。 ファイル名を入力しない場合は、iSpeedPix2PDF_DATE_TIME の形式で自動的に名前が付けられます。 3. PDFを表示またはダウンロード - ダウンロードしてファイルを保存します（共有や管理がしやすいようにサイズは小さく設計されています） - アプリ内で直接PDFを表示してすばやく確認できます。 4. PDFを共有 - 保存後、メール、メッセージアプリ、クラウドサービスなど、端末の共有オプションを使ってPDFを共有可能です。 - PDFが保存されると、すでに慣れているツールを使ってスキャンの管理、編集、共有が簡単に行え、書類処理がより速く効率的になります。 これで完了です！iSpeedPix2PDFでコンパクトで扱いやすいPDFを作成、表示、共有できました。
ko: 1. 사진 선택 ‘파일 선택’ 버튼을 눌러 사진 갤러리를 엽니다. - PDF에 포함할 사진을 선택하세요. 여러 장을 한 번에 선택할 수 있습니다. 2. 파일 이름 추가 (선택 사항) - ‘파일 이름’ 필드를 눌러 PDF의 맞춤 이름을 지정할 수 있습니다. - 이름을 지정하지 않으면 자동으로 iSpeedPix2PDF_날짜_시간 형식으로 이름이 지정됩니다. 3. PDF 보기 또는 다운로드 - 다운로드하여 파일을 저장하세요 (파일 크기는 공유와 관리가 용이하도록 작게 설계되었습니다). - 앱 내에서 바로 보기를 할 수도 있습니다. 4. PDF 공유 - 저장 후 이메일, 메시지 앱, 클라우드 서비스 등 원하는 방법으로 PDF를 공유할 수 있습니다. - 저장된 PDF는 이미 익숙한 도구를 사용해 쉽게 관리, 편집, 공유할 수 있어 문서 처리 과정이 더욱 빨라집니다. 이것으로 끝입니다! iSpeedPix2PDF로 간편하고 관리하기 쉬운 PDF를 생성, 보고, 공유하셨습니다.
pt: 1. Selecione Fotos Toque no botão "Escolher Arquivos" para abrir sua galeria de fotos -Selecione as fotos que deseja incluir no seu PDF. Você pode escolher várias imagens ao mesmo tempo 2. Adicione um nome para o arquivo (Opcional) -Você pode dar um nome personalizado ao seu PDF tocando no campo "Nome do arquivo" -Se não fornecer um nome, o app atribuirá automaticamente um no formato iSpeedPix2PDF_DATA_HORA 3. Visualize ou baixe o PDF - Baixe para salvar o arquivo (O arquivo é criado para ser pequeno para facilitar o compartilhamento e gerenciamento) - Visualize diretamente no app para uma rápida verificação 4. Compartilhe o PDF - Após salvar, você pode compartilhar o PDF por e-mail, apps de mensagem, subir para serviços de nuvem ou qualquer outra opção no seu dispositivo - Com o PDF salvo, você pode gerenciar, editar e compartilhar seus documentos de forma prática e rápida Pronto! Você criou, visualizou e compartilhou um PDF compacto e fácil de gerenciar com o iSpeedPix2PDF.
ru: 1. Выберите фотографии Нажмите кнопку «Выбрать файлы», чтобы открыть галерею. - Выберите фотографии для включения в PDF. Можно выбрать несколько одновременно. 2. Добавьте имя файла (необязательно) - Можно указать имя PDF, нажав на поле «Имя файла». - Если имя не указано, будет автоматически назначено в формате iSpeedPix2PDF_ДАТА_ВРЕМЯ. 3. Просмотрите или скачайте PDF - Скачайте файл для сохранения (файл оптимизирован для удобства обмена). - Просмотрите PDF прямо в приложении. 4. Поделитесь PDF - После сохранения вы можете отправить PDF по электронной почте, через мессенджеры, загрузить в облако или любым удобным способом. - Сохраняя PDF, вы легко управляете, редактируете и делитесь документами, используя привычные инструменты, упрощая и ускоряя работу. Вот и всё! Вы создали, просмотрели и поделились компактным и удобным PDF с iSpeedPix2PDF.
th: 1. เลือกรูปภาพ แตะปุ่ม 'เลือกไฟล์' เพื่อเปิดแกลเลอรีรูปภาพ - เลือกรูปภาพที่ต้องการรวมใน PDF - สามารถเลือกหลายรูปได้พร้อมกัน 2. เพิ่มชื่อไฟล์ (ไม่บังคับ) - คุณสามารถตั้งชื่อไฟล์ PDF เองได้โดยแตะช่อง 'ชื่อไฟล์' - หากไม่ระบุชื่อ ระบบจะตั้งชื่อไฟล์อัตโนมัติในรูปแบบ iSpeedPix2PDF_DATE_TIME 3. ดูหรือดาวน์โหลด PDF - ดาวน์โหลดเพื่อบันทึกไฟล์ (ไฟล์ถูกออกแบบให้ขนาดเล็กเพื่อการแชร์และจัดการที่ง่าย) - ดูไฟล์ในแอปได้เลยเพื่อความรวดเร็ว 4. แชร์ PDF - หลังบันทึก สามารถแชร์ PDF ผ่านอีเมล แอปส่งข้อความ หรืออัปโหลดไปยังคลาวด์ได้ - ด้วยไฟล์ PDF ที่บันทึกไว้ คุณสามารถจัดการ แก้ไข และแชร์ไฟล์ได้อย่างง่ายดาย ด้วยเครื่องมือที่คุณคุ้นเคย ช่วยให้งานของคุณรวดเร็วและมีประสิทธิภาพมากขึ้น แค่นี้เอง! คุณได้สร้าง ดู และแชร์ PDF ขนาดกะทัดรัดที่จัดการง่ายด้วย iSpeedPix2PDF
zh: 1. 选择图片 点击“选择文件”按钮打开照片库 - 选择您想要转换成PDF的照片，可以一次选择多张 2. 添加文件名（可选） - 点击“文件名”字段为您的PDF添加自定义文件名 - 如果不填写，应用将自动生成文件名，格式为 iSpeedPix2PDF_日期_时间 3. 查看或下载PDF - 点击下载按钮保存文件（文件大小适中，方便分享和管理） - 可在应用内直接查看PDF，快速预览 4. 分享PDF - 保存后可通过邮件、聊天应用、云服务等方式分享PDF - 方便管理、编辑和分享，提升文件处理效率 就是这么简单！您已经成功使用iSpeedPix2PDF创建、查看和分享了一个紧凑易管理的PDF文件。

source: Main Menu
ar: القائمة الرئيسية
de: Hauptmenü
es: Menú principal
fr: Menu principal
he: תפריט ראשי
hi: मुख्य मेनू
it: Menu principale
ja: メインメニュー
ko: 메인 메뉴
pt: Menu Principal
ru: Главное меню
th: เมนูหลัก
zh: 主菜单
