Repository: WaseemMirzaa/ispeedpix2pdf7
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, he, hi, it, ja, ko, pt, ru, th, zh

# simplicityAndPrivacyDetail
source: Our Philosophy -Simplicity: Our apps are designed to be intuitive and straightforward, making them easy to use for everyone. -Security: By keeping all processing on the client side, we ensure your data remains private and secure. -Efficiency: We continually refine our apps to remove unnecessary steps while preserving their core functionality.
ar: فلسفتنا - البساطة: تم تصميم تطبيقاتنا لتكون بديهية ومباشرة، مما يجعلها سهلة الاستخدام للجميع. - الأمان: من خلال إبقاء جميع العمليات على جانب العميل، فإننا نضمن أن تظل بياناتك خاصة وآمنة. - الكفاءة: نعمل باستمرار على تحسين تطبيقاتنا لإزالة الخطوات غير الضرورية مع الحفاظ على وظائفها الأساسية.
de: Unsere Philosophie -Einfachheit: Unsere Apps sind so gestaltet, dass sie intuitiv und unkompliziert sind – für jeden leicht zu bedienen. -Sicherheit: Durch die vollständige Verarbeitung auf der Client-Seite stellen wir sicher, dass Ihre Daten privat und sicher bleiben. -Effizienz: Wir optimieren unsere Apps kontinuierlich, um unnötige Schritte zu entfernen und gleichzeitig ihre Kernfunktionen zu erhalten.
es: Nuestra filosofía -Simplicidad: Nuestras aplicaciones están diseñadas para ser intuitivas y sencillas, lo que las hace fáciles de usar para todos. -Seguridad: Al mantener todo el procesamiento en el lado del cliente, garantizamos que tus datos permanezcan privados y seguros. -Eficiencia: Refinamos continuamente nuestras aplicaciones para eliminar pasos innecesarios mientras preservamos su funcionalidad esencial.
fr: Notre philosophie - Simplicité : Nos applications sont conçues pour être intuitives et simples, ce qui les rend faciles à utiliser pour tout le monde. - Sécurité : En gardant tout le traitement côté client, nous garantissons que vos données restent privées et sécurisées. - Efficacité : Nous améliorons continuellement nos applications pour éliminer les étapes inutiles tout en préservant leur fonctionnalité essentielle.
he: הפילוסופיה שלנו -פשטות: האפליקציות שלנו נבנו בצורה אינטואיטיבית ופשוטה לשימוש לכולם. -אבטחה: על ידי שמירת כל העיבוד בצד המשתמש, אנו מבטיחים שהנתונים שלך נשארים פרטיים ומאובטחים. -יעילות: אנו ממשיכים לייעל את האפליקציות שלנו על ידי הסרת שלבים מיותרים תוך שמירה על הפונקציונליות העיקרית.
hi: हमारा दर्शन -सरलता: हमारे ऐप्स सहज और आसान उपयोग के लिए डिज़ाइन किए गए हैं। -सुरक्षा: सभी प्रोसेसिंग क्लाइंट साइड होती है, जिससे आपका डेटा सुरक्षित रहता है। -दक्षता: हम अनावश्यक कदम हटाकर ऐप को और बेहतर बनाते हैं।
it: La nostra filosofia - Semplicità: Le nostre app sono progettate per essere intuitive e semplici, rendendole facili da usare per tutti. - Sicurezza: Mantenendo tutta l'elaborazione sul lato client, garantiamo che i tuoi dati rimangano privati e sicuri. - Efficienza: Miglioriamo continuamente le nostre app per eliminare i passaggi non necessari, preservandone al contempo le funzionalità principali.
ja: 私たちの理念 - シンプルさ：私たちのアプリは直感的でわかりやすく、誰でも簡単に使えるよう設計されています。 - セキュリティ：すべての処理をクライアント側で行うため、お客様のデータは安全でプライベートに保たれます。 - 効率性：無駄なステップを省きつつ、主要な機能は損なわず、常に改善を続けています。
ko: 우리의 철학 - 간편함: 모든 앱은 직관적이고 쉽게 사용할 수 있도록 설계되었습니다. - 보안: 모든 처리는 클라이언트 측에서 이루어져 데이터가 안전하게 보호됩니다. - 효율성: 불필요한 단계를 제거하고 핵심 기능을 유지하도록 지속적으로 앱을 개선합니다.
pt: Nossa Filosofia -Simplicidade: Nossos apps são projetados para serem intuitivos e fáceis de usar para todos. -Segurança: Mantendo todo o processamento no dispositivo, garantimos que seus dados permaneçam privados e seguros. -Eficiência: Refinamos continuamente nossos apps para eliminar passos desnecessários sem perder a funcionalidade essencial.
ru: Наша философия - Простота: наши приложения интуитивны и понятны для всех. - Безопасность: все данные обрабатываются на устройстве, что гарантирует конфиденциальность. - Эффективность: мы постоянно оптимизируем приложения, убирая лишние шаги без потери функционала.
th: ปรัชญาของเรา - ความเรียบง่าย: แอปของเราออกแบบให้ใช้งานง่ายและเข้าใจง่ายสำหรับทุกคน - ความปลอดภัย: ด้วยการประมวลผลทั้งหมดบนอุปกรณ์ของผู้ใช้ เรารักษาความเป็นส่วนตัวและความปลอดภัยของข้อมูล - ประสิทธิภาพ: เราพัฒนาแอปอย่างต่อเนื่องเพื่อลดขั้นตอนที่ไม่จำเป็นในขณะที่ยังคงฟังก์ชันหลักไว้
zh: 我们的理念 - 简洁：我们的应用设计直观易用，适合所有人。 - 安全：所有处理均在客户端进行，确保数据隐私和安全。 - 高效：不断优化应用，去除多余步骤，保持核心功能完整。

# simplicityAndPrivacyDetailTwo
source: We believe in providing just what you need, nothing more, nothing less. As we evolve, our commitment remains to enhance efficiency without compromising on the primary purpose of our applications.
ar: نؤمن بتوفير ما تحتاجه تمامًا، لا أكثر ولا أقل. ومع تطورنا، يبقى التزامنا بتعزيز الكفاءة دون المساس بالهدف الأساسي لتطبيقاتنا.
de: Wir glauben daran, genau das bereitzustellen, was Sie brauchen – nicht mehr und nicht weniger. Auch wenn wir uns weiterentwickeln, bleibt unser Engagement bestehen, die Effizienz zu verbessern, ohne den Hauptzweck unserer Anwendungen zu beeinträchtigen.
es: Creemos en ofrecer solo lo que necesitas, ni más ni menos. A medida que evolucionamos, nuestro compromiso sigue siendo mejorar la eficiencia sin comprometer el propósito principal de nuestras aplicaciones.
fr: Nous croyons en l'idée de fournir exactement ce dont vous avez besoin, rien de plus, rien de moins. À mesure que nous évoluons, notre engagement reste le même : améliorer l'efficacité sans compromettre l'objectif principal de nos applications.
he: אנו מאמינים בלספק בדיוק את מה שאתה צריך, לא יותר ולא פחות. במהלך ההתפתחות שלנו, המחויבות שלנו נותרת לשפר יעילות מבלי לפגוע בתכלית העיקרית של האפליקציה.
hi: हम केवल उतना ही प्रदान करते हैं जितना आवश्यक है। हमारा लक्ष्य दक्षता बढ़ाना है बिना ऐप के उद्देश्य को कम किए।
it: Crediamo nel fornire esattamente ciò di cui hai bisogno, né più né meno. Man mano che evolviamo, il nostro impegno rimane quello di migliorare l'efficienza senza compromettere lo scopo principale delle nostre applicazioni.
ja: 必要なものだけを提供し、それ以上でもそれ以下でもありません。進化し続ける中で、アプリの目的を損なうことなく効率性を高めることにコミットしています。
ko: 필요한 것만, 딱 맞게 제공합니다. 앞으로도 주요 기능을 해치지 않으면서 효율성을 높이는 데 최선을 다할 것입니다.
pt: Acreditamos em oferecer apenas o que você precisa, nada mais, nada menos. Conforme evoluímos, nosso compromisso é melhorar a eficiência sem comprometer o propósito principal dos nossos aplicativos.
ru: Мы предоставляем ровно то, что нужно — ничего лишнего. По мере развития приложений мы сохраняем приверженность эффективности без ущерба основным задачам.
th: เราเชื่อในการให้สิ่งที่คุณต้องการเท่านั้น ไม่มากเกินไปและไม่น้อยเกินไป ในการพัฒนา เรามุ่งเน้นที่การเพิ่มประสิทธิภาพโดยไม่ลดทอนวัตถุประสงค์หลักของแอป
zh: 我们致力于提供您所需的核心功能，绝不多余。随着发展，我们持续提升效率，确保应用主要功能不受影响。

# simplicityAndPrivacyDetailThree
source: Explore our range of client-side apps and experience the difference simplicity, efficiency, and security can make in your daily tasks.
ar: استكشف مجموعتنا من تطبيقات جانب العميل وجرب الفرق الذي يمكن أن يحدثه البساطة والكفاءة والأمان في مهامك اليومية.
de: Entdecken Sie unsere Auswahl an clientseitigen Apps und erleben Sie, welchen Unterschied Einfachheit, Effizienz und Sicherheit in Ihren täglichen Aufgaben machen können.
es: Explora nuestra gama de aplicaciones del lado del cliente y experimenta la diferencia que la simplicidad, la eficiencia y la seguridad pueden hacer en tus tareas diarias.
fr: Découvrez notre gamme d'applications côté client et découvrez la différence que la simplicité, l'efficacité et la sécurité peuvent apporter à vos tâches quotidiennes.
he: גלה את מגוון האפליקציות המקומיות שלנו ותחווה את ההבדל שפשטות, יעילות ואבטחה יכולים לעשות במשימות היומיומיות שלך.
hi: हमारे क्लाइंट-साइड ऐप्स का उपयोग करें और सरलता, दक्षता, और सुरक्षा का फर्क महसूस करें।
it: Esplora la nostra gamma di app lato client e scopri la differenza che semplicità, efficienza e sicurezza possono fare nelle tue attività quotidiane.
ja: クライアント側アプリのラインナップをぜひご覧ください。シンプルさ、効率性、セキュリティが日々の作業にどれほどの違いをもたらすか体験してみてください。
ko: 저희 클라이언트 사이드 앱을 탐색하시고, 단순함, 효율성, 그리고 보안이 일상 업무에 가져다주는 차이를 경험해보세요.
pt: Explore nossa linha de apps que funcionam no lado cliente e experimente a diferença que simplicidade, eficiência e segurança podem fazer nas suas tarefas diárias.
ru: Ознакомьтесь с нашими клиентскими приложениями и почувствуйте разницу, которую приносит простота, эффективность и безопасность в повседневных задачах.
th: ลองใช้แอปบนอุปกรณ์ของเราหลากหลายและสัมผัสความแตกต่างของความเรียบง่าย ประสิทธิภาพ และความปลอดภัยในงานประจำวันของคุณ
zh: 探索我们的客户端应用，体验简洁、高效和安全带来的日常工作改变。

# privacyAndSecurityDetailTitle
source: Welcome to iSpeedPix2PDF. We are committed to protecting your privacy and ensuring the security of your personal information. This Privacy Policy outlines how we collect, use, and safeguard your data when you use the iSpeedPix2PDF app on mobile devices.
ar: مرحبًا بكم في iSpeedPix2PDF. نحن ملتزمون بحماية خصوصيتكم وضمان أمان معلوماتكم الشخصية. توضح سياسة الخصوصية هذه كيفية جمع بياناتكم واستخدامها وحمايتها عند استخدامكم تطبيق iSpeedPix2PDF على الأجهزة المحمولة.
de: Willkommen bei iSpeedPix2PDF. Wir verpflichten uns, Ihre Privatsphäre zu schützen und die Sicherheit Ihrer persönlichen Daten zu gewährleisten. Diese Datenschutzrichtlinie beschreibt, wie wir Ihre Daten erfassen, verwenden und schützen, wenn Sie die iSpeedPix2PDF-App auf mobilen Geräten nutzen.
es: Bienvenido a iSpeedPix2PDF. Estamos comprometidos con proteger tu privacidad y garantizar la seguridad de tu información personal. Esta Política de Privacidad describe cómo recopilamos, usamos y protegemos tus datos cuando utilizas la aplicación iSpeedPix2PDF en dispositivos móviles.
fr: Bienvenue sur iSpeedPix2PDF. Nous nous engageons à protéger votre vie privée et à garantir la sécurité de vos informations personnelles. Cette politique de confidentialité décrit comment nous collectons, utilisons et protégeons vos données lorsque vous utilisez l'application iSpeedPix2PDF sur des appareils mobiles.
he: ברוכים הבאים ל-iSpeedPix2PDF. אנו מחויבים לשמור על פרטיותך ולהבטיח את אבטחת המידע האישי שלך. מדיניות פרטיות זו מפרטת כיצד אנו אוספים, משתמשים ומגנים על הנתונים שלך בעת השימוש באפליקציית iSpeedPix2PDF במכשירים ניידים.
hi: iSpeedPix2PDF में आपका स्वागत है। हम आपकी गोपनीयता की रक्षा और आपके व्यक्तिगत जानकारी की सुरक्षा के लिए प्रतिबद्ध हैं। यह गोपनीयता नीति बताती है कि हम आपका डेटा कैसे एकत्र, उपयोग और सुरक्षित रखते हैं।
it: Benvenuto in iSpeedPix2PDF. Ci impegniamo a proteggere la tua privacy e a garantire la sicurezza delle tue informazioni personali. Questa Informativa sulla Privacy descrive come raccogliamo, utilizziamo e proteggiamo i tuoi dati quando usi l'app iSpeedPix2PDF sui dispositivi mobili.
ja: iSpeedPix2PDFへようこそ。私たちはお客様のプライバシー保護と個人情報の安全を最優先に考えています。本プライバシーポリシーは、モバイルデバイス上でiSpeedPix2PDFを利用する際のデータ収集、使用、保護について説明します。
ko: iSpeedPix2PDF에 오신 것을 환영합니다. 저희는 여러분의 개인정보 보호와 보안 유지에 최선을 다하고 있습니다. 본 개인정보처리방침은 모바일 기기에서 iSpeedPix2PDF 앱을 사용할 때 데이터를 어떻게 수집, 사용, 보호하는지에 대해 안내합니다.
pt: Bem-vindo ao iSpeedPix2PDF. Estamos comprometidos em proteger sua privacidade e garantir a segurança das suas informações pessoais. Esta Política de Privacidade explica como coletamos, usamos e protegemos seus dados ao usar o app iSpeedPix2PDF em dispositivos móveis.
ru: Добро пожаловать в iSpeedPix2PDF. Мы заботимся о вашей конфиденциальности и безопасности персональных данных. В этой политике конфиденциальности описано, как мы собираем, используем и защищаем ваши данные при использовании приложения iSpeedPix2PDF на мобильных устройствах.
th: ยินดีต้อนรับสู่ iSpeedPix2PDF เรามุ่งมั่นในการปกป้องความเป็นส่วนตัวและความปลอดภัยของข้อมูลส่วนบุคคลของคุณ นโยบายความเป็นส่วนตัวนี้อธิบายถึงวิธีที่เรารวบรวม ใช้ และปกป้องข้อมูลของคุณเมื่อใช้แอป iSpeedPix2PDF บนอุปกรณ์เคลื่อนที่
zh: 欢迎使用iSpeedPix2PDF。我们致力于保护您的隐私和个人信息安全。此隐私政策说明我们如何收集、使用和保护您在移动设备上使用iSpeedPix2PDF时的数据。

# privacyAndSecurityDetailOne
source: 1. Information Collection and Use - iSpeedPix2PDF is a client-side app; all data processed by the app remains local to your device, with no data sent to external servers for processing. -Photo Gallery Access: iSpeedPix2PDF requires access to your device’s photo gallery to allow you to select images for conversion into PDFs. -Once a PDF is generated, the app does not store or retain any files. Users have full control over their PDFs and can choose to share, email, save, or upload them as they prefer.
ar: ١. جمع المعلومات واستخدامها - iSpeedPix2PDF تطبيق يعمل على جهاز العميل؛ جميع البيانات التي يعالجها التطبيق تبقى محلية على جهازك، دون إرسال أي بيانات إلى خوادم خارجية للمعالجة. - الوصول إلى معرض الصور: يتطلب iSpeedPix2PDF الوصول إلى معرض الصور على جهازك ليسمح لك باختيار الصور لتحويلها إلى ملفات PDF. - بمجرد إنشاء ملف PDF، لا يخزن التطبيق أي ملفات أو يحتفظ بها. يتمتع المستخدمون بالتحكم الكامل في ملفات PDF الخاصة بهم، ويمكنهم اختيار مشاركتها، أو إرسالها عبر البريد الإلكتروني، أو حفظها، أو تحميلها كما يحلو لهم.
de: 1. Erfassung und Verwendung von Informationen - SpeedPix2PDF ist eine clientseitige App; alle von der App verarbeiteten Daten bleiben lokal auf Ihrem Gerät, ohne dass Daten zur Verarbeitung an externe Server gesendet werden. Zugriff auf die Fotogalerie: iSpeedPix2PDF benötigt Zugriff auf die Fotogalerie Ihres Geräts, damit Sie Bilder zur Umwandlung in PDFs auswählen können. Sobald ein PDF erstellt wurde, speichert oder behält die App keine Dateien. Die Nutzer haben die volle Kontrolle über ihre PDFs und können selbst entscheiden, ob sie diese teilen, per E-Mail versenden, speichern oder hochladen möchten.
es: 1. Recopilación y uso de información - iSpeedPix2PDF es una aplicación del lado del cliente; todos los datos procesados por la aplicación permanecen localmente en tu dispositivo, sin que se envíen datos a servidores externos para su procesamiento. -Acceso a la galería de fotos: iSpeedPix2PDF requiere acceso a la galería de fotos de tu dispositivo para permitirte seleccionar imágenes y convertirlas en archivos PDF. -Una vez generado un PDF, la aplicación no almacena ni conserva ningún archivo. Los usuarios tienen control total sobre sus archivos PDF y pueden optar por compartirlos, enviarlos por correo electrónico, guardarlos o subirlos según prefieran.
fr: 1. Collecte et utilisation des informations - iSpeedPix2PDF est une application côté client ; toutes les données traitées par l'application restent localement sur votre appareil, sans qu'aucune donnée ne soit envoyée à des serveurs externes pour traitement. - Accès à la galerie de photos : iSpeedPix2PDF nécessite l'accès à la galerie de photos de votre appareil pour vous permettre de sélectionner des images à convertir en PDF. - Une fois le PDF généré, l'application ne stocke ni ne conserve aucun fichier. Les utilisateurs ont un contrôle total sur leurs PDF et peuvent choisir de les partager, les envoyer par e-mail, les enregistrer ou les téléverser selon leurs préférences.
he: 1. איסוף מידע ושימוש - iSpeedPix2PDF היא אפליקציה בצד הלקוח; כל הנתונים המעובדים נשארים מקומית במכשירך, ללא שליחה לשרתים חיצוניים לעיבוד. -גישה לגלריית התמונות: iSpeedPix2PDF דורשת גישה לגלריית התמונות שלך כדי לאפשר בחירת תמונות להמרה ל-PDF. -לאחר יצירת ה-PDF, האפליקציה לא שומרת או שומרת קבצים. למשתמש שליטה מלאה בקבצי ה-PDF ויכול לבחור לשתף, לשלוח במייל, לשמור או להעלות אותם.
hi: 1. सूचना संग्रह और उपयोग - iSpeedPix2PDF एक क्लाइंट-साइड ऐप है; ऐप द्वारा प्रोसेस किया गया सारा डेटा आपके डिवाइस पर ही रहता है। -फोटो गैलरी एक्सेस: iSpeedPix2PDF को आपकी डिवाइस की फोटो गैलरी तक पहुंच चाहिए ताकि आप छवियाँ चुन सकें। -PDF बनने के बाद, ऐप कोई फाइल संग्रहित नहीं करता। उपयोगकर्ता PDF पर पूर्ण नियंत्रण रखते हैं।
it: 1. Raccolta e utilizzo delle informazioni - iSpeedPix2PDF è un'app lato client; tutti i dati elaborati dall'app rimangono sul tuo dispositivo, senza che nessun dato venga inviato a server esterni per l'elaborazione. - Accesso alla galleria fotografica: iSpeedPix2PDF richiede l'accesso alla galleria fotografica del tuo dispositivo per permetterti di selezionare le immagini da convertire in PDF. - Una volta generato un PDF, l'app non memorizza né conserva alcun file. Gli utenti hanno il pieno controllo dei loro PDF e possono scegliere di condividerli, inviarli via email, salvarli o caricarli come preferiscono.
ja: 1. 情報の収集と利用 - iSpeedPix2PDFはクライアント側アプリであり、アプリによるすべてのデータ処理は端末内で完結し、外部サーバーへ送信されません。 - 写真ギャラリーへのアクセス：PDFに変換する画像を選択するために端末の写真ギャラリーへのアクセス権を必要とします。 - PDF生成後はファイルを保存・保持しません。ユーザーはPDFの共有、メール送信、保存、アップロードを自由に行えます。
ko: 1. 정보 수집 및 이용 - iSpeedPix2PDF는 클라이언트 사이드 앱으로, 앱에서 처리되는 모든 데이터는 기기 내에만 저장되며 외부 서버로 전송되지 않습니다. - 사진 갤러리 접근: PDF 변환을 위해 이미지 선택 시, iSpeedPix2PDF는 기기의 사진 갤러리에 접근할 권한이 필요합니다. - PDF가 생성된 후, 앱은 파일을 저장하거나 보관하지 않습니다. 사용자는 PDF를 자유롭게 공유, 이메일 전송, 저장 또는 업로드할 수 있습니다.
pt: 1. Coleta e Uso de Informações - O iSpeedPix2PDF é um app cliente; todos os dados processados permanecem localmente no seu dispositivo, sem envio para servidores externos. -Acesso à Galeria de Fotos: O iSpeedPix2PDF precisa acessar sua galeria para permitir selecionar imagens para converter em PDFs. -Depois que um PDF é gerado, o app não armazena ou retém arquivos. Os usuários têm controle total sobre seus PDFs e podem optar por compartilhar, enviar por email, salvar ou subir onde quiserem.
ru: 1. Сбор и использование информации – iSpeedPix2PDF — это клиентское приложение, все данные обрабатываются локально и не передаются на внешние серверы. - Доступ к галерее: приложение запрашивает доступ к вашей галерее для выбора изображений для конвертации в PDF. - После создания PDF приложение не хранит файлы. Пользователь полностью контролирует созданные документы и может их сохранять, делиться или удалять.
th: 1. การเก็บรวบรวมและการใช้ข้อมูล - iSpeedPix2PDF เป็นแอปที่ประมวลผลข้อมูลบนอุปกรณ์ของผู้ใช้เท่านั้น ไม่มีข้อมูลถูกส่งไปยังเซิร์ฟเวอร์ภายนอก - การเข้าถึงแกลเลอรีรูปภาพ: แอปต้องการเข้าถึงแกลเลอรีเพื่อให้คุณเลือกภาพสำหรับแปลงเป็น PDF - หลังจากสร้าง PDF แล้ว แอปจะไม่เก็บไฟล์ไว้ ผู้ใช้สามารถจัดการ แชร์ หรือบันทึกไฟล์ตามต้องการ
zh: 1. 信息收集与使用 - iSpeedPix2PDF是客户端应用，所有数据均在设备本地处理，无数据发送到外部服务器。 - 访问照片库：应用需要访问您的设备照片库，以选择要转换为PDF的图片。 - 生成PDF后，应用不保存或保留任何文件。用户可自由管理、分享、保存或上传PDF。

# privacyAndSecurityDetailTwo
source: 2. No Data Transmission - As a client-side app, iSpeedPix2PDF ensures that none of your data, including personal information or generated PDFs, is transmitted to external servers or third-party services. Every step of the process—from selecting images to generating PDFs—happens entirely on your device, guaranteeing the highest level of privacy and security.
ar: ٢. عدم نقل البيانات - كتطبيق من جهة العميل، يضمن iSpeedPix2PDF عدم نقل أيٍّ من بياناتك، بما في ذلك معلوماتك الشخصية أو ملفات PDF المُنشأة، إلى خوادم خارجية أو خدمات خارجية. تتم كل خطوة من العملية - من اختيار الصور إلى إنشاء ملفات PDF - بالكامل على جهازك، مما يضمن أعلى مستوى من الخصوصية والأمان.
de: 2. Keine Datenübertragung - Als clientseitige App stellt iSpeedPix2PDF sicher, dass keine Ihrer Daten, einschließlich persönlicher Informationen oder erstellter PDFs, an externe Server oder Dritte übertragen wird. Jeder Schritt des Prozesses – vom Auswählen der Bilder bis hin zur Erstellung der PDFs – erfolgt vollständig auf Ihrem Gerät, wodurch das höchste Maß an Privatsphäre und Sicherheit gewährleistet wird.
es: 2. Sin transmisión de datos - Como aplicación del lado del cliente, iSpeedPix2PDF garantiza que ninguno de tus datos, incluyendo información personal o archivos PDF generados, se transmite a servidores externos ni a servicios de terceros. Cada paso del proceso —desde la selección de imágenes hasta la generación de PDFs— ocurre completamente en tu dispositivo, garantizando el máximo nivel de privacidad y seguridad.
fr: 2. Aucune transmission de données - En tant qu'application côté client, iSpeedPix2PDF garantit qu'aucune de vos données, y compris les informations personnelles ou les PDF générés, n'est transmise à des serveurs externes ou à des services tiers. Chaque étape du processus — de la sélection des images à la génération des PDF — se déroule entièrement sur votre appareil, garantissant le plus haut niveau de confidentialité et de sécurité.
he: 2. ללא העברת נתונים - כאפליקציה בצד הלקוח, iSpeedPix2PDF מבטיחה שאף אחד מהנתונים שלך, כולל מידע אישי או קובצי PDF שנוצרו, לא מועבר לשרתים חיצוניים או שירותי צד שלישי. כל התהליך—from בחירת תמונות ליצירת PDF—מתבצע כולו במכשירך, ומבטיח את רמת הפרטיות והאבטחה הגבוהה ביותר.
hi: 2. कोई डेटा ट्रांसमिशन नहीं - यह ऐप आपके डेटा को बाहरी सर्वर या थर्ड पार्टी को भेजता नहीं है। पूरा प्रोसेस आपके डिवाइस पर होता है, जो आपकी गोपनीयता और सुरक्षा सुनिश्चित करता है।
it: 2. Nessuna trasmissione di dati - Come app lato client, iSpeedPix2PDF garantisce che nessuno dei tuoi dati, incluse informazioni personali o PDF generati, venga trasmesso a server esterni o servizi di terze parti. Ogni fase del processo – dalla selezione delle immagini alla generazione dei PDF – avviene interamente sul tuo dispositivo, garantendo il massimo livello di privacy e sicurezza.
ja: 2. データ送信なし - クライアント側アプリとして、個人情報や生成されたPDFなどのいかなるデータも外部サーバーや第三者サービスへ送信しません。画像選択からPDF生成まで全て端末内で行われ、最高レベルのプライバシーとセキュリティを保証します。
ko: 2. 데이터 전송 없음 - 클라이언트 사이드 앱으로서 iSpeedPix2PDF는 개인 정보나 생성된 PDF를 포함한 어떠한 데이터도 외부 서버나 제3자 서비스로 전송하지 않음을 보장합니다. 이미지 선택부터 PDF 생성까지 모든 과정이 기기 내에서 완료되어 최고 수준의 프라이버시와 보안을 제공합니다.
pt: 2. Nenhuma Transmissão de Dados - Como app cliente, o iSpeedPix2PDF garante que nenhum dado, incluindo informações pessoais ou PDFs gerados, seja transmitido para servidores externos ou terceiros. Todo o processo, desde a seleção das imagens até a geração do PDF, acontece no seu dispositivo, garantindo o máximo de privacidade e segurança.
ru: 2. Отсутствие передачи данных – iSpeedPix2PDF гарантирует, что никакие данные, включая персональную информацию или созданные PDF, не отправляются на внешние серверы или третьи сервисы. Все процессы выполняются на устройстве, обеспечивая максимальную конфиденциальность и безопасность.
th: 2. ไม่มีการส่งข้อมูล - เนื่องจากเป็นแอปที่ประมวลผลข้อมูลทั้งหมดบนอุปกรณ์ ไม่มีข้อมูลส่วนบุคคลหรือ PDF ที่สร้างขึ้นถูกส่งไปยังเซิร์ฟเวอร์หรือบริการของบุคคลที่สาม ทุกขั้นตอนเกิดขึ้นบนอุปกรณ์ของคุณ เพื่อความเป็นส่วนตัวและความปลอดภัยสูงสุด
zh: 2. 无数据传输 - 作为客户端应用，iSpeedPix2PDF确保所有数据（包括个人信息及生成的PDF）均不传输到外部服务器或第三方服务。所有步骤均在设备上完成，保障最高隐私和安全。
