Repository: WaseemMirzaa/ispeedpix2pdf7
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, he, hi, it, ja, ko, pt, ru, th, zh

# rest
source: Reset
he: איפוס

source: DEFAULT - Mixed Orientation
ar: افتراضيًا - اتجاه مختلط
de: STANDARD – Gemischte Ausrichtung
es: PREDETERMINADO - Orientación mixta
fr: PAR DÉFAUT - Orientation mixte
he: ברירת מחדל - תצוגה מעורבת
hi: डिफ़ॉल्ट - मिश्रित अभिविन्यास
it: PREDEFINITO - Orientamento misto
ja: デフォルト - 混合向き
ko: 기본 - 혼합 방향
pt: PADRÃO - Orientação Mista
ru: ПО УМОЛЧАНИЮ – СМЕШАННАЯ ОРИЕНТАЦИЯ
th: ค่าเริ่มต้น - การวางแนวผสม
zh: 默认 - 混合方向

source: Pages Fixed - Portrait
ar: الصفحات الثابتة - عمودي
de: Seiten fixiert - Hochformat
es: Páginas fijas - Retrato
fr: Pages fixes - Portrait
he: עמודים קבועים - לאורך
hi: पृष्ठ स्थिर - पोर्ट्रेट
it: Pagine fisse - Verticale
ja: ページ固定 - 縦向き
ko: 페이지 고정 - 세로 방향
pt: Páginas Fixas - Retrato
ru: Страницы зафиксированы – портрет
th: หน้าคงที่ - แนวตั้ง
zh: 页面固定 - 竖屏

# landscapePhotosTopAlignedForEasyViewing
source: Landsape Photos - Top Aligned for easy viewing
ar: صور المناظر الطبيعية - محاذاة الجزء العلوي لسهولة المشاهدة
de: Landschaftsfotos – Oben ausgerichtet für einfaches Betrachten
es: Fotos de paisajes - Alineadas en la parte superior para una fácil visualización
fr: Photos de paysage - Alignées en haut pour une visualisation facile
he: תמונות לרוחב - מיושרות למעלה לצפייה נוחה
hi: लैंडस्केप फ़ोटो - आसान देखने के लिए शीर्ष संरेखित
it: Foto orizzontali - Allineate in alto per una visualizzazione facilitata
ja: 横向き写真 - 上揃えで見やすく
ko: 가로 사진 - 상단 정렬로 쉽게 보기
pt: Fotos em Paisagem - Alinhadas no Topo para fácil visualização
ru: Фото в ландшафтной ориентации – выровнены сверху для удобного просмотра
th: รูปภาพแนวนอน - จัดชิดด้านบนเพื่อความสะดวกในการดู
zh: 横向照片 - 顶部对齐便于查看

source: Reset
ar: إعادة ضبط
de: Zurücksetzen
es: Reiniciar
fr: Réinitialiser
he: איפוס
hi: रीसेट
ja: リセット
ko: 초기화
pt: Redefinir
ru: Сбросить
th: รีเซ็ต
zh: 重置

source: Choose Files
ar: اختر الملفات
de: Wählen Sie Dateien
es: Elija archivos
fr: Choisir les fichiers
he: בחר קבצים
hi: फ़ाइलें चुनें
it: Scegli i file
ja: ファイルを選択
ko: 파일 선택
pt: Escolher Arquivos
ru: Выбрать файлы
th: เลือกไฟล์
zh: 选择文件

source: No Files Selected
ar: لم يتم تحديد ملفات
de: Keine Dateien ausgewählt
es: No hay archivos seleccionados
fr: Aucun fichier sélectionné
he: לא נבחרו קבצים
hi: कोई फ़ाइल चयनित नहीं
it: Nessun file selezionato
ja: ファイルが選択されていません
ko: 선택된 파일이 없습니다
pt: Nenhum Arquivo Selecionado
ru: Файлы не выбраны
th: ยังไม่ได้เลือกไฟล์
zh: 未选择文件

source: *You can select up to 3 Images in free version
ar: *يمكنك تحديد ما يصل إلى 3 صور في إصدار مجاني
de: *Sie können bis zu 3 Bilder in der kostenlosen Version auswählen
es: *Puede seleccionar hasta 3 imágenes en la versión gratuita
fr: * Vous pouvez sélectionner jusqu'à 3 images en version gratuite
he: *ניתן לבחור עד 3 תמונות בגרסה החינמית
hi: *फ्री संस्करण में आप अधिकतम 3 छवियाँ चुन सकते हैं
it: *Puoi selezionare fino a 3 immagini in versione gratuita
ja: *無料版では最大3枚の画像を選択可能
ko: *무료 버전에서는 최대 3장까지 선택할 수 있습니다
pt: *Você pode selecionar até 3 imagens na versão gratuita
ru: *В бесплатной версии можно выбрать до 3 изображений
th: *คุณสามารถเลือกได้สูงสุด 3 รูปในเวอร์ชันฟรี
zh: *免费版最多可选择3张图片

source: *You can select up to 60 Images
ar: *يمكنك تحديد ما يصل إلى 60 صورة
de: *Sie können bis zu 60 Bilder auswählen
es: *Puede seleccionar hasta 60 imágenes
fr: * Vous pouvez sélectionner jusqu'à 60 images
he: *ניתן לבחור עד 60 תמונות
hi: *आप अधिकतम 60 छवियाँ चुन सकते हैं
it: *Puoi selezionare fino a 60 immagini
ja: *最大60枚の画像を選択可能
ko: *최대 60장까지 선택할 수 있습니다
pt: *Você pode selecionar até 60 imagens
ru: *Можно выбрать до 60 изображений
th: *คุณสามารถเลือกได้สูงสุด 60 รูป
zh: *最多可选择60张图片

source: Filename
ar: اسم الملف
de: Dateiname
es: Nombre del archivo
fr: Nom de fichier
he: שם קובץ
hi: फ़ाइल नाम
it: Nome file
ja: ファイル名
ko: 파일 이름
pt: Nome do arquivo
ru: Имя файла
th: ชื่อไฟล์
zh: 文件名

source: Filename (Optional)
ar: اسم الملف (اختياري)
de: Dateiname (optional)
es: Nombre de archivo (opcional)
fr: Nom de fichier (facultatif)
he: שם קובץ (אופציונלי)
hi: फ़ाइल नाम (वैकल्पिक)
it: Nome file (opzionale)
ja: ファイル名（任意）
ko: 파일 이름 (선택 사항)
pt: Nome do arquivo (Opcional)
ru: Имя файла (необязательно)
th: ชื่อไฟล์ (ไม่บังคับ)
zh: 文件名（可选）

source: Enter custom file name (optional)
ar: أدخل اسم الملف المخصص (اختياري)
de: Geben Sie den benutzerdefinierten Dateinamen ein (optional)
es: Ingrese el nombre de archivo personalizado (opcional)
fr: Entrez le nom du fichier personnalisé (facultatif)
he: הזן שם קובץ מותאם אישית (אופציונלי)
hi: कस्टम फ़ाइल नाम दर्ज करें (वैकल्पिक)
it: Immettere il nome del file personalizzato (facoltativo)
ja: カスタムファイル名を入力（任意）
ko: 맞춤 파일 이름 입력 (선택 사항)
pt: Digite um nome de arquivo personalizado (opcional)
ru: Введите имя файла (необязательно)
th: ใส่ชื่อไฟล์เอง (ไม่บังคับ)
zh: 输入自定义文件名（可选）

# filenameCannotContainCharacters
source: Filename cannot contain any of the following characters: \ /: * ? " < > |
ar: لا يمكن أن يحتوي اسم الملف على أي من الأحرف التالية: \ /: *؟ < > |
de: Dateiname kann keine der folgenden Zeichen enthalten: \ /: *? < > |
es: El nombre de archivo no puede contener ninguno de los siguientes caracteres: \ /: *? < > |
fr: Le nom de fichier ne peut contenir aucun des caractères suivants: \ /: *? < > |
he: שם הקובץ לא יכול להכיל את התווים הבאים: \ /: * ? " < > |
hi: फ़ाइल नाम में निम्नलिखित वर्ण नहीं हो सकते: \ /: * ? " < > |
it: Il nome file non può contenere nessuno dei seguenti caratteri: \ /: *? < > |
ja: ファイル名に以下の文字は使用できません: \ /: * ? " < > |
ko: 파일 이름에는 다음 문자를 포함할 수 없습니다: \ /: * ? " < > |
pt: O nome do arquivo não pode conter os seguintes caracteres: \ /: * ? " < > |
ru: Имя файла не может содержать следующие символы: \ / : * ? " < > |
th: ชื่อไฟล์ไม่สามารถมีอักขระต่อไปนี้ได้: \ /: * ? " < > |
zh: 文件名不能包含以下字符：\ / : * ? " < > |

source: Download PDF
ar: تنزيل PDF
de: PDF herunterladen
es: Descargar PDF
fr: Télécharger PDF
he: הורד PDF
hi: PDF डाउनलोड करें
it: Scarica PDF
ja: PDFをダウンロード
ko: PDF 다운로드
pt: Baixar PDF
ru: Скачать PDF
th: ดาวน์โหลด PDF
zh: 下载PDF

source: View PDF
ar: عرض PDF
de: PDF anzeigen
es: Ver PDF
fr: Afficher le PDF
he: הצג PDF
hi: PDF देखें
it: Visualizza pdf
ja: PDFを表示
ko: PDF 보기
pt: Visualizar PDF
ru: Просмотреть PDF
th: ดู PDF
zh: 查看PDF

source: About
ar: عن
de: Um
es: Acerca de
fr: À propos
he: אודות
hi: जानकारी
it: Di
ja: 概要
ko: 정보
pt: Sobre
ru: О приложении
th: เกี่ยวกับ
zh: 关于

# getFullLifetimeAccess
source: Get Full Lifetime Access in 1.99
ar: احصل على وصول كامل مدى الحياة في 4.99
de: Erhalten Sie den vollen Lebenszugriff in 1.99
es: Obtenga acceso completo de por vida en 4.99
fr: Obtenez un accès complet à vie en 1.99
he: קבל גישה מלאה לכל החיים ב-1.99
hi: 4.99 में पूर्ण लाइफटाइम एक्सेस प्राप्त करें
it: Ottieni l'accesso completo a vita in 4.99
ja: 4.99で生涯フルアクセスを取得
ko: 4.99에 평생 이용권 구매
pt: Obtenha acesso vitalício completo por 1,99
ru: Получить полный пожизненный доступ за 4.99
th: รับสิทธิ์ใช้งานตลอดชีพในราคา 4.99
zh: 以4.99获取终身完全访问权限

source: View Purchase Details
ar: عرض تفاصيل الشراء
de: Kaufdetails anzeigen
es: Ver detalles de compra
fr: Afficher les détails de l'achat
he: הצג פרטי רכישה
hi: खरीदारी विवरण देखें
it: Visualizza i dettagli di acquisto
ja: 購入詳細を表示
ko: 구매 내역 보기
pt: Ver detalhes da compra
ru: Просмотреть детали покупки
th: ดูรายละเอียดการซื้อ
zh: 查看购买详情

source: Data Collection:
ar: جمع البيانات:
de: Datenerfassung:
es: Recopilación de datos:
fr: Collecte de données:
he: איסוף נתונים:
hi: डेटा संग्रह:
it: Collezione dei dati:
ja: データ収集：
ko: 데이터 수집:
pt: Coleta de Dados:
ru: Сбор данных:
th: การเก็บข้อมูล:
zh: 数据收集：

source: Invalid Filename
ar: اسم الملف غير صالح
de: Ungültiger Dateiname
es: Nombre de archivo inválido
fr: Nom de fichier invalide
he: שם קובץ לא חוקי
hi: अमान्य फ़ाइल नाम
it: Nome file non valido
ja: 無効なファイル名
ko: 잘못된 파일 이름
pt: Nome de arquivo inválido
ru: Неверное имя файла
th: ชื่อไฟล์ไม่ถูกต้อง
zh: 无效文件名

# freeFeatureRenewal
source: FREE FEATURES RENEW EVERY 3 DAYS
ar: تجدد الميزات المجانية كل 7 أيام
de: Kostenlose Funktionen alle 3 Tage erneuern
es: Características gratuitas Renovar cada 7 días
fr: Les fonctionnalités gratuites se renouvellent tous les 3 jours
he: תכונות חינמיות מתחדשות כל 3 ימים
hi: मुफ़्त सुविधाएँ हर 7 दिन बाद नवीनीकृत होती हैं
it: Le caratteristiche gratuite si rinnovano ogni 7 giorni
ja: 無料機能は7日ごとに更新されます
ko: 무료 기능은 7일마다 갱신됩니다
pt: RECURSOS GRATUITOS RENOVADOS A CADA 3 DIAS
ru: БЕСПЛАТНЫЕ ФУНКЦИИ ОБНОВЛЯЮТСЯ КАЖДЫЕ 7 ДНЕЙ
th: ฟีเจอร์ฟรีจะรีเซ็ตทุก 7 วัน
zh: 免费功能每7天刷新

# upgradePrompt
source: UPGRADE NOW WITH A ONE TIME PURCHASE & UNLOCK THE FULL POWER OF iSpeedPix2PDF 🚀.
ar: قم بالترقية الآن مع شراء وإلغاء تأمين الطاقة الكاملة لـ iSpeedPix2pdf 🚀.
de: Upgrade jetzt mit einem einmaligen Kauf und entsperren Sie die volle Leistung von iSpeedPix2pdf 🚀.
es: Actualice ahora con una compra única y desbloquea toda la potencia de iSpeedPix2PDF 🚀.
fr: Mettez à niveau maintenant avec un achat unique et déverrouillez la pleine puissance de iSpeedPix2pdf 🚀.
he: שדרג עכשיו ברכישה חד פעמית ופתח את מלוא העוצמה של iSpeedPix2PDF 🚀.
hi: एक बार की खरीदारी के साथ अभी अपग्रेड करें और iSpeedPix2PDF की पूरी शक्ति अनलॉक करें 🚀।
it: Aggiorna ora con un acquisto unico e sblocca la piena potenza di ISPEEDPIX2PDF 🚀.
ja: 今すぐ一括購入でアップグレードし、iSpeedPix2PDFの全機能をアンロック🚀。
ko: 한 번의 구매로 iSpeedPix2PDF의 모든 기능을 잠금 해제하세요 🚀
pt: ATUALIZE AGORA COM UMA COMPRA ÚNICA E DESBLOQUEIE TODO O PODER DO iSpeedPix2PDF 🚀.
ru: ОБНОВИТЕ ПРИЛОЖЕНИЕ ОДНОРАЗОВОЙ ПОКУПКОЙ И РАСКРОЙТЕ ПОЛНЫЙ ПОТЕНЦИАЛ iSpeedPix2PDF 🚀.
th: อัปเกรดตอนนี้ด้วยการซื้อครั้งเดียวและปลดล็อกพลังเต็มของ iSpeedPix2PDF 🚀
zh: 立即升级，一次购买，解锁iSpeedPix2PDF全部功能 🚀。

source: OK
ar: نعم
es: DE ACUERDO
fr: D'ACCORD
he: אישור
hi: ठीक है
ko: 확인
ru: ОК
th: ตกลง
zh: 确定

# rateAppTitle
source: Rate this app
ar: قيم هذا التطبيق
de: Bewerten diese App
es: Califica esta aplicación
fr: Évaluez cette application
he: דרג את האפליקציה
hi: इस ऐप को रेट करें
it: Valuta questa app
ja: このアプリを評価
ko: 앱 평가하기
pt: Avalie este app
ru: Оцените приложение
th: ให้คะแนนแอปนี้
zh: 评价此应用

# rateAppMessage
source: If you enjoy using this app, we'd really appreciate it if you could take a minute to leave a review! Your feedback helps us improve and won't take more than a minute of your time.
ar: إذا كنت تستمتع باستخدام هذا التطبيق ، فسنقدر ذلك حقًا إذا كان بإمكانك أن تستغرق دقيقة لترك مراجعة!
de: Wenn Sie diese App genießen, würden wir sie wirklich zu schätzen wissen, wenn Sie eine Minute Zeit nehmen könnten, um eine Bewertung zu hinterlassen!
es: Si disfrutas usando esta aplicación, ¡realmente te agradeceríamos si pudieras tomarte un minuto para dejar una reseña!
fr: Si vous aimez utiliser cette application, nous apprécierions vraiment si vous pouviez prendre une minute pour laisser un avis!
he: אם אתה נהנה מהשימוש באפליקציה, נשמח אם תיקח דקה לכתוב ביקורת! המשוב שלך עוזר לנו להשתפר ולא ייקח יותר מדקה מזמנך.
hi: यदि आपको यह ऐप पसंद आ रहा है, तो कृपया एक मिनट निकालकर समीक्षा दें! आपकी प्रतिक्रिया हमें बेहतर बनाने में मदद करती है और आपका समय ज्यादा नहीं लेगी।
it: Se ti piace usare questa app, lo apprezzeremmo davvero se potessi prendere un minuto per lasciare una recensione!
ja: このアプリを気に入っていただけたら、レビューを残していただけると嬉しいです！フィードバックは改善の助けになり、1分もかかりません。
ko: 이 앱을 즐겨 사용하신다면, 잠시 시간을 내어 리뷰를 남겨주세요! 여러분의 피드백은 저희가 앱을 개선하는 데 큰 도움이 됩니다.
pt: Se você gosta de usar este app, agradecemos muito se puder dedicar um minuto para deixar uma avaliação! Seu feedback nos ajuda a melhorar e não vai tomar mais do que um minuto do seu tempo.
ru: Если вам нравится наше приложение, пожалуйста, уделите минуту, чтобы оставить отзыв! Ваше мнение помогает нам стать лучше и займет не больше минуты.
th: ถ้าคุณชอบใช้แอปนี้ เราขอความกรุณาให้คุณสละเวลาสักครู่เพื่อเขียนรีวิว! ความคิดเห็นของคุณช่วยให้เราปรับปรุงและจะใช้เวลาไม่เกินหนึ่งนาที
zh: 如果您喜欢使用此应用，请花一分钟时间留下评价！您的反馈帮助我们改进，不会占用您太多时间。

# rateButton
source: RATE
ar: معدل
es: TASA
fr: TAUX
he: דרג
hi: रेट करें
it: VALUTARE
ja: 評価する
ko: 평가하기
pt: AVALIAR
ru: ОЦЕНИТЬ
th: ให้คะแนน
zh: 评价

# noThanksButton
source: NO THANKS
ar: ًلا شكرا
de: NEIN DANKE
es: NO, GRACIAS
fr: NON MERCI
he: לא תודה
hi: नहीं धन्यवाद
it: NO GRAZIE
ja: いいえ、結構です
ko: 괜찮아요
pt: NÃO, OBRIGADO
ru: НЕТ, СПАСИБО
th: ไม่ขอ
zh: 不，谢谢

# maybeLaterButton
source: MAYBE LATER
ar: ربما في وقت لاحق
de: Vielleicht später
es: Tal vez más tarde
fr: Peut-être plus tard
he: אולי מאוחר יותר
hi: शायद बाद में
it: Forse più tardi
ja: あとで
ko: 나중에 할게요
pt: TALVEZ MAIS TARDE
ru: МОЖЕТ БЫТЬ ПОЗЖЕ
th: อาจจะทีหลัง
zh: 稍后再说

source: Processing
ar: يعالج
de: Verarbeitung
es: Tratamiento
fr: Traitement
he: מעבד
hi: प्रक्रिया चल रही है
it: Elaborazione
ja: 処理中
ko: 처리 중
pt: Processando
ru: Обработка
th: กำลังดำเนินการ
zh: 处理中

source: Please wait
ar: انتظر من فضلك
de: Bitte warten
es: Espere por favor
fr: S'il vous plaît, attendez
he: אנא המתן
hi: कृपया प्रतीक्षा करें
it: attendere prego
ja: お待ちください
ko: 잠시만 기다려 주세요
pt: Por favor, aguarde
ru: Пожалуйста, подождите
th: กรุณารอสักครู่
zh: 请稍候

source: Trial Limit Reached
ar: وصل الحد من المحاكمة
de: Versuchsgrenze erreicht
es: Límite de prueba alcanzado
fr: Limite d'essai atteint
he: הגעת למגבלת הניסיון
hi: ट्रायल सीमा पूरी हुई
it: Limite di prova raggiunto
ja: 試用制限に達しました
ko: 체험 한도 도달
pt: Limite do teste alcançado
ru: Лимит пробной версии достигнут
th: ถึงขีดจำกัดทดลองใช้แล้ว
zh: 试用次数已用完

source: Privacy Policy
ar: سياسة الخصوصية
de: Datenschutzrichtlinie
es: política de privacidad
fr: politique de confidentialité
he: מדיניות פרטיות
hi: गोपनीयता नीति
it: Informativa sulla privacy
ja: プライバシーポリシー
ko: 개인정보처리방침
pt: Política de Privacidade
ru: Политика конфиденциальности
th: นโยบายความเป็นส่วนตัว
zh: 隐私政策

source: Creating PDF
ar: PDFإنشاء ملف
de: PDF erstellen
es: Creando PDF
fr: Création de PDF
he: יוצר PDF
hi: PDF बना रहे हैं
it: Creazione PDF
ja: PDFを作成中
ko: PDF 생성 중
pt: Criando PDF
ru: Создание PDF
th: กำลังสร้าง PDF
zh: 正在创建PDF

# loadingImagesInProgress
source: Loading Images
ar: تحميل الصور
de: Bilder laden
es: Cargando imágenes
fr: Chargement des images
he: טוען תמונות
hi: छवियाँ लोड हो रही हैं
it: Caricamento di immagini
ja: 画像を読み込み中
ko: 이미지 불러오는 중
pt: Carregando imagens
ru: Загрузка изображений
th: กำลังโหลดรูปภาพ
zh: 加载图片中

source: Subscription Required
ar: الاشتراك المطلوب
de: Abonnement erforderlich
es: Se requiere la suscripción
fr: Abonnement requis
he: נדרש מנוי
hi: सदस्यता आवश्यक
it: Abbonamento richiesto
ja: サブスクリプションが必要です
ko: 구독 필요
pt: Assinatura Necessária
ru: Требуется подписка
th: ต้องสมัครสมาชิก
zh: 需要订阅

# subscriptionMessageRequired
source: Please subscribe to continue using all features
ar: يرجى الاشتراك لمواصلة استخدام جميع الميزات
de: Bitte abonnieren Sie weiter, um alle Funktionen weiter zu verwenden
es: Suscríbase para continuar usando todas las funciones
fr: Veuillez vous abonner pour continuer à utiliser toutes les fonctionnalités
he: אנא הירשם כדי להמשיך להשתמש בכל הפונקציות
hi: सभी सुविधाओं का उपयोग जारी रखने के लिए कृपया सदस्यता लें
it: Iscriviti per continuare a utilizzare tutte le funzionalità
ja: すべての機能を利用するには購読してください
ko: 모든 기능을 사용하려면 구독해 주세요
pt: Por favor, assine para continuar usando todos os recursos
ru: Пожалуйста, оформите подписку для продолжения использования всех функций
th: กรุณาสมัครสมาชิกเพื่อใช้ฟีเจอร์ทั้งหมดต่อไป
zh: 请订阅以继续使用全部功能

# subscribeNowButton
source: Subscribe Now
ar: اشترك الآن
de: Jetzt abonnieren
es: Suscríbete ahora
fr: Abonnez-vous maintenant
he: הירשם עכשיו
hi: अब सदस्यता लें
it: Iscriviti ora
ja: 今すぐ購読
ko: 지금 구독하기
pt: Assine Agora
ru: Оформить подписку
th: สมัครสมาชิกตอนนี้
zh: 立即订阅

# restorePurchaseButton
source: Restore Purchase
ar: استعادة الشراء
de: Kauf wiederherstellen
es: Compra de restauración
fr: Restaurer l'achat
he: שחזר רכישה
hi: खरीदारी पुनः प्राप्त करें
it: Ripristina l'acquisto
ja: 購入を復元
ko: 구매 복원
pt: Restaurar Compra
ru: Восстановить покупку
th: คืนค่าการซื้อ
zh: 恢复购买

source: Purchase Restored Successfully
ar: شراء استعادة بنجاح
de: Kauf erfolgreich wiederhergestellt
es: Compra restaurada con éxito
fr: Acheter restauré avec succès
he: הרכישה שוחזרה בהצלחה
hi: खरीदारी सफलतापूर्वक पुनः प्राप्त की गई
it: Acquista ripristinato con successo
ja: 購入が正常に復元されました
ko: 구매 복원 성공
pt: Compra restaurada com sucesso
ru: Покупка успешно восстановлена
th: คืนค่าการซื้อสำเร็จแล้ว
zh: 购买恢复成功

# purchaseRestoreFailedError
source: Failed to Restore Purchase
ar: فشل في استعادة الشراء
de: Den Kauf nicht wiederhergestellt
es: No se pudo restaurar la compra
fr: Impossible de restaurer l'achat
he: שחזור הרכישה נכשל
hi: पुनः प्राप्त करने में विफल
it: Impossibile ripristinare l'acquisto
ja: 購入の復元に失敗しました
ko: 구매 복원 실패
pt: Falha ao restaurar compra
ru: Не удалось восстановить покупку
th: คืนค่าการซื้อไม่สำเร็จ
zh: 恢复购买失败

source: Storage Permission Required
ar: إذن التخزين المطلوب
de: Aufbewahrungserlaubnis erforderlich
es: Se requiere permiso de almacenamiento
fr: Autorisation de stockage requise
he: נדרש אישור אחסון
hi: स्टोरेज अनुमति आवश्यक
it: Autorizzazione di archiviazione richiesta
ja: ストレージ権限が必要です
ko: 저장소 권한 필요
pt: Permissão de Armazenamento Necessária
ru: Требуется разрешение на хранилище
th: ต้องได้รับอนุญาตจัดเก็บข้อมูล
zh: 需要存储权限

# storagePermissionMessageRequired
source: This app needs storage permission to save PDFs
ar: هذا التطبيق يحتاج إلى إذن تخزين لحفظ PDFs
de: Diese App benötigt Speicherberechtigungen zum Speichern von PDFs
es: Esta aplicación necesita permiso de almacenamiento para guardar archivos PDF
fr: Cette application a besoin de l'autorisation de stockage pour enregistrer des fichiers PDF.
he: אפליקציה זו דורשת אישור אחסון כדי לשמור קובצי PDF
hi: PDFs सहेजने के लिए इस ऐप को स्टोरेज अनुमति चाहिए
it: Questa app necessita dell'autorizzazione di accesso alla memoria per salvare i PDF
ja: PDFを保存するためにストレージ権限が必要です
ko: PDF 저장을 위해 저장소 권한이 필요합니다
pt: Este app precisa de permissão para armazenamento para salvar PDFs
ru: Для сохранения PDF приложению нужно разрешение на доступ к хранилищу
th: แอปนี้ต้องการอนุญาตจัดเก็บข้อมูลเพื่อบันทึกไฟล์ PDF
zh: 应用需要存储权限以保存PDF

# grantPermissionButton
source: Grant Permission
ar: منح المنحة
de: Erteilung der Erlaubnis
es: Otorgar permiso
fr: Autorisation d'octroi
he: הענק הרשאה
hi: अनुमति दें
it: Conto di concessione
ja: 権限を付与
ko: 권한 허용
pt: Conceder Permissão
ru: Разрешить доступ
th: อนุญาต
zh: 授权权限

# openSettingsButton
source: Open Settings
ar: فتح الإعدادات
de: Einstellungen geöffnet
es: Abrir configuración
fr: Paramètres ouvrir
he: פתח הגדרות
hi: सेटिंग्स खोलें
it: Impostazioni aperte
ja: 設定を開く
ko: 설정 열기
pt: Abrir Configurações
ru: Открыть настройки
th: เปิดการตั้งค่า
zh: 打开设置

# permissionDeniedError
source: Permission Denied
ar: تم رفض الإذن
de: Zugriff verweigert
es: Permiso denegado
fr: Permission refusée
he: ההרשאה נדחתה
hi: अनुमति अस्वीकृत
it: Permesso negato
ja: 権限が拒否されました
ko: 권한 거부됨
pt: Permissão Negada
ru: Доступ запрещен
th: ปฏิเสธการอนุญาต
zh: 权限被拒绝

source: Error While Creating PDF
ar: خطأ أثناء إنشاء PDF
de: Fehler beim Erstellen von PDF
es: Error al crear PDF
fr: Erreur lors de la création de PDF
he: שגיאה ביצירת PDF
hi: PDF बनाते समय त्रुटि
it: Errore durante la creazione di PDF
ja: PDF作成中にエラーが発生しました
ko: PDF 생성 중 오류 발생
pt: Erro ao criar PDF
ru: Ошибка при создании PDF
th: เกิดข้อผิดพลาดขณะสร้าง PDF
zh: 创建PDF时出错

# errorWhileSavingPdf
source: Error Saving PDF
ar: خطأ حفظ PDF
de: Fehler speichern PDF
es: Error al guardar PDF
fr: Erreur enregistrer le PDF
he: שגיאה בשמירת PDF
hi: PDF सहेजने में त्रुटि
it: Errore Salvataggio del PDF
ja: PDF保存中にエラーが発生しました
ko: PDF 저장 중 오류 발생
pt: Erro ao salvar PDF
ru: Ошибка при сохранении PDF
th: เกิดข้อผิดพลาดขณะบันทึก PDF
zh: 保存PDF时出错

# errorWhileLoadingImages
source: Error Loading Images
ar: خطأ تحميل الصور
de: Fehler laden Bilder
es: Error de carga de imágenes
fr: Erreur de chargement des images
he: שגיאה בטעינת תמונות
hi: छवियाँ लोड करते समय त्रुटि
it: Errore di caricamento delle immagini
ja: 画像読み込み中にエラーが発生しました
ko: 이미지 불러오기 오류
pt: Erro ao carregar imagens
ru: Ошибка при загрузке изображений
th: เกิดข้อผิดพลาดขณะโหลดรูปภาพ
zh: 加载图片时出错

source: PDF Created Successfully
ar: أنشأت PDF بنجاح
de: PDF erfolgreich erstellt
es: PDF creado con éxito
fr: PDF a créé avec succès
he: PDF נוצר בהצלחה
hi: PDF सफलतापूर्वक बनाया गया
it: PDF ha creato correttamente
ja: PDFが正常に作成されました
ko: PDF 생성 완료
pt: PDF criado com sucesso
ru: PDF успешно создан
th: สร้าง PDF สำเร็จ
zh: PDF创建成功

source: PDF Saved Successfully
ar: PDF حفظ بنجاح
de: PDF hat erfolgreich gespeichert
es: PDF guardado con éxito
fr: Le PDF a sauvé avec succès
he: PDF נשמר בהצלחה
hi: PDF सफलतापूर्वक सहेजा गया
it: PDF ha salvato con successo
ja: PDFが正常に保存されました
ko: PDF 저장 완료
pt: PDF salvo com sucesso
ru: PDF успешно сохранён
th: บันทึก PDF สำเร็จ
zh: PDF保存成功

# tryAgainButton
source: Try Again
ar: حاول ثانية
de: Versuchen Sie es erneut
es: Intentar otra vez
fr: Essayer à nouveau
he: נסה שוב
hi: फिर से प्रयास करें
it: Riprova
ja: 再試行
ko: 다시 시도
pt: Tentar novamente
ru: Попробовать снова
th: ลองใหม่
zh: 重试

# continueButton
source: Continue
ar: يكمل
de: Weitermachen
es: Continuar
fr: Continuer
he: המשך
hi: जारी रखें
it: Continuare
ja: 続行
ko: 계속
pt: Continuar
ru: Продолжить
th: ดำเนินการต่อ
zh: 继续

# cancelButton
source: Cancel
ar: يلغي
de: Stornieren
es: Cancelar
fr: Annuler
he: ביטול
hi: रद्द करें
it: Cancellare
ja: キャンセル
ko: 취소
pt: Cancelar
ru: Отмена
th: ยกเลิก
zh: 取消

# closeButton
source: Close
ar: يغلق
de: Schließen
es: Cerca
fr: Fermer
he: סגור
hi: बंद करें
it: Vicino
ja: 閉じる
ko: 닫기
pt: Fechar
ru: Закрыть
th: ปิด
zh: 关闭

# savingInProgress
source: Saving...
ar: توفير...
de: Retten ...
es: Ahorro...
fr: Économie...
he: שומר...
hi: सहेजा जा रहा है...
it: Risparmio...
ja: 保存中...
ko: 저장 중...
pt: Salvando...
ru: Сохранение...
th: กำลังบันทึก...
zh: 正在保存...

# downloadingInProgress
source: Downloading...
ar: تنزيل ...
de: Herunterladen ...
es: Descarga ...
fr: Téléchargement...
he: מוריד...
hi: डाउनलोड हो रहा है...
it: Download ...
ja: ダウンロード中...
ko: 다운로드 중...
pt: Baixando...
ru: Загрузка...
th: กำลังดาวน์โหลด...
zh: 正在下载...

# invalidFileTypeError
source: Invalid file type
ar: نوع الملف غير صالح
de: Ungültiger Dateityp
es: Tipo de archivo no válido
fr: Type de fichier non valide
he: סוג קובץ לא חוקי
hi: अमान्य फ़ाइल प्रकार
it: Tipo di file non valido
ja: 無効なファイルタイプです
ko: 잘못된 파일 형식
pt: Tipo de arquivo inválido
ru: Неверный тип файла
th: ชนิดไฟล์ไม่ถูกต้อง
zh: 无效的文件类型

# maxFileSizeExceeded
source: Maximum file size exceeded
ar: تم تجاوز الحد الأقصى لحجم الملف
de: Die maximale Dateigröße überschritten überschritten
es: Tamaño máximo de archivo excedido
fr: La taille maximale du fichier dépassée
he: חרגת מגודל הקובץ המרבי
hi: अधिकतम फ़ाइल आकार पार हो गया
it: Dimensione massima del file superata
ja: 最大ファイルサイズを超えています
ko: 최대 파일 크기 초과
pt: Tamanho máximo do arquivo excedido
ru: Превышен максимальный размер файла
th: ขนาดไฟล์เกินขีดจำกัด
zh: 超过最大文件大小

# maxImagesLimitReached
source: Maximum number of images reached
ar: تم الوصول إلى الحد الأقصى لعدد الصور
de: Maximale Anzahl von Bildern erreicht
es: Número máximo de imágenes alcanzadas
fr: Nombre maximum d'images atteintes
he: הגעת למספר התמונות המרבי
hi: अधिकतम छवि संख्या पहुंच गई
it: Numero massimo di immagini raggiunte
ja: 最大画像数に達しました
ko: 최대 이미지 수 도달
pt: Número máximo de imagens atingido
ru: Достигнуто максимальное количество изображений
th: ถึงขีดจำกัดจำนวนรูปภาพสูงสุดแล้ว
zh: 达到图片最大数量
